{
    "Acrobatic Spellcaster": {
      "prerequisites": {
        "Feat": "Combat Casting",
        "Skill": {
          "Spellcraft": 5
        }
      },
      "benefit": "While casting spells with an acrobatic flourish, you reduce the chance of provoking attacks of opportunity."
    },
    "Adder Strike": {
      "prerequisites": {
        "Special": "Poison use class feature",
        "Feat": "Improved Unarmed Strike",
        "Skill": {
          "Craft (alchemy)": 1
        }
      },
      "benefit": "May apply contact poison to unarmed strikes"
    },
    "Pinpoint Poisoner": {
      "prerequisites": {
        "Feat": "Adder Strike",
        "Alternative": [
          {
            "Feat": "Two-Weapon Fighting"
          },
          {
            "Special": "flurry of blows class feature"
          }
        ],
        "Skill": {
          "Craft (alchemy)": 6
        }
      },
      "benefit": "When using Adder Strike, you may poison two blowgun darts that can be used in melee"
    },
    "Advanced Armor Training": {
      "prerequisites": {
        "Special": "Armor training class feature",
        "Class": {
          "Fighter": 3
        }
      },
      "benefit": "Select one advanced armor training option."
    },
    "Advanced Defensive Combat Training": {
      "prerequisites": {
        "Feat": "Defensive Combat Training"
      },
      "benefit": "Gain a +4 bonus to your CMD"
    },
    "Advanced Weapon Training": {
      "prerequisites": {
        "Class": {
          "Fighter": 5
        },
        "Special": "weapon training class feature"
      },
      "benefit": "Select one advanced weapon training option, applying it to one fighter weapon group you have already selected with the weapon training class feature."
    },
    "Agile Maiden": {
      "prerequisites": {
        "Stat": {
          "STR": 13,
          "DEX": 13
        },
        "Alternative": [
          {
            "Feat": "Endurance"
          },
          {
            "Special": "armor training class feature"
          }
        ],
        "Special": "proficient with heavy armor"
      },
      "benefit": "For the purpose of class features (such as a ranger’s combat style, a barbarian’s fast movement, or a magus’s spellcasting), you treat Gray Maiden plate as medium armor or heavy armor, whichever is more beneficial to a given ability. This does not affect the armor’s statistics, and it is still considered heavy armor for all other purposes."
    },
    "Agile Maneuvers": {
      "prerequisites": {},
      "benefit": "Use your Dex bonus when calculating your CMB"
    },
    "Alchemical Strike": {
      "prerequisites": {
        "Feat": "Throw Anything",
        "BAB": 6
      },
      "benefit": "You can throw a single alchemical item as a full-attack action, increasing the effectiveness of the alchemical agent thrown"
    },
    "All-Consuming Swing": {
      "prerequisites": {
        "Stat": {
          "STR": 13
        },
        "Feats": [
          "Power Attack",
          "Cleave",
          "Vital Strike"
        ],
        "BAB": 8
      },
      "benefit": "When you Cleave or Great Cleave, you can apply the additional damage you would gain from Vital Strike, Improved Vital Strike, or Greater Vital Strike to the initial target of your attack. When you do so, the strain on your body causes you to take an amount of damage equal to the extra damage dealt by your Vital Strike feat. This self-inflicted damage is not reduced by damage reduction."
    },
    "Amateur Gunslinger": {
      "prerequisites": {
        "Special": "No levels in a class with grit class feature"
      },
      "benefit": "Gain limited amount of grit and access to gunslinger deeds"
    },
    "Amateur Swashbuckler": {
      "prerequisites": {
        "Special": "No levels in a class that has panache"
      },
      "benefit": "Gain a minor pool of panache to use with a 1st-level swashbuckler deed of your choice"
    },
    "Ambush Awareness": {
      "prerequisites": {
        "Feat": "Alertness"
      },
      "benefit": "Take total defense action when surprised"
    },
    "Ambush Sense": {
      "prerequisites": {
        "Stat": {
          "INT": 13
        },
        "Special": "trap sense class feature"
      },
      "benefit": "You gain a bonus on Perception checks made to determine awareness for the surprise round of combat, and a dodge bonus to AC in any surprise round in which you get to act. These bonuses are equal to the bonus you gain from trap sense."
    },
    "Ambush Squad": {
      "prerequisites": {
        "BAB": 1,
        "Race": "Kobold"
      },
      "benefit": "Take both a move action and a standard action on a surprise round when you and ally can both act"
    },
    "Ammo Drop": {
      "prerequisites": {
        "Skill": {
          "Sleight Of Hand": 1
        },
        "Special": "proficient with sling"
      },
      "benefit": "Load a sling or one end of a double-sling with one hand as a swift action or move action which does not provoke attacks of opportunity."
    },
    "Anatomical Savant": {
      "prerequisites": {
        "Feat": "Weapon Focus",
        "BAB": 12
      },
      "benefit": "Choose one weapon with which you have the Weapon Focus feat. When you strike an opponent that has a chance of negating critical hits or sneak attacks, such as from the fortification armor special ability, reduce that chance by 25%. Treat creatures that are normally immune to critical hits and sneak attacks as instead having a 75% chance to negate the critical hit or sneak attack, taking only the attack’s normal damage"
    },
    "Ancestral Enmity": {
      "prerequisites": {
        "Special": "Giant subtype"
      },
      "benefit": "You gain a +2 bonus on melee attack rolls against dwarves and gnomes"
    },
    "Ancestral Weapon Mastery": {
      "prerequisites": {
        "BAB": 1,
        "Special": "weapon familiarity racial trait"
      },
      "benefit": "Gain proficiency with your race’s racial weapons or gain a bonus Weapon Focus feat with one racial weapon at a time"
    },
    "Animal Ferocity": {
      "prerequisites": {
        "BAB": 3,
        "Special": "ferocity racial ability"
      },
      "benefit": "Make full attacks at negative hit points but at a –5 penalty"
    },
    "Ankle Biter": {
      "prerequisites": {
        "Race": "Goblin",
        "Skill": {
          "Escape Artist": 1
        }
      },
      "benefit": "Bite an opponent that targets you with a combat maneuver as an immediate action."
    },
    "Anticipate Dodge": {
      "prerequisites": {
        "Feats": [
          "Dodge",
          "Mobility"
        ],
        "BAB": 7,
        "Alternative": [
          {
            "Class": {
              "Brawler": 4
            }
          },
          {
            "Class": {
              "Monk": 4
            }
          }
        ]
      },
      "benefit": "Gain up to a +2 bonus on attack rolls against creatures with a dodge bonus"
    },
    "Aquatic Combatant": {
      "prerequisites": {
        "Skill": {
          "Swim": 1
        }
      },
      "benefit": "+2 bonus on Swim checks; avoid normal penalties on melee attack rolls underwater"
    },
    "Arc Slinger": {
      "prerequisites": {
        "Feat": "Point-Blank Shot",
        "Alternative": [
          {
            "Special": "proficient with sling"
          },
          {
            "Special": "proficient with halfling sling staff"
          }
        ]
      },
      "benefit": "Reduce ranged attack penalties due to range by 2"
    },
    "Arcane Armor Mastery": {
      "prerequisites": {
        "Feats": [
          "Arcane Armor Training",
          "Armor Proficiency, Medium"
        ],
        "CL": 7
      },
      "benefit": "Reduce your arcane spell failure chance by 20%"
    },
    "Arcane Armor Training": {
      "prerequisites": {
        "Feats": [
          "Armor Proficiency, Light"
        ],
        "CL": 3
      },
      "benefit": "Reduce your arcane spell failure chance by 10%"
    },
    "Arcane Strike": {
      "prerequisites": {
        "Special": "ability to cast arcane spells"
      },
      "benefit": "+1 damage and weapons are considered magic"
    },
    "Archon Style": {
      "prerequisites": {
        "Feats": [
          "Combat Expertise",
          "Combat Reflexes"
        ],
        "Alternative": [
          {
            "BAB": 2
          },
          {
            "Class": {
              "Monk": 2
            }
          }
        ]
      },
      "benefit": "Grant adjacent allies +2 dodge bonus to AC against single adjacent opponent’s next melee attack (as long as that attack comes before the beginning of your next turn), but you take –2 AC against that opponent until your next turn."
    },
    "Archon Diversion": {
      "prerequisites": {
        "Feats": [
          "Archon Style",
          "Combat Expertise",
          "Combat Reflexes"
        ],
        "Alternative": [
          {
            "BAB": 4
          },
          {
            "Class": {
              "Monk": 4
            }
          }
        ]
      },
      "benefit": "1/rnd when using Archon Style, if have at least one hand free, divert 1 melee weapon attack that would have struck an adjacent ally and take the hit instead, using your own AC to determine whether the attack hits (see text for more details.)"
    },
    "Archon Justice": {
      "prerequisites": {
        "Feats": [
          "Archon Diversion",
          "Archon Style",
          "Combat Expertise",
          "Combat Reflexes"
        ],
        "Alternative": [
          {
            "BAB": 8
          },
          {
            "Class": {
              "Monk": 7
            }
          }
        ]
      },
      "benefit": "Take no penalty to AC when using Archon Style and can spend a swift action instead of a move action to use this ability. Whenever you take damage from using Archon Diversion to divert an opponent’s attack toward yourself, any allies threatening your opponent can make an AOO against the diverted opponent."
    },
    "Arcing Weapon": {
      "prerequisites": {
        "Special": "diverse training class feature"
      },
      "benefit": "As a standard action, you can cast a ray spell that requires a ranged touch attack and deliver the effect through your melee weapon, either through a melee attack or as a ranged attack. If you deliver this spell as a melee attack, this functions as the magus spellstrike ability."
    },
    "Armor Adept": {
      "prerequisites": {},
      "benefit": "Choose two armor modifications (such as deflecting or jarring). You no longer suffer the drawbacks of wearing armor with those modifications."
    },
    "Armor Focus": {
      "prerequisites": {
        "BAB": 1,
        "Special": "proficient with selected armor"
      },
      "benefit": "Select one type of armor, such as chain shirt or splint mail. The AC bonus granted by the selected armor increases by 1."
    },
    "Improved Armor Focus": {
      "prerequisites": {
        "Feat": "Armor Focus",
        "BAB": 6,
        "Special": "proficient with selected armor"
      },
      "benefit": "The armor check penalty of the selected armor decreases by 1 (to a minimum of 0). You also use your character level in place of your base attack bonus for the purpose of armor mastery feat prerequisites."
    },
    "Armor Proficiency, Light": {
      "prerequisites": {},
      "benefit": "No penalties on attack rolls while wearing light armor"
    },
    "Armor Proficiency, Medium": {
      "prerequisites": {
        "Feat": "Armor Proficiency, Light"
      },
      "benefit": "No penalties on attack rolls while wearing medium armor"
    },
    "Armor Proficiency, Heavy": {
      "prerequisites": {
        "Feat": "Armor Proficiency, Medium"
      },
      "benefit": "No penalties on attack rolls while wearing heavy armor"
    },
    "Armor Trick": {
      "prerequisites": {
        "BAB": 1
      },
      "benefit": "You can use any armor tricks related to the chosen armor option if you meet the trick’s prerequisites and are proficient with any armor that you use as part of the trick."
    },
    "Armored Athlete": {
      "prerequisites": {
        "Special": [
          "proficient with light armor",
          "proficient with medium armor"
        ],
        "Skill": {
          "Any Dex/Str-based skill": 3
        }
      },
      "benefit": "Choose one Dexterity – or Strength-based skill in which you possess at least 3 ranks. When you attempt a check for the chosen skill, your armor check penalty on that check for wearing light or medium armor is reduced by 3 (to a minimum of 0). If you have 10 or more ranks in the skill, the penalty is instead reduced by 6 (to a minimum of 0). If you have armor training 2 and are proficient with heavy armor, this benefit also applies to armor check penalties for wearing heavy armor."
    },
    "Artful Dodge": {
      "prerequisites": {
        "Stat": {
          "INT": 13
        }
      },
      "benefit": "If you are the only character threatening an opponent, you gain a +1 dodge bonus to AC against that opponent."
    },
    "Artillery Team": {
      "prerequisites": {
        "Special": "proficient with light crossbow, heavy crossbow, or musket",
        "Size": "Small or Medium"
      },
      "benefit": "Ally with this feat can help you load and fire a Large light crossbow, heavy crossbow, or musket"
    },
    "Artistry": {
      "prerequisites": {
        "Feats": [
          "Exotic Weapon Proficiency (dueling sword)",
          "Weapon Finesse"
        ],
        "BAB": 2
      },
      "benefit": "Choose one of the following combat maneuvers: disarm, reposition, steal, sunder, or trip. You gain a +2 bonus when performing the selected maneuver while wielding a dueling sword. This bonus does not stack with the bonus provided by a combat maneuver feat with -improved- in its name (such as Improved Trip)."
    },
    "Ascetic Style": {
      "prerequisites": {
        "Feat": "Weapon Focus (chosen melee weapon)",
        "Alternative": [
          {
            "BAB": 1
          },
          {
            "Class": {
              "Monk": 1
            }
          }
        ]
      },
      "benefit": "Choose one weapon from the monk fighter weapon group. While using this style and wielding the chosen weapon, you can apply the effects of feats that have Improved Unarmed Strike as a prerequisite, as well as effects that augment an unarmed strike, as if attacks with the weapon were unarmed attacks."
    },
    "Ascetic Form": {
      "prerequisites": {
        "Feats": [
          "Ascetic Style",
          "Weapon Focus (chosen melee weapon)"
        ],
        "Alternative": [
          {
            "BAB": 5
          },
          {
            "Class": {
              "Monk": 5
            }
          }
        ]
      },
      "benefit": "You can use the chosen melee weapon with any class ability that can be used with an unarmed strike, such as an unchained monk’s style strike ability. In addition, you are treated as a monk with a level equal to your character level for the purpose of determining the number of times per day that you can use feats with uses per day that depend upon your monk level, such as the Stunning Fist or Perfect Strike feats."
    },
    "Ascetic Strike": {
      "prerequisites": {
        "Feats": [
          "Ascetic Form",
          "Ascetic Style",
          "Weapon Focus (chosen weapon)"
        ],
        "Alternative": [
          {
            "BAB": 7
          },
          {
            "Class": {
              "Monk": 7
            }
          }
        ]
      },
      "benefit": "You can use the unarmed strike damage of a monk 4 levels lower than your character level (minimum 1st) instead of the base damage for the chosen weapon. Ascetic Strike functions in all other ways as the brawler’s close weapon mastery class feature."
    },
    "Awe-Inspiring Smash": {
      "prerequisites": {
        "Stat": {
          "STR": 15
        },
        "Feat": "Power Attack",
        "BAB": 3
      },
      "benefit": "You can apply your Strength modifier instead of your Charisma modifier to performance combat checks. In addition, when you spend a swift action to attempt a performance combat check that was triggered by a successful bull rush or sunder combat maneuver check, you gain a +2 bonus on the performance combat check. For every 5 points by which your attack exceeded your opponent’s CMD, this bonus increases by 2."
    },
    "Awesome Blow": {
      "prerequisites": {
        "Stat": {
          "STR": 25
        },
        "Feats": [
          "Power Attack",
          "Improved Bull Rush"
        ],
        "Size": "Large or larger"
      },
      "benefit": "This creature can send opponents flying"
    },
    "Improved Awesome Blow": {
      "prerequisites": {
        "Stat": {
          "STR": 13
        },
        "Alternative": [
          {
            "Feat": "Awesome Blow"
          },
          {
            "Special": "awesome blow class feature"
          }
        ],
        "Feat": "Power Attack"
      },
      "benefit": "+2 on awesome blow combat maneuver checks and to CMD against such attacks, and movement due to awesome blow provokes from allies"
    },
    "Awesome Charge": {
      "prerequisites": {
        "Stat": {
          "STR": 25
        },
        "Feats": [
          "Awesome Blow",
          "Improved Bull Rush",
          "Power Attack"
        ]
      },
      "benefit": "When you hit your opponent with a charge attack, you can attempt an awesome blow combat maneuver against that opponent as a free action."
    },
    "Awesome Throw": {
      "prerequisites": {
        "Stat": {
          "STR": 25
        },
        "Alternative": [
          {
            "Feat": "Throw Anything"
          },
          {
            "Special": "rock throwing"
          }
        ],
        "Feat": "Improved Bull Rush",
        "Size": "Large or larger"
      },
      "benefit": "As a standard action, you can perform the awesome throw combat maneuver. You do this by making a thrown weapon attack; if you don’t have the Throw Anything feat, you must use a large, bulky, and relatively regular-shaped object with a hardness of at least 5 (such as a rock or treasure chest). If that attack hits a corporeal opponent smaller than you, the opponent takes damage and is knocked away, flying 10 feet in a straight line away from you and falling prone. If an obstacle prevents the completion of your target’s move, the target and the obstacle each take 1d6 points of damage, and the target is knocked prone in a space adjacent to the obstacle."
    },
    "Banner of Doom": {
        "prerequisites": {
        "BAB": 8,
        "Special": "banner class feature",
        "Race": "tiefling"
        },
        "benefit": "Enemies within 60 ft. that can see your banner take a –2 penalty on saving throws against fear."
    },
    "Barrage of Styles": {
        "prerequisites": {
        "BAB": 1,
        "Race": "human"
        },
        "benefit": "Adjacent allies with this feat grant you a cumulative +1 bonus (max +4) on combat maneuver checks"
    },
    "Barroom Brawler": {
        "prerequisites": {
        "BAB": 4
        },
        "benefit": "Once per day, gain the use of a combat feat you don’t possess for 1 minute"
    },
    "Bashing Finish": {
        "prerequisites": {
        "Feats": [
            "Shield Master",
            "Two-Weapon Fighting"
        ],
        "BAB": 11
        },
        "benefit": "Make a free shield bash after a critical hit"
    },
    "Battle Cry": {
        "prerequisites": {
        "Stat": {
            "CHA": 13
        },
        "Alternative": [
            {
            "BAB": 5
            },
            {
            "Skill": {
                "Perform (act, oratory, or sing)": 5
            }
            }
        ]
        },
        "benefit": "Let out a cry that grants allies a +1 bonus on attack rolls and +4 bonus on saves against fear"
    },
    "Bear’s Balance": {
        "prerequisites": {
        "Feat": "Iron Will",
        "Special": "rage class feature"
        },
        "benefit": "Gain a +2 bonus on Intimidate checks when not raging. When you fail a save vs. a fear effect, you can choose to rage rather than succumb to fear."
    },
    "Beast Hunter": {
        "prerequisites": {
        "BAB": 1,
        "Alternative": [
            {
            "Skill": {
                "Knowledge (nature)": 1
            }
            },
            {
            "Skill": {
                "Survival": 1
            }
            }
        ]
        },
        "benefit": "+2 bonus to track and +1 bonus to AC and on attacks against larger animals in a chosen terrain"
    },
    "Improved Beast Hunter": {
        "prerequisites": {
        "Feat": "Beast Hunter",
        "BAB": 3,
        "Alternative": [
            {
            "Skill": {
                "Knowledge (nature)": 3
            }
            },
            {
            "Skill": {
                "Survival": 3
            }
            }
        ]
        },
        "benefit": "Gain bonuses on combat maneuver checks, CMD, and Reflex saves when fighting animals larger than you in a chosen terrain"
    },
    "Greater Beast Hunter": {
        "prerequisites": {
        "Feats": [
            "Beast Hunter",
            "Improved Beast Hunter"
        ],
        "BAB": 6,
        "Alternative": [
            {
            "Skill": {
                "Knowledge (nature)": 6
            }
            },
            {
            "Skill": {
                "Survival": 6
            }
            }
        ]
        },
        "benefit": "Act normally in surprise round when surprised by an animal in a chosen terrain; +4 bonus on rolls to confirm critical hits against animals native to that terrain"
    },
    "Befuddling Strike": {
        "prerequisites": {
        "Stat": {
            "DEX": 13,
            "WIS": 13
        },
        "Feat": "Improved Unarmed Strike",
        "BAB": 8
        },
        "benefit": "Confuse opponent with unarmed strike"
    },
    "Betrayal Sense": {
        "prerequisites": {
        "Stat": {
            "WIS": 13
        },
        "Class": {
            "Rogue": 3
        },
        "Special": "trap sense class feature"
        },
        "benefit": "Apply trap sense on checks to see through disguises and avoid surprise attacks"
    },
    "Betraying Blow": {
        "prerequisites": {
        "Feat": "Solo Maneuvers",
        "BAB": 8
        },
        "benefit": "When you deal nonlethal damage to a creature only you threaten, roll a Bluff check to deal additional nonlethal damage."
    },
    "Binding Throw": {
        "prerequisites": {
        "Feats": [
            "Improved Grapple",
            "Improved Trip",
            "Ki Throw"
        ]
        },
        "benefit": "After successful Ki Throw, you may attempt to grapple"
    },
    "Blade Binder": {
        "prerequisites": {
        "BAB": 4,
        "Special": "proficient with khopesh or temple sword"
        },
        "benefit": "+2 bonus to CMB checks with blade-binding."
    },
    "Blades Above and Below": {
        "prerequisites": {
        "BAB": 6
        },
        "benefit": "When fighting with a differently sized ally, you flank an adjacent foe from any position"
    },
    "Blazing Aura": {
        "prerequisites": {
        "Feats": [
            "Inner Flame",
            "Scorching Weapons"
        ],
        "Level": 13,
        "Race": "Ifrit"
        },
        "benefit": "When you use Scorching Weapons, on your turn as a free action, you may create an aura of heat that lasts for 1 round. This aura deals 1d6 points of fire damage to any creature that begins its turn adjacent to you."
    },
    "Bleeding Attack": {
        "prerequisites": {
        "Feat": "Improved Unarmed Strike"
        },
        "benefit": "+1d4 bleed damage with unarmed strikes"
    },
    "Blind-Fight": {
        "prerequisites": {},
        "benefit": "Reroll miss chances for concealment"
    },
    "Blind-Fight, Improved": {
        "prerequisites": {
        "Skill": {
            "Perception": 10
        },
        "Feat": "Blind-Fight"
        },
        "benefit": "Total concealment is considered normal concealment"
    },
    "Blind-Fight, Greater": {
        "prerequisites": {
        "Skill": {
            "Perception": 15
        },
        "Feats": [
            "Blind-Fight",
            "Blind-Fight, Improved"
        ]
        },
        "benefit": "Ignore miss chance for less than total concealment"
    },
    "Blinded Blade Style": {
        "prerequisites": {
        "Feat": "Blind-Fight",
        "Skill": {
            "Perception": 5
        }
        },
        "benefit": "While you are using this style, you gain a number of benefits whenever you are blinded or unable to see (including when you wear a blindfold or close your eyes). Under such circumstances, you do not take any penalties on Strength– or Dexterity-based skill checks due to blindness. In addition, you gain a +4 bonus on hearing- and smell-based Perception checks and gain the scent special ability with a range of 10 feet; if you already have scent, the range of your scent ability increases by 10 feet instead. Having this feat counts as having 10 ranks in Perception for the purpose of satisfying the prerequisites of the Improved Blind-Fight feat, as well as any feat that lists Improved Blind-Fight as a prerequisite."
    },
    "Blinded Competence": {
        "prerequisites": {
        "Feats": [
            "Blinded Blade Style",
            "Blind-Fight",
            "Blind-Fight, Improved"
        ],
        "Skill": {
            "Perception": 10
        }
        },
        "benefit": "While you are using Blinded Blade Style and you are blinded or unable to see, you do not need to succeed at Perception checks to pinpoint the location of creatures within reach of your melee weapon, or your unmodified reach if you are not wielding a melee weapon. This ability functions like blindsense, except creatures you cannot see do not gain total concealment against you. Having this feat counts as having 15 ranks in Perception for the purpose of satisfying the prerequisites of the Greater Blind-Fight feat, as well as any feat that lists Greater Blind-Fight as a prerequisite."
    },
    "Blinded Master": {
        "prerequisites": {
        "Feats": [
            "Blind-Fight",
            "Blinded Blade Style",
            "Greater Blind-Fight",
            "Blind-Fight, Improved"
        ],
        "Skill": {
            "Perception": 15
        }
        },
        "benefit": "While you are using Blinded Blade Style and you are blinded or unable to see, your ability to pinpoint creatures’ locations using Blinded Competence improves to function like blindsight rather than blindsense, and the range increases to 30 feet. In addition, you add half your character level to the DCs of Bluff checks to feint you in combat."
    },
    "Blinding Flash": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": "Combat Expertise",
        "Special": "special (see text)"
        },
        "benefit": "As a move action gaze attack, reflect light into foe’s eyes, dazzling foe for 1 round."
    },
    "Blinding Light": {
        "prerequisites": {
        "Feat": "Inner Light",
        "Race": "aasimar",
        "Special": "daylight spell-like ability"
        },
        "benefit": "Whenever an enemy unsuccessfully attempts to counter or dispel your daylight spell-like ability, it must succeed at a Fortitude saving throw (DC 10 + 1/2 your character level + your Charisma modifier) or become blinded for 1 round as its mind is overwhelmed with celestial light. This is a supernatural mind-affecting effect."
    },
    "Blinding Sneak Attack": {
        "prerequisites": {
        "BAB": 5,
        "Special": [
            "darkness spell-like ability",
            "sneak attack class feature"
        ],
        "Race": "tiefling"
        },
        "benefit": "If you deal sneak attack damage to a foe while you are within magical darkness, you blind the opponent for 1 round unless they make a successful Fortitude save."
    },
    "Blistering Feint": {
        "prerequisites": {
        "Feats": [
            "Combat Expertise",
            "Improved Feint"
        ],
        "Race": "Ifrit"
        },
        "benefit": "You gain a +2 bonus on feint checks made while wielding a weapon that deals fire damage. Anytime you successfully feint a creature while using such a weapon, you may deal its fire damage to the enemy."
    },
    "Blood Beak": {
        "prerequisites": {
        "BAB": 5,
        "Special": "natural weapon racial trait",
        "Race": "Tengu"
        },
        "benefit": "Increase the damage of your beak attack to 1d6. Furthermore, when you confirm a critical hit with your beak attack, you also deal 1 point of bleed damage. The bleed effect from this feat stacks with that of the Bleeding Critical feat and similar effects, adding 1 point to your bleed damage."
    },
    "Blooded Arcane Strike": {
        "prerequisites": {
        "Feat": "Arcane Strike",
        "Special": "bloodrage class feature"
        },
        "benefit": "Gain the benefits of Arcane Strike while bloodraging"
    },
    "Blood Feast": {
        "prerequisites": {
        "Special": "Bite attack"
        },
        "benefit": "Gain morale bonuses after biting living creatures"
    },
    "Blood Spurt": {
        "prerequisites": {
        "BAB": 2,
        "Special": "susceptibility to bleed"
        },
        "benefit": "Adjacent foes risk being blinded when dealing you bleed damage"
    },
    "Bloody Assault": {
        "prerequisites": {
        "Feat": "Power Attack",
        "BAB": 6
        },
        "benefit": "Trade melee attack bonus for bleed damage"
    },
    "Bloody Vengeance": {
        "prerequisites": {
        "BAB": 1
        },
        "benefit": "Make an opponent that damaged you take bleed damage next time you hit it."
    },
    "Bludgeoner": {
        "prerequisites": {},
        "benefit": "Inflict nonlethal damage with bludgeoning weapons"
    },
    "Blundering Defense": {
        "prerequisites": {
        "Feat": "Cautious Fighter",
        "Race": "halfling"
        },
        "benefit": "Whenever you fight defensively or use the total defense action, allies gain a luck bonus to AC and CMD equal to 1/2 the dodge bonus you gain from the action you are taking. Allies only gain this bonus while they are adjacent to you."
    },
    "Bodyguard": {
        "prerequisites": {
        "Feat": "Combat Reflexes"
        },
        "benefit": "Use AOO to add a bonus to adjacent ally’s AC"
    },
    "Body Shield": {
        "prerequisites": {
        "Feat": "Improved Grapple",
        "BAB": 6
        },
        "benefit": "Gain cover against attacks while grappling"
    },
    "Branch Pounce": {
        "prerequisites": {
        "Skill": {
            "Climb": 3,
            "Stealth": 3
        }
        },
        "benefit": "Deal additional damage on a target you leap down upon from above"
    },
    "Bounding Hammer": {
        "prerequisites": {
        "BAB": 6,
        "Special": "proficient with hammer"
        },
        "benefit": "Learn to bounce thrown hammers off of your opponents so they return to you"
    },
    "Break Guard": {
        "prerequisites": {
        "Feats": [
            "Improved Disarm",
            "Two-Weapon Fighting"
        ]
        },
        "benefit": "May attack opponent you attempted to disarm with your second weapon"
    },
    "Brutal Coup de Grace": {
        "prerequisites": {
        "Feats": [
            "Dazzling Display",
            "Weapon Focus"
        ],
        "BAB": 5,
        "Special": "proficient with the selected weapon"
        },
        "benefit": "Successful coup de grace disheartens nearby enemies"
    },
    "Brutal Grappler": {
        "prerequisites": {
        "Race": [
            "Half-orc",
            "Orc"
        ]
        },
        "benefit": "Damage a target while grappling"
    },
    "Brute Style": {
        "prerequisites": {
        "Stat": {
            "STR": 15,
            "INT": 13
        },
        "Feats": [
            "Combat Reflexes",
            "Improved Overrun",
            "Improved Trip",
            "Improved Unarmed Strike",
            "Vicious Stomp"
        ],
        "BAB": 6
        },
        "benefit": "Use Vicious Stomp within 10 feet"
    },
    "Brute Stomp": {
        "prerequisites": {
        "Stat": {
            "STR": 19
        },
        "Feat": "Brute Style",
        "BAB": 8
        },
        "benefit": "Make an extra unarmed attack when starting next to a prone foe"
    },
    "Brute Assault": {
        "prerequisites": {
        "Stat": {
            "STR": 23
        },
        "Feats": [
            "Brute Stomp",
            "Brute Style"
        ],
        "BAB": 10
        },
        "benefit": "Weaken tripped foes and reduce their move speed"
    },
    "Bulette Charge Style": {
        "prerequisites": {
        "Stat": {
            "STR": 13
        },
        "Feats": [
            "Improved Overrun",
            "Power Attack"
        ],
        "Special": "proficient with heavy armor"
        },
        "benefit": "While using this style, you gain a +4 bonus feats on combat maneuver checks to overrun an opponent. Any magic ability or material that reduces your armor check penalty also reduces the bonus you gain for this style."
    },
    "Bulette Rampage": {
        "prerequisites": {
        "Stat": {
            "STR": 15
        },
        "Feats": [
            "Bulette Charge Style",
            "Bulette Leap",
            "Improved Overrun",
            "Power Attack"
        ],
        "Special": "proficient with heavy armor"
        },
        "benefit": "While you’re using Bulette Charge Style, whenever you succeed at an overrun combat maneuver check against a foe, that foe takes an amount of damage equal to 1d8 (if your size is Medium) or 1d6 (if your size is Small) + 1/2 your armor bonus to AC + 1-1/2 times your Strength bonus."
    },
    "Bulette Leap": {
        "prerequisites": {
        "Stat": {
            "STR": 15
        },
        "Feats": [
            "Bulette Charge Style",
            "Improved Overrun",
            "Power Attack"
        ],
        "Special": "proficient with heavy armor"
        },
        "benefit": "While using Bulette Charge Style, you gain a bonus on Acrobatics checks to jump equal to your Strength bonus. Additionally, when you perform an overrun combat maneuver, you can attempt to overrun multiple foes, but you take a cumulative –2 penalty on each successive overrun attempt in the same round. If an overrun attempt fails, you cannot make any further attempts until your next round."
    },
    "Bull Rush, Improved": {
        "prerequisites": {
        "Feat": "Power Attack"
        },
        "benefit": "+2 bonus on bull rush attempts, no AOO"
    },
    "Bull Rush, Greater": {
        "prerequisites": {
        "Feat": "Bull Rush, Improved",
        "BAB": 6
        },
        "benefit": "Enemies you bull rush provoke attacks of opportunity"
    },
    "Bull Rush Strike": {
        "prerequisites": {
        "Feat": "Bull Rush, Improved",
        "BAB": 9
        },
        "benefit": "Attempt a bull rush on a successful critical hit"
    },
    "Bullseye Shot": {
        "prerequisites": {
        "Feats": [
            "Point-Blank Shot",
            "Precise Shot"
        ],
        "BAB": 5
        },
        "benefit": "Spend a move action to gain a +4 bonus to next ranged attack before end of your turn."
    },
    "Bullying Blow": {
        "prerequisites": {
        "Skill": {
            "Intimidate": 1
        },
        "Race": "orc"
        },
        "benefit": "As a standard action, you may make a melee attack with a –2 penalty on the attack roll. If the attack damages your opponent, you may make an Intimidate check to demoralize that opponent as a free action."
    },
    "Burn it Down!": {
        "prerequisites": {
        "BAB": 1,
        "Race": "goblin"
        },
        "benefit": "Nearby allies with this feat grant a cumulative +1 bonus (max +4) on damage with certain fire attacks"
    },
    "But a Scratch": {
        "prerequisites": {
        "Stat": {
            "CHA": 13
        },
        "Skill": {
            "Bluff": 4
        }
        },
        "benefit": "Demoralize foes by playing down a mighty blow"
    },
    "Call Out": {
        "prerequisites": {},
        "benefit": "As a standard action, you can make an Intimidate check against a hostile target within 30 feet that can clearly see and hear you. The DC of this check is equal to 10 + your opponent’s Hit Dice + its Wisdom modifier. If the target is trained in Sense Motive, the DC is instead equal to 10 + your opponent’s Sense Motive bonus, if higher. If you succeed at this check, the target enters a duel with you. The target cannot withdraw from the duel for 1 round + 1 round for every 5 by which the check beat the DC."
    },
    "Canny Tumble": {
        "prerequisites": {
        "Feat": [
            "Dodge",
            "Mobility"
        ],
        "Skill": {
            "Acrobatics": 5
        }
        },
        "benefit": "Gain a bonus on melee attack rolls when you use Acrobatics to avoid attacks of opportunity"
    },
    "Caster’s Champion": {
        "prerequisites": {},
        "benefit": "Three times per day as a swift action, when you are within 30 feet of an ally who is an arcane spellcaster, you can channel a portion of her arcane power into your weapons."
    },
    "Cat and Mouse": {
        "prerequisites": {
        "Skill": {
            "Bluff": 5,
            "Sense Motive": 5
        },
        "Feat": "Opportune Parry and Riposte Deed"
        },
        "benefit": "Hold your riposte to gain an advantage"
    },
    "Catch Off-Guard": {
        "prerequisites": {},
        "benefit": "No penalties for improvised melee weapons"
    },
    "Cautious Fighter": {
        "prerequisites": {
        "Race": "Halfling"
        },
        "benefit": "When fighting defensively or using total defense, your dodge bonus to AC increases by 2."
    },
    "Chairbreaker": {
        "prerequisites": {
        "Feat": "Catch Off-Guard",
        "BAB": 1
        },
        "benefit": "You deal more damage by breaking nearby objects against your enemies."
    },
    "Channel Smite": {
        "prerequisites": {
        "Special": "Channel energy class feature"
        },
        "benefit": "Channel energy through your attack"
    },
    "Channeling Force": {
        "prerequisites": {
        "Special": [
            "Ability to cast one force spell",
            "channel energy class feature"
        ]
        },
        "benefit": "Spend channel energy to deal extra force damage with weapon attacks"
    },
    "Charge of the Righteous": {
        "prerequisites": {
        "BAB": 1
        },
        "benefit": "You do not suffer -2 AC penalty when you charge undead or evil outsiders."
    },
    "Charge Through": {
        "prerequisites": {
        "Feat": "Improved Overrun",
        "BAB": 1
        },
        "benefit": "Make overrun as free action while charging"
    },
    "Charging Hurler": {
        "prerequisites": {
        "Feat": "Point-Blank Shot"
        },
        "benefit": "May use charge rules to make thrown weapon attack"
    },
    "Improved Charging Hurler": {
        "prerequisites": {
        "Feat": "Charging Hurler"
        },
        "benefit": "Your target may be at any range"
    },
    "Choir of Blades": {
        "prerequisites": {},
        "benefit": "Gain an ally’s bonus on attack rolls against a creature or a subtype, as well as the ally’s racial weapon proficiencies"
    },
    "Chokehold": {
        "prerequisites": {
        "Feat": "Improved Grapple",
        "Alternative": [
            {
            "BAB": 6
            },
            {
            "Class": {
                "monk": 5
            }
            }
        ]
        },
        "benefit": "May pin grappled opponent one size category larger than you"
    },
    "Circling Mongoose": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": [
            "Dodge",
            "Mobility",
            "Spring Attack"
        ],
        "BAB": 6
        },
        "benefit": "When you are adjacent to a foe, as a full-round action, you can take a full-attack action to make melee attacks against the foe, moving 5 ft. before each attack. You must move 5 ft. before each melee attack you make, and can’t exceed your maximum speed, exceed your maximum number of attacks in a round, or attack any other target until the beginning of your next turn."
    },
    "Circuitous Shot": {
        "prerequisites": {
        "Stat": {
            "DEX": 19
        },
        "Feat": [
            "Blind-Fight",
            "Improved Precise Shot",
            "Precise Shot",
            "Point-Blank Shot"
        ],
        "BAB": 11
        },
        "benefit": "Bounce ranged attacks to avoid total cover"
    },
    "Clambering Escape": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": [
            "Combat Expertise",
            "Improved Reposition"
        ]
        },
        "benefit": "After evading, reposition a foe into a blast evasion class feature"
    },
    "Claw Pounce": {
        "prerequisites": {
        "Stat": {
            "STR": 13,
            "DEX": 15
        },
        "Feat": "Nimble Striker",
        "BAB": 10,
        "Race": "Catfolk",
        "Alternative": [
            {
            "Racial Trait": "Cat's Claws"
            },
            {
            "Special": "Aspect of the Beast (claws of the beast manifestation)"
            }
        ]
        },
        "benefit": "When you make a charge, you can make a full attack with your claws."
    },
    "Cleave": {
        "prerequisites": {
        "Feat": "Power Attack"
        },
        "benefit": "Make an additional attack if the first one hits"
    },
    "Cleave, Great": {
        "prerequisites": {
        "Feat": "Cleave",
        "BAB": 4
        },
        "benefit": "Make an additional attack after each attack hits"
    },
    "Cleaving Finish": {
        "prerequisites": {
        "Feat": "Cleave"
        },
        "benefit": "Make additional attack if opponent is knocked out."
    },
    "Improved Cleaving Finish": {
        "prerequisites": {
        "Feat": [
            "Cleaving Finish",
            "Great Cleave"
        ],
        "BAB": 6
        },
        "benefit": "May use Cleaving Finish any number of times/round"
    },
    "Cleave Through": {
        "prerequisites": {
        "Stat": {
            "STR": 13
        },
        "Feat": [
            "Cleave",
            "Power Attack"
        ],
        "BAB": 11,
        "Race": "Dwarf"
        },
        "benefit": "When using Cleave or Great Cleave, if your initial attack hits, you may take a single 5-foot step as a free action before making your additional attacks. If doing so places a creature within your threatened area, that creature becomes a legal target for your additional Cleave attack(s) as long as it meets all the other prerequisites."
    },
    "Clinging Climber": {
        "prerequisites": {
        "Stat": {
            "STR": 13
        },
        "Skill": {
            "Climb": 3
        }
        },
        "benefit": "Cling to a surface using your legs so you can use both hands to attack."
    },
    "Cloak and Dagger Style": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": [
            "Combat Expertise",
            "Improved Dirty Trick",
            "Vital Strike",
            "Weapon Focus (chosen weapon)"
        ],
        "BAB": 6
        },
        "benefit": "Choose one light melee weapon. While using this style, whenever you use the attack action to attack an opponent during a surprise round with your chosen weapon, you can attempt a dirty trick combat maneuver check against that opponent as a free action. Additionally, if an adjacent target attempts to remove a condition that you inflicted upon it with the dirty trick combat maneuver, it provokes an AOO from you."
    },
    "Cloak and Dagger Subterfuge": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": [
            "Cloak and Dagger Style",
            "Combat Expertise",
            "Improved Dirty Trick",
            "Weapon Focus (chosen weapon)"
        ],
        "BAB": 11
        },
        "benefit": "While you are using Cloak and Dagger Style and wielding your chosen weapon, whenever you make an AOO against a target, you can attempt a free dirty trick combat maneuver check against the target as a free action as well. Additionally, whenever you successfully perform a dirty trick maneuver against a target, you can immediately attempt a steal combat maneuver check against the target as a free action. If you succeed, the target is unaware you have stolen an item."
    },
    "Cloak and Dagger Tactics": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": [
            "Cloak and Dagger Style",
            "Cloak and Dagger Subterfuge",
            "Combat Expertise",
            "Improved Dirty Trick",
            "Vital Strike",
            "Weapon Focus (chosen weapon)"
        ],
        "BAB": 16
        },
        "benefit": "While you are using Cloak and Dagger Style and wielding your chosen weapon, whenever you hit an opponent that is denied its Dexterity bonus to AC or that you are flanking, or make an attack using Vital Strike (or its improved or greater versions), you can attempt a dirty trick combat maneuver check against that opponent as a free action. If you succeed, the target must succeed at a Fortitude save (DC = 10 + 1/2 your BAB + your Intelligence modifier) or take an additional penalty from the dirty trick selected from the following list: anchored in place and unable to move from that square, confused, exhausted, or staggered. This additional penalty lasts only 1 round, regardless of how long the dirty trick’s normal penalty lasts, and can be removed by the target with a standard action. You can only attempt one free dirty trick combat maneuver check per round using this feat."
    },
    "Close-Quarters Thrower": {
        "prerequisites": {
        "Feat": [
            "Dodge",
            "Weapon Focus (selected thrown weapon)"
        ]
        },
        "benefit": "Attacks with selected weapons do not provoke attacks of opportunity"
    },
    "Cloven Helm": {
        "prerequisites": {
        "Feat": [
            "Dented Helm",
            "Hard-Headed"
        ],
        "BAB": 11,
        "Race": "Dwarf"
        },
        "benefit": "When wearing a helmet, you add +1 to your AC against critical hit confirmation rolls; this benefit stacks with Dented Helm. When you use Dented Helm to deflect a critical hit, you may apply all damage from the critical hit to your helmet before applying any damage to yourself. If you take no damage, any additional effects, such as critical feats or poison, are negated."
    },
    "Clustered Shots": {
        "prerequisites": {
        "Feat": [
            "Point-Blank Shot",
            "Precise Shot"
        ],
        "BAB": 6
        },
        "benefit": "Total damage from full-round ranged attacks before applying DR"
    },
    "Cockatrice Strike": {
        "prerequisites": {
        "Feat": "Medusa’s Wrath",
        "BAB": 14
        },
        "benefit": "Turn a target to stone with a critical hit"
    },
    "Combat Expertise": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        }
        },
        "benefit": "Trade attack bonus for AC bonus"
    },
    "Combat Medic": {
        "prerequisites": {
        "Skill": {
            "Heal": 5
        }
        },
        "benefit": "May take 10 and not provoke attacks of opportunity when using Heal"
    },
    "Combat Patrol": {
        "prerequisites": {
        "Feat": [
            "Combat Reflexes",
            "Mobility"
        ],
        "BAB": 5
        },
        "benefit": "Increase threatened area for AOO"
    },
    "Combat Reflexes": {
        "prerequisites": {},
        "benefit": "Make additional attacks of opportunity"
    },
    "Combat Style Master": {
        "prerequisites": {
        "Feat": "Improved Unarmed Strike",
        "Special": "Two or more style feats",
        "Alternative": [
            {
            "BAB": 6
            },
            {
            "Class": {
                "monk": 5
            }
            }
        ]
        },
        "benefit": "May switch styles as a free action"
    },
    "Compounded Pain": {
        "prerequisites": {
        "Class": {
            "Mesmerist": 13
        },
        "Special": "painful stare class feature"
        },
        "benefit": "You can apply the effects of two stare feats to your painful stares."
    },
    "Concentrated Fire": {
        "prerequisites": {
        "Feat": "Point-Blank Shot",
        "Race": "Elf",
        "Special": "weapon familiarity racial trait"
        },
        "benefit": "When you and an ally with this feat both ready actions to make ranged attacks, use the highest attack roll for both attacks"
    },
    "Concentrated Splash": {
        "prerequisites": {
        "Alternative": [
            {
            "Feat": "Precise Shot"
            },
            {
            "Feat": "Throw Anything"
            }
        ]
        },
        "benefit": "Forgo dealing splash damage to increase damage done by direct hit with splash weapon"
    },
    "Consume Essence": {
        "prerequisites": {
        "BAB": 6,
        "Special": "swallow whole universal monster ability",
        "Alignment": "evil",
        "Creature Type": [
            "magical beast",
            "outsider",
            "undead"
        ]
        },
        "benefit": "Inflict negative levels on swallowed creatures"
    },
    "Coordinated Defense": {
        "prerequisites": {},
        "benefit": "+2 bonus to CMD"
    },
    "Coordinated Distraction": {
        "prerequisites": {},
        "benefit": "When you and at least one ally with this feat threaten the same enemy, the enemy treats the DC to cast spells defensively as 2 higher for each threatening character with this feat. If you or your allies are incapable of taking an AOO against the target for any reason, the effects of this feat do not apply."
    },
    "Coordinated Maneuvers": {
        "prerequisites": {},
        "benefit": "+2 bonus on combat maneuver checks"
    },
    "Coordinated Shot": {
        "prerequisites": {
        "Feat": "Point-Blank Shot"
        },
        "benefit": "When an ally with this feat threatens a foe, gain a +1 bonus on ranged attack rolls, or +2 if that ally is flanking the foe"
    },
    "Cornugon Shield": {
        "prerequisites": {},
        "benefit": "Shield bonus to AC when wielding a spiked chain"
    },
    "Cornugon Smash": {
        "prerequisites": {},
        "benefit": "Make free Intimidate checks when you Power Attack"
    },
    "Cornugon Stun": {
        "prerequisites": {},
        "benefit": "Use Stunning Fist with special monk weapons as well as unarmed attacks"
    },
    "Cornugon Trip": {
        "prerequisites": {},
        "benefit": "May throw spiked chain to make trip attacks"
    },
    "Counterpunch": {
        "prerequisites": {
        "Stat": {
            "DEX": 18
        },
        "Feat": [
            "Combat Reflexes",
            "Improved Unarmed Strike",
            "Weapon Focus (unarmed strike)"
        ],
        "Alternative": [
            {
            "BAB": 16
            },
            {
            "Class": {
                "Brawler": 12
            }
            }
        ]
        },
        "benefit": "When you fight unarmed and a foe misses with all melee attacks, it provokes attacks of opportunity from you"
    },
    "Counter Reflexes": {
        "prerequisites": {
        "Feat": "Anticipate Dodge"
        },
        "benefit": "Opponents with Mobility do not gain a bonus when they provoke attacks of opportunity from you"
    },
    "Covering Defense": {
        "prerequisites": {
        "Feat": "Shield Focus",
        "BAB": 6
        },
        "benefit": "Provide cover to an ally with total defense"
    },
    "Covering Fire": {
        "prerequisites": {
        "Feat": "Point-Blank Shot"
        },
        "benefit": "You can use the aid another action with a ranged attack against an opponent, regardless of whether the opponent threatens an ally."
    },
    "Crane Style": {
        "prerequisites": {
        "Feat": [
            "Dodge",
            "Improved Unarmed Strike"
        ],
        "Alternative": [
            {
            "BAB": 2
            },
            {
            "Class": {
                "monk": 1
            }
            }
        ]
        },
        "benefit": "Take –2 penalty when fighting defensively"
    },
    "Crane Wing": {
        "prerequisites": {
        "Feat": [
            "Crane Style",
            "Dodge",
            "Improved Unarmed Strike"
        ],
        "Alternative": [
            {
            "BAB": 5
            },
            {
            "Class": {
                "monk": 5
            }
            }
        ]
        },
        "benefit": "May deflect one attack per round while fighting defensively or using total defense"
    },
    "Crane Riposte": {
        "prerequisites": {
        "Feat": "Crane Wing",
        "Alternative": [
            {
            "BAB": 8
            },
            {
            "Class": {
                "monk": 7
            }
            }
        ]
        },
        "benefit": "When you deflect an attack, you may make an AOO"
    },
    "Critical Focus": {
        "prerequisites": {
        "BAB": 9
        },
        "benefit": "+4 bonus on attack rolls made to confirm critical hits"
    },
    "Critical, Banishing": [
        {
        "prerequisites": {
            "Feat": "Critical Focus",
            "Special": "ability to cast dismissal or banishment",
            "CL": 9
        },
        "benefit": "When you confirm a critical hit with a slashing or bludgeoning weapon, you may cast dismissal or banishment on that target as an immediate action, and the target takes a –4 penalty on its Will save to resist the spell’s effect. You must have dismissal or banishment prepared or otherwise available to cast, and using this ability casts the corresponding spell."
        },
        {
        "prerequisites": {
            "Alternative": [
            {
                "Feat": "Arcane Strike"
            },
            {
                "Feat": "Disruptive"
            }
            ],
            "Skill": {
            "Spellcraft": 8
            },
            "Special": "arcane pool class feature"
        },
        "benefit": "When you confirm a critical hit against a target while using Arcane Strike or with a weapon enhanced by your arcane pool, if the target was summoned by a spell you identified using a Spellcraft check, it must succeed at a Will save (DC = 10 + 1/2 your character level + your Intelligence modifier) or be sent back to its home plane as per the dismissal spell."
        }
    ],
    "Critical, Bleeding": {
        "prerequisites": {
        "Feat": "Critical Focus",
        "BAB": 11
        },
        "benefit": "Whenever you score a critical hit, the target takes 2d6 bleed"
    },
    "Critical, Blinding": {
        "prerequisites": {
        "Feat": "Critical Focus",
        "BAB": 15
        },
        "benefit": "Whenever you score a critical hit, the target is blinded"
    },
    "Critical, Censoring": {
        "prerequisites": {
        "Feat": "Critical Focus",
        "BAB": 15
        },
        "benefit": "Whenever you score a critical hit against an opponent, the victim is unable to speak for 1d4+1 rounds."
    },
    "Critical, Crippling": {
        "prerequisites": {
        "Feat": "Critical Focus",
        "BAB": 13
        },
        "benefit": "Whenever you score a critical hit, the target’s speed is halved"
    },
    "Critical, Deafening": {
        "prerequisites": {
        "Feat": "Critical Focus",
        "BAB": 13
        },
        "benefit": "Whenever you score a critical hit, the target is deafened"
    },
    "Critical, Exhausting": {
        "prerequisites": {
        "Feat": "Tiring Critical",
        "BAB": 15
        },
        "benefit": "Whenever you score a critical hit, the target is exhausted"
    },
    "Critical, Sickening": {
        "prerequisites": {
        "Feat": "Critical Focus",
        "BAB": 11
        },
        "benefit": "Whenever you score a critical hit, the target is sickened"
    },
    "Critical, Staggering": {
        "prerequisites": {
        "Feat": "Critical Focus",
        "BAB": 13
        },
        "benefit": "Whenever you score a critical hit, the target is staggered"
    },
    "Critical, Stunning": {
        "prerequisites": {
        "Feat": "Staggering Critical",
        "BAB": 17
        },
        "benefit": "Whenever you score a critical hit, the target is stunned"
    },
    "Critical, Tiring": {
        "prerequisites": {
        "Feat": "Critical Focus",
        "BAB": 13
        },
        "benefit": "Whenever you score a critical hit, the target is fatigued"
    },
    "Critical, Improved": {
        "prerequisites": {
        "Special": "Proficiency with weapon",
        "BAB": 8
        },
        "benefit": "Double the threat range of one weapon"
    },
    "Critical Mastery": {
        "prerequisites": {
        "Special": "Any two critical feats",
        "Class": {
            "Fighter": 14
        }
        },
        "benefit": "Apply two effects to your critical hits"
    },
    "Critical Versatility": {
        "prerequisites": {
        "Class": {
            "Fighter": 11
        },
        "Race": "Human"
        },
        "benefit": "Once per day, you can spend 1 hour practicing maneuvers to gain one single critical feat that you meet the prerequisites for. You gain the benefits of the chosen critical feat until you choose to practice a different critical feat."
    },
    "Crossbow Mastery": {
        "prerequisites": {
        "Stat": {
            "DEX": 15
        },
        "Feat": [
            "Rapid Reload",
            "Rapid Shot"
        ]
        },
        "benefit": "Reload crossbow as free action and make full attacks"
    },
    "Crowd of Bullies": {
        "prerequisites": {
        "Race": "Half-orc"
        },
        "benefit": "Allies with this feat gain a +2 bonus on combat maneuver checks after you fail a combat maneuver check"
    },
    "Crowd Control": {
        "prerequisites": {
        "BAB": 3
        },
        "benefit": "You gain a +2 competence bonus to your CMD when an enemy uses Acrobatics to move through a square you threaten. For each ally within your reach that also has this feat, the bonus increases by an additional 2."
    },
    "Crusader’s Fist": {
        "prerequisites": {
        "Special": "Lay on hands or touch of corruption class feature",
        "Feat": "Improved Unarmed Strike",
        "BAB": 6
        },
        "benefit": "May use lay on hands or touch of corruption upon successful unarmed strike"
    },
    "Crushing Blow": {
        "prerequisites": {
        "Feat": "Stunning Fist"
        },
        "benefit": "Stunning Fist reduces target’s AC"
    },
    "Cudgeler Style": {
        "prerequisites": {
        "Feat": "Bludgeoner"
        },
        "benefit": "When you hit with a charge attack to deal nonlethal damage while using this style, your weapon deals damage as if it were one size category larger than it actually is. If you have the ability to make more than one attack on a charge, this increase applies only to your first attack."
    },
    "Cudgeler Sweep": {
        "prerequisites": {
        "Feat": [
            "Bludgeoner",
            "Cudgeler Style"
        ],
        "Alternative": [
            {
            "BAB": 5
            },
            {
            "Class": {
                "monk": 5
            }
            }
        ]
        },
        "benefit": "When you hit with a charge attack using the Cudgeler Style feat, you can immediately attempt a single trip combat maneuver check against the target with a +2 competence bonus as a free action. This provokes an AOO as normal for a trip combat maneuver."
    },
    "Cudgeler Takedown": {
        "prerequisites": {
        "Feat": [
            "Bludgeoner",
            "Cudgeler Style",
            "Cudgeler Sweep"
        ],
        "Alternative": [
            {
            "BAB": 9
            },
            {
            "Class": {
                "monk": 9
            }
            }
        ]
        },
        "benefit": "When you hit with a charge attack using the Cudgeler Style feat, your weapon deals damage as though it were one size category larger for 1 round or until it leaves your hand. When you successfully trip an opponent with the Cudgeler Sweep feat, your opponent must succeed at a Fortitude save (DC = 10 + your character level + your Strength modifier) or be stunned for 1 round."
    },
    "Cunning Intuition": {
        "prerequisites": {
        "Feat": "Ready for Anything",
        "Alternative": [
            {
            "BAB": 13
            },
            {
            "Class": {
                "Rogue": 13
            }
            }
        ],
        "Skill": {
            "Sense Motive": 13
        }
        },
        "benefit": "Choose your readied action when it triggers"
    },
    "Dance of Chains": {
        "prerequisites": {
        "Stat": {
            "DEX": 15
        },
        "Feat": [
            "Chain Mastery",
            "Exotic Weapon Proficiency (spiked chain)",
            "Weapon Finesse"
        ],
        "Skill": {
            "Perform (dance)": 1
        }
        },
        "benefit": "When wielding a spiked chain one-handed, you can add your Dexterity modifier instead of your Strength modifier to that weapon’s damage. The spiked chain must be one appropriate for your size. During your turn, you treat your reach with the spiked chain as 5 feet greater. You lose these benefits while fighting with multiple weapons or when using a shield (but not when using a buckler)."
    },
    "Darting Viper": {
        "prerequisites": {
        "Other": {
            "BAB": 4
        },
        "Proficiency": "dwarven dorn-dergar"
        },
        "benefit": "Become more efficient at switching combat styles with the dorn-dergar"
    },
    "Dastardly Finish": {
        "prerequisites": {
        "Class Feature": {
            "Sneak Attack": "5d6"
        }
        },
        "benefit": "Deliver coup de grace to cowering or stunned target"
    },
    "Dazing Assault": {
        "prerequisites": {
        "Other": {
            "BAB": 11
        },
        "Feat": [
            "Power Attack"
        ]
        },
        "benefit": "Trade melee attack bonus to daze opponents"
    },
    "Dazing Fist": {
        "prerequisites": {
        "Stat": {
            "DEX": 13,
            "WIS": 13
        },
        "Other": {
            "BAB": 4
        },
        "Feat": "Improved Unarmed Strike"
        },
        "benefit": "Daze foes with your unarmed strikes"
    },
    "Dazzling Display": {
        "prerequisites": {
        "Feat": "Weapon Focus"
        },
        "benefit": "Intimidate all foes within 30 feet"
    },
    "Deadly Aim": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Other": {
            "BAB": 1
        }
        },
        "benefit": "Trade ranged attack bonus for damage"
    },
    "Deadhand Style": {
        "prerequisites": {
        "Stat": {
            "WIS": 15
        },
        "Feat": "Improved Unarmed Strike",
        "Skill": "Knowledge (religion)"
        },
        "benefit": "You are hard to scare and your unarmed strikes 4 ranks, ki pool class feature, nongood alignment can make foes shaken"
    },
    "Deadhand Initiate": {
        "prerequisites": {
        "Stat": {
            "WIS": 19
        },
        "Feat": "Deadhand Style",
        "Skill": {
            "Knowledge (religion)": 6
        }
        },
        "benefit": "You feast upon your own fears"
    },
    "Deadhand Master": {
        "prerequisites": {
        "Stat": {
            "WIS": 23
        },
        "Feat": [
            "Deadhand Initiate",
            "Deadhand Style"
        ],
        "Skill": "Knowledge"
        },
        "benefit": "Your unarmed strikes inflict negative levels (religion) 14 ranks"
    },
    "Deadly Finish": {
        "prerequisites": {
        "Other": {
            "BAB": 11
        }
        },
        "benefit": "Foes you knock out must make a Fort save or die"
    },
    "Deadly Grappler": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": [
            "Improved Grapple",
            "Improved Unarmed Strike"
        ]
        },
        "benefit": "You have learned to leverage a grappling creature’s weight against it. While you’re grappled, attacks you make against the grappler using armor spikes, a light or one-handed weapon, a natural weapon, or an unarmed strike deal damage as if the strike or weapon were one size category larger than it actually is."
    },
    "Deadly Stroke": {
        "prerequisites": {
        "Feat": [
            "Greater Weapon Focus",
            "Shatter Defenses"
        ],
        "Other": {
            "BAB": 11
        }
        },
        "benefit": "Deal double damage plus 1 Con bleed"
    },
    "Death from Above": {
        "prerequisites": {},
        "benefit": "Gain +5 bonus on attack rolls when charging from higher ground or flying"
    },
    "Death or Glory": {
        "prerequisites": {
        "Feat": "Power Attack",
        "Other": {
            "BAB": 6
        }
        },
        "benefit": "Gain +4 on attack, damage, and critical rolls vs. Large or larger opponents"
    },
    "Death Roll": {
        "prerequisites": {
        "Special": "Bite attack, reptilian subtype"
        },
        "benefit": "Perform a death roll when grappling a foe of your size or smaller to knock that foe prone"
    },
    "Deathless Initiate": {
        "prerequisites": {
        "Stat": {
            "STR": 13,
            "CON": 13
        },
        "Race": "orc or half-orc",
        "Feat": "Diehard",
        "Other": {
            "BAB": 6
        }
        },
        "benefit": "Not staggered while using Diehard; gain +2 on melee damage rolls"
    },
    "Deathless Master": {
        "prerequisites": {
        "Stat": {
            "CON": 15
        },
        "Feat": [
            "Deathless Initiate",
            "Ironhide"
        ],
        "Other": {
            "BAB": 9
        }
        },
        "benefit": "Do not lose hit points while using Diehard"
    },
    "Deathless Zealot": {
        "prerequisites": {
        "Stat": {
            "CON": 17
        },
        "Feat": "Deathless Master",
        "Other": {
            "BAB": 12
        }
        },
        "benefit": "Foes must reroll critical confirmation attacks"
    },
    "Defensive Combat Training": {
        "prerequisites": {},
        "benefit": "Use your total Hit Dice as your BAB for CMD"
    },
    "Defensive Weapon Training": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Other": {
            "BAB": 5
        }
        },
        "benefit": "Gain +2 dodge bonus against a single fighter weapon group"
    },
    "Deflect Arrows": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": "Improved Unarmed Strike"
        },
        "benefit": "Avoid one ranged attack per round"
    },
    "Demon Hunter": {
        "prerequisites": {
        "Skill": {
            "Knowledge (planes)": 6
        }
        },
        "benefit": "Gain Knowledge and combat bonuses vs. demons"
    },
    "Demonic Nemesis": {
        "prerequisites": {
        "Feat": "Demon Hunter",
        "Skill": {
            "Knowledge (planes)": 6
        }
        },
        "benefit": "Gain a +2 bonus on damage rolls and rolls to confirm critical hits against followers of a chosen demon lord."
    },
    "Demoralizing Lash": {
        "prerequisites": {
        "Other": {
            "BAB": 1
        },
        "Skill": {
            "Intimidate": 1
        },
        "Race": "Hobgoblin"
        },
        "benefit": "To use this feat, you must use a whip (or another weapon in the flails fighter weapon group) to attack a foe demoralized by an Intimidate check. If the attack hits, you extend the duration the creature is shaken by 1 round. This feat has no effect on creatures whose shaken conditions are from sources other than Intimidate checks."
    },
    "Dented Helm": {
        "prerequisites": {
        "Feat": "Hard-Headed",
        "Other": {
            "BAB": 6
        },
        "Race": "dwarf"
        },
        "benefit": "When wearing a helmet, you add +1 to your AC against critical hit confirmation rolls. When a critical hit is confirmed against you, as an immediate action, you can apply half of the damage from the attack to your helmet rather than yourself, applying hardness as normal. If the damage destroys your helmet, any leftover damage is applied to you. After using this feat, you are staggered until the end of your next turn. You may not use this feat if your helmet has the broken condition or the attack ignores armor bonuses to AC."
    },
    "Dervish Dance": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": "Weapon Finesse",
        "Skill": {
            "Perform (dance)": 2
        },
        "Proficiency": "scimitar"
        },
        "benefit": "Use Dex modifier instead of Str modifier with scimitar."
    },
    "Desperate Swing": {
        "prerequisites": {
        "Feat": "Cautious Fighter",
        "Other": {
            "BAB": 1
        },
        "Race": "halfling"
        },
        "benefit": "Once per day, you can make a single melee attack while taking the total defense action. You take a –4 penalty on attack rolls when making this attack. You also gain a +4 bonus on critical confirmation rolls made while fighting defensively or making an AOO using this feat."
    },
    "Desperate Battler": {
        "prerequisites": {},
        "benefit": "Gain +1 morale bonus on melee attack and damage when alone"
    },
    "Destroyer’s Blessing": {
        "prerequisites": {
        "Race": "half-orc or orc",
        "Special": [
            "rage class feature",
            "worshiper of a god of destruction"
        ]
        },
        "benefit": "Regain rage by sundering."
    },
    "Destructive Persuasion": {
        "prerequisites": {
        "Stat": {
            "STR": 13
        },
        "Feat": "Power Attack",
        "Skill": {
            "Intimidate": 1
        }
        },
        "benefit": "Sometimes, you have to break things if you want people to get your point."
    },
    "Devastating Strike": {
        "prerequisites": {
        "Feat": "Vital Strike",
        "Other": {
            "BAB": 9
        }
        },
        "benefit": "Deal extra damage when using Vital Strike bonus"
    },
    "Improved Devastating Strike": {
        "prerequisites": {
        "Feat": "Devastating Strike",
        "Other": {
            "BAB": 13
        }
        },
        "benefit": "Gain bonus on rolls to confirm critical hits"
    },
    "Disconcerting Stare": {
        "prerequisites": {
        "Special": "Mesmerist level 5th, painful stare class feature"
        },
        "benefit": "Target must succeed at a Will save or take penalties on Disable Device and Perception checks"
    },
    "Dimensional Awareness": {
        "prerequisites": {
        "Feat (or)": [
            "Arcane Strike",
            "Disruptive"
        ],
        "Feat": [
            "Banishing Critical",
            "Combat Reflexes"
        ],
        "Skill": {
            "Spellcraft": 8
        },
        "Class Feature": "arcane pool"
        },
        "benefit": "If a summoned or called creature materializes in a space you threaten, you can make an AOO against that creature before it acts, gaining a +2 circumstance bonus on the attack roll if you successfully identified the spell used to summon or call that creature."
    },
    "Dimensional Disruption": {
        "prerequisites": {
        "Feat (or)": [
            "Arcane Strike",
            "Disruptive"
        ],
        "Feat": [
            "Banishing Critical",
            "Combat Reflexes",
            "Dimensional Awareness"
        ],
        "Skill": {
            "Spellcraft": 8
        },
        "Class Feature": "arcane pool"
        },
        "benefit": "When you use Dimensional Awareness to make an AOO against a creature being summoned or called into a square you threaten, you can additionally use an immediate action to attempt to send the creature back to its home plane. Attempt a Spellcraft check (DC = 15 + the creature’s CR [minimum 1] + the spell level of the spell that summoned the creature). If you succeed, the creature does not get to act and is immediately sent back to its home plane."
    },
    "Dirty Trick, Improved": {
        "prerequisites": {
        "Feat": "Combat Expertise"
        },
        "benefit": "+2 bonus on dirty trick attempts, no AOO"
    },
    "Dirty Trick, Greater": {
        "prerequisites": {
        "Feat": "Improved Dirty Trick",
        "Other": {
            "BAB": 6
        }
        },
        "benefit": "Dirty trick penalty lasts 1d4 rounds."
    },
    "Dirty Trick Master": {
        "prerequisites": {
        "Feat": [
            "Greater Dirty Trick",
            "Improved Dirty Trick"
        ],
        "Other": {
            "BAB": 11
        }
        },
        "benefit": "Whenever you successfully perform a dirty trick against an opponent still affected by a previous dirty trick you can cause the condition to worsen."
    },
    "Disarm, Improved": {
        "prerequisites": {
        "Feat": "Combat Expertise"
        },
        "benefit": "+2 bonus on disarm attempts, no AOO"
    },
    "Disarm, Greater": {
        "prerequisites": {
        "Feat": "Improved Disarm",
        "Other": {
            "BAB": 6
        }
        },
        "benefit": "Disarmed weapons are knocked away from your enemy"
    },
    "Disarm, Directed": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": [
            "Combat Expertise",
            "Greater Disarm",
            "Improved Disarm"
        ],
        "Other": {
            "BAB": 11
        }
        },
        "benefit": "You can choose the direction a disarmed weapon is thrown, or alternatively, make a ranged attack with the disarmed weapon"
    },
    "Disarming Strike": {
        "prerequisites": {
        "Feat": "Improved Disarm",
        "Other": {
            "BAB": 9
        }
        },
        "benefit": "Attempt a disarm on a successful critical hit"
    },
    "Disengaging Feint": {
        "prerequisites": {
        "Feat": "Improved Feint"
        },
        "benefit": "Feint lets you move your speed without provoking attacks of opportunity"
    },
    "Disengaging Flourish": {
        "prerequisites": {
        "Feat": "Disengaging Feint"
        },
        "benefit": "Successful feint causes your starting square to not count as threatened"
    },
    "Disengaging Shot": {
        "prerequisites": {
        "Feat": [
            "Disengaging Feint",
            "Dodge",
            "Mobility"
        ]
        },
        "benefit": "When using Disengaging Flourish, you may make a single attack"
    },
    "Disheartening Display": {
        "prerequisites": {
        "Feat": [
            "Dazzling Display",
            "Weapon Focus"
        ],
        "Other": {
            "BAB": 6
        },
        "Proficiency": "selected weapon"
        },
        "benefit": "Use Dazzling Display to increase a fear effect"
    },
    "Disorienting Blow": {
        "prerequisites": {
        "Feat": "Stunning Fist",
        "Other": {
            "BAB": 11
        }
        },
        "benefit": "Replace effects or conditions on a struck foe that would be caused by your Stunning Fist with the confused condition for 1 round instead."
    },
    "Dispelling Critical": {
        "prerequisites": {
        "Feat": "Arcane Strike",
        "Other": {
            "BAB": 11
        },
        "Special": "ability to cast dispel magic"
        },
        "benefit": "After critical hit, you may cast dispel magic"
    },
    "Disrupting Shot": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": "Point-Blank Shot",
        "Other": {
            "Fighter Level": 6
        }
        },
        "benefit": "Ranged attacks increase enemy’s DC to cast spells"
    },
    "Disruptive": {
        "prerequisites": {
        "Other": {
            "Fighter Level": 6
        }
        },
        "benefit": "Increases the DC to cast spells adjacent to you"
    },
    "Disrupting Fist": {
        "prerequisites": {
        "Feat": [
            "Channel Smite",
            "Improved Unarmed Strike"
        ],
        "Other": {
            "BAB": 9
        },
        "Special": "channel positive energy 4d6"
        },
        "benefit": "Destroy an undead on a critical unarmed strike"
    },
    "Distance Thrower": {
        "prerequisites": {
        "Stat": {
            "STR": 13
        }
        },
        "benefit": "Reduce ranged penalties for thrown weapons by 2"
    },
    "Distracting Charge": {
        "prerequisites": {},
        "benefit": "When an ally with this feat charges, you gain a +2 bonus on attack rolls against the creature charged"
    },
    "Diva Style": {
        "prerequisites": {
        "Stat": {
            "CHA": 13
        },
        "Other": "BAB +1 or bard 1"
        },
        "benefit": "While using this style, you can use any Perform skill in place of Bluff to feint in combat. You can attempt a Perform check to feint as a move action when you begin a bardic performance."
    },
    "Diva Strike": {
        "prerequisites": {
        "Stat": {
            "CHA": 15
        },
        "Feat": [
            "Combat Expertise",
            "Diva Style",
            "Improved Feint"
        ],
        "Other": "BAB +7 or bard 7"
        },
        "benefit": "While using Diva Style, the first time you hit with a melee weapon in a round, you deal an additional amount of damage equal to your Cha modifier to a target that is denied its Dex bonus to AC. This damage is precision-based, and is not multiplied on a critical hit."
    },
    "Diva Advance": {
        "prerequisites": {
        "Stat": {
            "CHA": 17
        },
        "Feat": [
            "Combat Expertise",
            "Diva Strike",
            "Diva Style",
            "Improved Feint"
        ],
        "Other": "BAB +11 or bard 11"
        },
        "benefit": "While using Diva Style, you do not provoke attacks of opportunity from creatures you have successfully feinted against. Additionally, you can feint against a creature using Diva Style from up to 30 feet away."
    },
    "Divert Harm": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": "Combat Expertise",
        "Other": {
            "BAB": 6
        },
        "Special": "evasion"
        },
        "benefit": "When you are targeted by an area-of-effect that deals 1/2 dmg on a successful Ref save, you may, as an immediate action, attempt to move an adjacent foe into harm’s way as well."
    },
    "Divine Fighting Technique": {
        "prerequisites": {
        "Special": "Worship a single patron deity that has an established divine fighting technique plus special"
        },
        "benefit": "You can use your patron deity’s fighting technique and receive any benefit associated with that technique for which you qualify."
    },
    "Divine Assault": {
        "prerequisites": {
        "Skill": {
            "Bluff": 1,
            "Knowledge (religion)": 1
        },
        "Special": "Pure Legion Recruit trait"
        },
        "benefit": "You gain a +2 bonus on saving throws against divine spells and effects and abilities from outsiders. If you must attempt a saving throw against a divine spell, you gain a +1 bonus on attack rolls against the creature that cast the spell."
    },
    "Dodge": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        }
        },
        "benefit": "+1 dodge bonus to AC"
    },
    "Domain Strike": {
        "prerequisites": {
        "Class Feature": "Domain",
        "Feat": "Improved Unarmed Strike"
        },
        "benefit": "Use a domain power through unarmed strike"
    },
    "Dorn-Dergar Master": {
        "prerequisites": {
        "Feat": "Two-Weapon Fighting",
        "Other": {
            "BAB": 4
        },
        "Proficiency": "dwarven dorn-dergar"
        },
        "benefit": "Learn to use the dwarven dorn-dergar with one hand."
    },
    "Double Slice": {
        "prerequisites": {
        "Feat": "Two-Weapon Fighting"
        },
        "benefit": "Add your Str bonus to off-hand damage rolls"
    },
    "Drag Down": {
        "prerequisites": {
        "Feat": "Improved Trip"
        },
        "benefit": "If tripped, you can attempt a trip against that foe"
    },
    "Drag, Improved": {
        "prerequisites": {
        "Feat": "Power Attack"
        },
        "benefit": "+2 bonus on drag attempts, no AOO"
    },
    "Drag, Greater": {
        "prerequisites": {
        "Feat": "Improved Drag",
        "Other": {
            "BAB": 6
        }
        },
        "benefit": "Enemies you drag provoke attacks of opportunity"
    },
    "Dragon Style": {
        "prerequisites": {
        "Stat": {
            "STR": 15
        },
        "Feat": "Improved Unarmed Strike",
        "Skill": {
            "Acrobatics": 3
        }
        },
        "benefit": "+2 bonus vs sleep effects, paralysis effects, and stunning effects. Ignore difficult terrain when you charge, run, or withdraw. Can charge through squares that contain allies. Add 1-1/2 times your Strength bonus on the damage roll for first unarmed strike per round."
    },
    "Draining Strike": {
        "prerequisites": {
        "Stat": {
            "DEX": 13,
            "WIS": 13
        },
        "Feat": "Improved Unarmed Strike",
        "Other": {
            "BAB": 8
        }
        },
        "benefit": "Cause fatigue with unarmed strikes"
    },
    "Dreadful Carnage": {
        "prerequisites": {
        "Stat": {
            "STR": 15
        },
        "Feat": "Furious Focus",
        "Other": {
            "BAB": 11
        }
        },
        "benefit": "Make a free Intimidate check when you knock down a foe"
    },
    "Drunken Brawler": {
        "prerequisites": {
        "Feat": "Endurance"
        },
        "benefit": "Take -2 penalty to Reflex saving throws but gain temporary hit points and bonuses to Fort and Will saves for 1 hr. or until temporary hit points are gone."
    },
    "Dueling Cape Deed": {
        "prerequisites": {
        "Class Feature": "Amateur Swashbuckler or panache",
        "Feat": "Dodge",
        "Skill": {
            "Sleight Of Hand": 1
        }
        },
        "benefit": "Use your cape as a snaring buckler"
    },
    "Dueling Mastery": {
        "prerequisites": {
        "Proficiency": "dueling sword",
        "Feat": [
            "Quick Draw",
            "Weapon Finesse",
            "Weapon Focus (dueling sword)"
        ]
        },
        "benefit": "Gain combat benefits when using dueling swords"
    },
    "Efreeti Style": {
        "prerequisites": {
        "Stat": {
            "CON": 13,
            "WIS": 15
        },
        "Feat": [
            "Elemental Fist",
            "Improved Unarmed Strike"
        ],
        "Prerequisite Options": {
            "or": [
            {
                "BAB": 9
            },
            {
                "Class": {
                "monk": 5
                }
            }
            ]
        }
        },
        "benefit": "Gain +1 use of Elemental Fist per day and a bonus on fire damage"
    },
    "Efreeti Stance": {
        "prerequisites": {
        "Stat": {
            "CON": 15,
            "WIS": 15
        },
        "Feat": [
            "Efreeti Style",
            "Elemental Fist",
            "Improved Unarmed Strike"
        ],
        "Prerequisite Options": {
            "or": [
            {
                "BAB": 11
            },
            {
                "Class": {
                "monk": 9
                }
            }
            ]
        }
        },
        "benefit": "Gain +1 use of Elemental Fist per day and fire resistance"
    },
    "Efreeti Touch": {
        "prerequisites": {
        "Stat": {
            "CON": 15,
            "WIS": 17
        },
        "Feat": [
            "Efreeti Style",
            "Efreeti Stance",
            "Elemental Fist",
            "Improved Unarmed Strike"
        ],
        "Prerequisite Options": {
            "or": [
            {
                "BAB": 13
            },
            {
                "Class": {
                "monk": 11
                }
            }
            ]
        }
        },
        "benefit": "Can emit a cone of fire that may light opponents on fire"
    },
    "Eldritch Claws": {
        "prerequisites": {
        "Stat": {
            "STR": 15
        },
        "Special": "natural weapons",
        "BAB": 6
        },
        "benefit": "Natural weapons treated as magic and silver"
    },
    "Elemental Fist": {
        "prerequisites": {
        "Stat": {
            "CON": 13,
            "WIS": 13
        },
        "Feat": "Improved Unarmed Strike",
        "BAB": 8
        },
        "benefit": "Deal 1d6 energy damage with an unarmed strike"
    },
    "Elemental Strike": {
        "prerequisites": {
        "Race": [
            "Ifrit",
            "Oread",
            "Sylph",
            "Undine"
        ]
        },
        "benefit": "Deal +1 damage of an energy type linked to your race"
    },
    "Elephant Stomp": {
        "prerequisites": {
        "Stat": {
            "STR": 13
        },
        "Feat": [
            "Power Attack",
            "Improved Overrun"
        ],
        "BAB": 1
        },
        "benefit": "Combine an attack with a successful overrun."
    },
    "Elven Accuracy": {
        "prerequisites": {
        "Race": "Elf"
        },
        "benefit": "Reroll miss chance due to concealment when using a bow"
    },
    "Elusive Redirection": {
        "prerequisites": {
        "Special": "Elusive target class feature",
        "Feat": [
            "Combat Expertise",
            "Improved Unarmed Strike"
        ],
        "Class": {
            "monk (flowing)": 12
        }
        },
        "benefit": "When you successfully avoid damage, spend 1 ki point to redirect attack back at opponent"
    },
    "Elven Battle Training": {
        "prerequisites": {
        "BAB": 1,
        "Race": "Elf"
        },
        "benefit": "You have received special training with traditional elven weapons (longbows, composite longbows, longswords, rapiers, shortbows, composite shortbows, and any weapon with the word “elven” in its name). You receive a +2 bonus to your CMD against disarm and sunder maneuvers directed at one of these weapons you are wielding. In addition, if you are wielding one of these melee weapons, you may make an additional AOO each round (this bonus stacks with Combat Reflexes)."
    },
    "Empty Quiver Style": {
        "prerequisites": {
        "Feat": "Weapon Focus (with the chosen weapon)"
        },
        "benefit": "Attack enemies with your bow, crossbow, or firearm as if it were a mace."
    },
    "Empty Quiver Flexibility": {
        "prerequisites": {
        "Feat": [
            "Empty Quiver Style",
            "Rapid Shot",
            "Stabbing Shot",
            "Weapon Focus (with the chosen weapon)"
        ]
        },
        "benefit": "Threaten adjacent squares with your bow, crossbow, or firearm and apply feats and class abilities that modify your ranged attack and damage rolls with it to your melee attacks."
    },
    "Empty Quiver Flurry": {
        "prerequisites": {
        "Feat": [
            "Empty Quiver Flexibility",
            "Empty Quiver Style",
            "Rapid Shot",
            "Stabbing Shot",
            "Weapon Focus (with the chosen weapon)"
        ]
        },
        "benefit": "When you hit an enemy in melee with your ranged weapon, do not provoke attacks of opportunity from that enemy when making ranged attacks with it."
    },
    "Enforcer": {
        "prerequisites": {
        "Skill": {
            "Intimidate": 1
        }
        },
        "benefit": "Demoralize opponent as free action when you inflict nonlethal damage"
    },
    "Engulf Revulsion": {
        "prerequisites": {
        "Special": "Engulf or smother universal monster ability"
        },
        "benefit": "Engulfed or smothered foes are shaken"
    },
    "Engulf Horror": {
        "prerequisites": {
        "Feat": "Engulf Revulsion"
        },
        "benefit": "Engulfed or smothered foes are staggered"
    },
    "Enrage Opponent": {
        "prerequisites": {
        "Stat": {
            "CHA": 13
        },
        "Feat": "Persuasive",
        "Prerequisite Options": {
            "or": [
            {
                "Feat": "Amateur Swashbuckler"
            },
            {
                "Special": "panache class feature"
            }
            ]
        }
        },
        "benefit": "Lower angered opponent’s defenses until she attacks you"
    },
    "Entreating Critical": {
        "prerequisites": {
        "Feat": [
            "Call Truce",
            "Critical Focus"
        ],
        "BAB": 11
        },
        "benefit": "Use a critical hit to convince foes to agree to a truce"
    },
    "Equipment Trick": {
        "prerequisites": {
        "BAB": 1
        },
        "benefit": "Use a variety of tricks related to a piece of equipment."
    },
    "Exceptional Pull": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": "Deadly Aim",
        "BAB": 3
        },
        "benefit": "When you wield a ranged weapon that you are proficient with and that has a strength rating, add 2 to the weapon’s strength rating. You don’t take a penalty on attack rolls for having a Strength modifier lower than the strength rating of a weapon, provided you’re proficient with that weapon."
    },
    "Exotic Weapon Proficiency": {
        "prerequisites": {
        "BAB": 1
        },
        "benefit": "No penalty on attacks made with one exotic weapon"
    },
    "Explosive Weapon": {
        "prerequisites": {
        "Feat": "Arcing Weapon",
        "Special": "diverse training class feature"
        },
        "benefit": "As a standard action, you can cast a spell with an area of effect and a duration of instantaneous, such as fireball, and release it through your melee weapon as part of a melee attack. This functions as the magus spellstrike ability, except the spell damage does not multiply on a critical hit, the spell effect is centered on you, and you are excluded from its effects."
    },
    "Exsanguinate": {
        "prerequisites": {
        "Special": [
            "Blood drain universal monster ability",
            "grab universal monster ability"
        ]
        },
        "benefit": "Double blood drain damage once per round"
    },
    "Extreme Prejudice": {
        "prerequisites": {
        "Feat": "Seething Hatred",
        "Special": [
            "sneak attack +3d6",
            "studied target class feature"
        ]
        },
        "benefit": "When you succeed at a sneak attack with Seething Hatred, roll d8s for damage instead of d6s"
    },
    "Faerie’s Strike": {
        "prerequisites": {
        "Special": "Nature Magic or the ability to cast druid or ranger spells",
        "Feat": "Vital Strike",
        "Skill": {
            "Knowledge (nature)": 5
        }
        },
        "benefit": "Illuminate foes with Vital Strike"
    },
    "False Opening": {
        "prerequisites": {
        "Feat": [
            "Dodge",
            "Weapon Focus (selected ranged weapon)"
        ],
        "Prerequisite Options": {
            "or": [
            "Close Quarters Thrower",
            "Point-Blank Master"
            ]
        }
        },
        "benefit": "May choose to provoke attacks of opportunity; gain +4 AC vs. attacks"
    },
    "Far Shot": {
        "prerequisites": {
        "Feat": "Point Blank Shot"
        },
        "benefit": "Decrease ranged penalties by half"
    },
    "Feint Action (uses Bluff Skill)": {
        "prerequisites": {},
        "benefit": ""
    },
    "Feinting Flurry": {
        "prerequisites": {
        "Stat": {
            "DEX": 15
        },
        "Special": "flurry of blows class feature",
        "Feat": "Combat Expertise"
        },
        "benefit": "You can forgo your first attack in a flurry of blows action to make a Bluff check to feint instead."
    },
    "Feint, Greater": {
        "prerequisites": {
        "Feat": "Improved Feint",
        "BAB": 6
        },
        "benefit": "Enemies you feint lose their Dex bonus for 1 round"
    },
    "Feinting Flurry, Improved": {
        "prerequisites": {
        "Stat": {
            "DEX": 17
        },
        "Special": "flurry of blows class feature",
        "Feat": [
            "Combat Expertise",
            "Feinting Flurry"
        ],
        "BAB": 6
        },
        "benefit": "While using Feinting Flurry, if you successfully feint, your opponent is denied its Dexterity bonus to AC until the end of your turn."
    },
    "Feint, Improved": {
        "prerequisites": {
        "Feat": "Combat Expertise"
        },
        "benefit": "Feint as a move action"
    },
    "Felling Escape": {
        "prerequisites": {
        "Feat": "Improved Trip"
        },
        "benefit": "Trip a foe when you break a grapple"
    },
    "Felling Smash": {
        "prerequisites": {
        "Feat": [
            "Improved Trip",
            "Power Attack"
        ],
        "BAB": 6
        },
        "benefit": "Trip a foe when you make a Power Attack"
    },
    "Fencing Grace": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": [
            "Weapon Finesse",
            "Weapon Focus (rapier)"
        ]
        },
        "benefit": "Use Dexterity on rapier damage rolls"
    },
    "Feral Combat Training": {
        "prerequisites": {
        "Feat": [
            "Improved Unarmed Strike",
            "Weapon Focus (natural weapon)"
        ]
        },
        "benefit": "Use Improved Unarmed Strike feats with natural weapons"
    },
    "Ferocious Tenacity": {
        "prerequisites": {
        "Race": [
            "Half-orc",
            "orc"
        ],
        "Special": [
            "ferocity racial trait",
            "rage class feature"
        ]
        },
        "benefit": "Negate some damage when it would otherwise kill you by expending rage points."
    },
    "Filthy Weapons": {
        "prerequisites": {
        "Skill": {
            "Knowledge (dungeoneering)": 1,
            "Knowledge (nature)": 1
        }
        },
        "benefit": "You can take a standard action to cover a weapon in decomposing waste, slimy filth, or other virulent agent. The next attack with that weapon that succeeds against a foe exposes the target to filth fever. If the attack is a critical hit, the filth fever has an onset time of 1 round, and a save DC equal to 10 + 1/2 your base attack bonus + your Intelligence modifier."
    },
    "Final Embrace": {
        "prerequisites": {
        "Stat": {
            "STR": 13,
            "INT": 3
        },
        "BAB": 3,
        "Prerequisite Options": {
            "or": [
            {
                "Race": [
                "naga",
                "serpentfolk"
                ]
            },
            {
                "Special": "constrict special attack"
            }
            ]
        }
        },
        "benefit": "Gain constrict and grab special attacks"
    },
    "Final Embrace Horror": {
        "prerequisites": {
        "Stat": {
            "STR": 15
        },
        "Feat": "Final Embrace",
        "BAB": 6
        },
        "benefit": "Creatures that take constriction damage from you are also shaken"
    },
    "Final Embrace Master": {
        "prerequisites": {
        "Stat": {
            "STR": 17
        },
        "Feat": "Final Embrace Horror",
        "BAB": 9
        },
        "benefit": "Your constrict attack deals double the number of damage dice"
    },
    "Firebrand": {
        "prerequisites": {},
        "benefit": "Treat a torch as a light mace; with one point of fire damage"
    },
    "Fire Hand": {
        "prerequisites": {
        "Race": "Goblin"
        },
        "benefit": "You can wield a torch as a weapon without taking the nonproficient penalty and gain a +1 bonus on attack rolls with melee weapons that deal fire damage."
    },
    "Flagbearer": {
        "prerequisites": {
        "Stat": {
            "CHA": 15
        }
        },
        "benefit": "You and others with same allegiance gain +1 morale bonus on attacks, weapon damage rolls, and saving throws vs. fear and charm effects while holding a flag."
    },
    "Flanking Foil": {
        "prerequisites": {},
        "benefit": "Foes you strike lose their flanking bonus against you"
    },
    "Flinging Charge": {
        "prerequisites": {
        "Feat": "Quick Draw",
        "BAB": 6
        },
        "benefit": "Attack with a thrown weapon during a charge and then end the charge with a melee weapon attack"
    },
    "Focused Discipline": {
        "prerequisites": {},
        "benefit": "Gain temporary combat bonuses after resisting fear effects"
    },
    "Focused Shot": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": "Precise Shot"
        },
        "benefit": "Add Int modifier on damage rolls with bows or crossbows"
    },
    "Following Step": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": "Step Up"
        },
        "benefit": "Move up to 10 feet as an immediate action"
    },
    "Fortified Armor Training": {
        "prerequisites": {
        "Special": "Proficient with armor or shield"
        },
        "benefit": "Break armor or shield to turn critical hit into a normal hit"
    },
    "Fox Style": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        }
        },
        "benefit": "Feint and distract with martial training"
    },
    "Fox Insight": {
        "prerequisites": {
        "Feat": "Fox Style"
        },
        "benefit": "You are difficult to feint against and demoralize"
    },
    "Fox Trickery": {
        "prerequisites": {
        "Feat": [
            "Combat Expertise",
            "Fox Insight",
            "Fox Style",
            "Improved Dirty Trick"
        ]
        },
        "benefit": "Perform dirty tricks as attacks of opportunity"
    },
    "Friendly Fire Maneuvers": {
        "prerequisites": {
        "Feat": [
            "Point-Blank Shot",
            "Precise Shot"
        ]
        },
        "benefit": "Allies who also have this feat cannot provide soft cover to enemies, allowing you to make attacks of opportunity against an enemy even if those allies grant you soft cover against that foe’s attacks."
    },
    "Friendly Rivalry": {
        "prerequisites": {
        "Race": "Human"
        },
        "benefit": "Gain +2 morale bonus on melee attacks against foes only you threaten if an ally is the only one threatening a different foe"
    },
    "Frightening Ambush": {
        "prerequisites": {
        "Skill": {
            "Intimidate": 1
        }
        },
        "benefit": "As a free action, you can attempt an Intimidate check to demoralize a flat-footed opponent you attack."
    },
    "Furious Focus": {
        "prerequisites": {
        "Stat": {
            "STR": 13
        },
        "Feat": "Power Attack",
        "BAB": 1
        },
        "benefit": "Do not take the Power Attack penalty on the first attack each round"
    },
    "Fury’s Fall": {
        "prerequisites": {
        "Feat": "Improved Trip"
        },
        "benefit": "Add your dexterity bonus to CMB with trip attacks."
    },
    "Fury of the Tainted": {
        "prerequisites": {
        "Stat": {
            "CHA": 13
        },
        "Race": "tiefling",
        "Special": "rage class feature"
        },
        "benefit": "While raging, you gain a +4 competence bonus on saving throws against spells and effects with the [good] descriptor."
    },
    "Fury of the Tainted, Improved": {
        "prerequisites": {
        "Stat": {
            "CHA": 13
        },
        "Feat": "Fury of the Tainted",
        "BAB": 8,
        "Special": "rage class feature",
        "Race": "tiefling"
        },
        "benefit": "While raging, you gain SR equal to 10 + your class level against spells with the [good] descriptor."
    },
    "Fury’s Snare": {
        "prerequisites": {
        "Feat": [
            "Fury’s Fall",
            "Improved Trip"
        ]
        },
        "benefit": "Entangle your opponent with trip attacks involving a whip."
    },
    "Gang Up": {
        "prerequisites": {
        "Feat": "Combat Expertise"
        },
        "benefit": "Flank an opponent if at least two allies are adjacent to it"
    },
    "Gate Breaker": {
        "prerequisites": {
        "Stat": {
            "STR": 13
        },
        "Feat": [
            "Improved Sunder",
            "Power Attack"
        ],
        "BAB": 1
        },
        "benefit": "Whenever you would deal damage to an object, you deal normal damage plus an additional amount equal to your Strength modifier."
    },
    "Ghostslayer": {
        "prerequisites": {
        "BAB": 1,
        "Skill": {
            "Knowledge (religion)": 1
        }
        },
        "benefit": "As a swift action, you can imbue a weapon you wield with spiritual energies for 1 round. An imbued weapon damages incorporeal creatures as though it were magical. If the imbued weapon has an enhancement bonus of +2 or greater, it functions as a ghost touch weapon."
    },
    "Giant Killer": {
        "prerequisites": {
        "Stat": {
            "STR": 13
        },
        "Feat": [
            "Cleave",
            "Goblin Cleaver",
            "Orc Hewer",
            "Power Attack",
            "Strike Back"
        ],
        "BAB": 11,
        "Race": "Dwarf"
        },
        "benefit": "This functions as Goblin Cleaver, but your additional attacks can be made against creatures one size category larger than you or smaller. In addition, any such attacks made against humanoids (giant) gain a +2 circumstance bonus on attack rolls."
    },
    "Giantslaying Team": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": [
            "Dodge",
            "Mobility"
        ],
        "BAB": 4,
        "Special": "defensive training racial trait"
        },
        "benefit": "Attack a giant as an immediate action when the giant’s AOO misses an ally with this feat"
    },
    "Gloom Strike": {
        "prerequisites": {
        "Feat": "Blind-Fight",
        "Race": "Fetchling"
        },
        "benefit": "When you are within an area of dim light or darkness, you gain a +1 bonus on attack rolls against enemies that are also within dim light or darkness."
    },
    "Gnome Weapon Focus": {
        "prerequisites": {
        "BAB": 1,
        "Race": "Gnome",
        "Special": "proficient with all martial weapons"
        },
        "benefit": "You gain a +1 bonus on attack rolls with gnome weapons (weapons with “gnome” in the title)."
    },
    "Goblin Cleaver": {
        "prerequisites": {
        "Stat": {
            "STR": 13
        },
        "Feat": [
            "Cleave",
            "Power Attack"
        ],
        "Race": "Dwarf"
        },
        "benefit": "When using Cleave or Great Cleave, if your initial attack hits, you may take your additional attacks against any creature smaller than you that you threaten; your targets need not be adjacent to one another. Additional attacks you make against humanoids (goblinoid) gain a +2 circumstance bonus on attack rolls."
    },
    "Goblin Gunslinger": {
        "prerequisites": {
        "Race": "Goblin"
        },
        "benefit": "You can wield Medium firearms without taking the penalty for an inappropriately sized weapon."
    },
    "Gore Fiend": {
        "prerequisites": {
        "Race": [
            "Half-orc",
            "Orc"
        ],
        "Special": "rage class feature"
        },
        "benefit": "Regain rounds of rage by dealing or suffering critical hits."
    },
    "Gory Finish": {
        "prerequisites": {
        "Feat": [
            "Dazzling Display",
            "Weapon Focus"
        ]
        },
        "benefit": "Make an Intimidate check if you reduce an opponent to negative hit points"
    },
    "Got Your Back": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": "Combat Expertise"
        },
        "benefit": "If you successfully use the aid another action to give an ally who also has this feat a +2 bonus to AC against an opponent’s next attack, the ally is also not considered flanked or flat-footed against that opponent until the beginning of your next turn."
    },
    "Grabbing Style": {
        "prerequisites": {
        "Feat": "Improved Grapple",
        "BAB": 6,
        "Special": "brawler’s flurry or flurry of blows"
        },
        "benefit": "Take no penalty for grabbing a foe one-handed, retain your Dex bonus to AC when pinning"
    },
    "Grabbing Drag": {
        "prerequisites": {
        "Feat": "Grabbing Style",
        "BAB": 8,
        "Class": {
            "brawler": 4,
            "monk": 4
        }
        },
        "benefit": "Move farther with dragged foes"
    },
    "Grabbing Master": {
        "prerequisites": {
        "Feat": "Grabbing Drag",
        "BAB": 12,
        "Class": {
            "brawler": 8,
            "monk": 8
        }
        },
        "benefit": "Grab two foes instead of just one"
    },
    "Graceful Steal": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": [
            "Agile Maneuvers",
            "Improved Steal"
        ],
        "Skill": {
            "Sleight Of Hand": 3
        }
        },
        "benefit": "Steal outside of combat and from containers"
    },
    "Grapple, Improved": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": "Improved Unarmed Strike"
        },
        "benefit": "+2 bonus on grapple attempts, no AOO"
    },
    "Grapple, Greater": {
        "prerequisites": {
        "Feat": "Improved Grapple",
        "BAB": 6
        },
        "benefit": "Maintain your grapple as a move action"
    },
    "Grasping Strike": {
        "prerequisites": {
        "Special": "Nature Magic or the ability to cast druid or ranger spells",
        "Feat": "Vital Strike"
        },
        "benefit": "Entangle those you hit with Vital Strike"
    },
    "Great Hatred": {
        "prerequisites": {
        "Race": "Gnome",
        "Special": "hatred racial trait"
        },
        "benefit": "You gain an additional +1 bonus on melee and thrown weapon attacks against targets of your hatred racial trait."
    },
    "Greater Hunter’s Bond": {
        "prerequisites": {
        "Feat": "Improved Hunter’s Bond",
        "Special": "hunter’s bond (companions) class feature",
        "Class": {
            "ranger": 12
        }
        },
        "benefit": "Select targets equal to your Wisdom modifier to benefit from your hunter’s bond"
    },
    "Greater Spring Attack": {
        "prerequisites": {
        "Stat": {
            "DEX": 17
        },
        "Feat": [
            "Acrobatic Steps",
            "Dodge",
            "Improved Spring Attack",
            "Mobility",
            "Nimble Moves",
            "Spring Attack"
        ],
        "BAB": 16
        },
        "benefit": "Attack up to three targets instead of one when you use Spring Attack"
    },
    "Grudge Fighter": {
        "prerequisites": {
        "Race": "Orc"
        },
        "benefit": "You gain a +1 morale bonus on attack and damage rolls made against any creature that attacked you in the current combat."
    },
    "Gruesome Slaughter": {
        "prerequisites": {
        "Feat": [
            "Intimidating Prowess",
            "Killing Flourish"
        ],
        "Skill": {
            "Intimidate": 11
        },
        "Class": {
            "slayer": 11
        }
        },
        "benefit": "Creatures demoralized by Killing Flourish could become sickened"
    },
    "Halfling Slinger": {
        "prerequisites": {
        "Race": "Halfling"
        },
        "benefit": "You gain a +1 racial bonus on attack rolls made using a sling."
    },
    "Hamatula Grasp": {
        "prerequisites": {
        "Feat": [
            "Hamatula Strike",
            "Improved Grapple"
        ],
        "Stat": {
            "STR": 13
        },
        "BAB": 9
        },
        "benefit": "Deal more damage to foes impaled with Hamatula Strike."
    },
    "Hamatula Strike": {
        "prerequisites": {
        "Feat": "Improved Grapple",
        "Stat": {
            "STR": 13
        },
        "BAB": 7
        },
        "benefit": "Impale opponents with grapple checks."
    },
    "Hamatulatsu": {
        "prerequisites": {
        "Feat": [
            "Improved Unarmed Strike",
            "Weapon Focus (unarmed strike)"
        ]
        },
        "benefit": "Unarmed attacks can inflict piercing damage and sicken foes."
    },
    "Hammer the Gap": {
        "prerequisites": {
        "BAB": 6
        },
        "benefit": "With a full-attack action, each hit against the same opponent deals extra damage."
    },
    "Hard-headed": {
        "prerequisites": {
        "BAB": 1,
        "Race": "Dwarf"
        },
        "benefit": "You gain a +1 bonus on attack rolls and combat maneuver checks made using a helmet. You receive a +2 bonus on saves against spells and special abilities that cause you to become staggered or stunned."
    },
    "Harrying Partners": {
        "prerequisites": {
        "Special": "Any teamwork feat",
        "BAB": 6
        },
        "benefit": "When you successfully use the aid another action to improve the Armor Class or attack roll of an ally who also has this feat, the benefit from aid another lasts until the beginning of your next turn."
    },
    "Haunted Gnome": {
        "prerequisites": {
        "Stat": {
            "CHA": 13
        },
        "Race": "Gnome",
        "Special": "gnome magic racial trait",
        "Skill": {
            "Knowledge (arcana)": 1
        }
        },
        "benefit": "You add haunted fey aspect to your list of gnome magic spell-like abilities, and you can use this spell-like ability twice per day."
    },
    "Haunted Gnome Assault": {
        "prerequisites": {
        "Feat": "Haunted Gnome",
        "Skill": {
            "Knowledge (arcana)": 3
        }
        },
        "benefit": "Gain independent use of gnome magic."
    },
    "Haunted Gnome Shroud": {
        "prerequisites": {
        "Feat": "Haunted Gnome Assault",
        "Skill": {
            "Knowledge (arcana)": 6
        }
        },
        "benefit": "Gain additional use of gnome magic."
    },
    "Hellcat Pounce": {
        "prerequisites": {
        "Feat": [
            "Hellcat Stealth",
            "Skill Focus (Stealth)"
        ],
        "Special": "sneak attack +2d6"
        },
        "benefit": "Gain bonus attacks against surprised opponents."
    },
    "Heroic Leader": {
        "prerequisites": {
        "Stat": {
            "CHA": 13
        },
        "Feat": "Any combat feat",
        "Special": "ability to gain an animal companion, cohort, eidolon, familiar, or mount"
        },
        "benefit": "Your animal companion, cohort, eidolon, familiar, or mount doesn’t count as threatening your opponent for the purposes of feats that require you to be the only character threatening a target. Allies with Hit Dice equal to or less than 1/2 your own Hit Dice don’t count as threatening opponents for the purposes of such feats."
    },
    "Hex Strike": {
        "prerequisites": {
        "Special": "Hex class feature",
        "Feat": "Improved Unarmed Strike"
        },
        "benefit": "Upon successful unarmed strike, you may use a hex."
    },
    "Hold the Blade": {
        "prerequisites": {
        "Feat": "Improved Disarm",
        "BAB": 10
        },
        "benefit": "If you have one hand free, as an immediate action you can take a -4 penalty to your AC and attempt to disarm an opponent that has hit you with a melee weapon as part of a flanking attack or a sneak attack."
    },
    "Horrific Gorging": {
        "prerequisites": {
        "Special": [
            "Bite attack",
            "swallow whole universal monster ability",
            "size Large or larger"
        ]
        },
        "benefit": "Swallow one foe to make its allies shaken."
    },
    "Horse Master": {
        "prerequisites": {
        "Special": "Expert trainer class feature",
        "Skill": {
            "Ride": 6
        }
        },
        "benefit": "Use your character level to determine powers and abilities for your mount."
    },
    "Impact Critical Shot": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "Feat": "Point-Blank Shot",
        "BAB": 9
        },
        "benefit": "You can bull rush on a critical hit"
    },
    "Impaling Critical": {
        "prerequisites": {
        "Feat": [
            "Critical Focus",
            "Weapon Specialization (piercing)"
        ],
        "BAB": 11
        },
        "benefit": "May impale and deal extra damage to opponent with a critical hit"
    },
    "Improved Impaling Critical": {
        "prerequisites": {
        "Feat": "Impaling Critical",
        "BAB": 13
        },
        "benefit": "Impaled opponent must succeed at a grapple maneuver to pull your weapon out"
    },
    "Improved Awesome Blow": {
        "prerequisites": {
        "Stat": {"STR": 13},
        "Prerequisite Options": {
            "or": [
            "Awesome Blow",
            "awesome blow class feature"
            ]
        },
        "Feat": "Power Attack"
        },
        "benefit": "+2 on awesome blow combat maneuver checks and to CMD against such attacks, and movement due to awesome blow provokes from allies"
    },
    "Improved Critical": {
        "prerequisites": {
        "Special": "Proficient with weapon",
        "BAB": 8
        },
        "benefit": "When using the weapon you selected, your threat range is doubled."
    },
    "Improved Hunter’s Bond": {
        "prerequisites": {
        "Special": "Hunter’s bond (companions) class feature",
        "Class": {"ranger": 9}
        },
        "benefit": "Grant your allies full favored enemy bonus"
    },
    "Improved Initiative": {
        "prerequisites": {},
        "benefit": "+4 bonus on initiative checks"
    },
    "Improved Low Blow": {
        "prerequisites": {
        "BAB": 4,
        "Race": "Halfling",
        "Special": "low-blow racial trait"
        },
        "benefit": "Your bonus to confirm critical hits against opponents larger than yourself improves to +2. Furthermore, once per day, after you fail to hit with a critical hit confirmation roll, you can reroll the confirmation roll, but must take the new result even if it is worse."
    },
    "Improved Parry": {
        "prerequisites": {
        "Stat": {"INT": 13},
        "Feat": "Combat Expertise"
        },
        "benefit": "When you successfully parry a foe’s melee attack (with a dueling parry or the parry class feature), your next melee attack against the target does not allow the enemy to apply its Dexterity bonus to AC (if any). This attack must be made before the end of your next turn."
    },
    "Improved Surprise Follow-Through": {
        "prerequisites": {
        "Stat": {"STR": 13},
        "Feat": [
            "Cleave",
            "Great Cleave",
            "Power Attack",
            "Surprise Follow Through"
        ],
        "BAB": 8
        },
        "benefit": "When using Great Cleave, each opponent you attack on your turn (other than the first) is denied his Dexterity bonus against you."
    },
    "Improved Spring Attack": {
        "prerequisites": {
        "Stat": {"DEX": 15},
        "Feat": [
            "Dodge",
            "Mobility",
            "Nimble Moves",
            "Spring Attack"
        ],
        "BAB": 9
        },
        "benefit": "Attack up to two targets instead of one when you use Spring Attack"
    },
    "Improved Swap Places": {
        "prerequisites": {
        "Feat": "Swap Places"
        },
        "benefit": "When you use Swap Places, your ally can be smaller or larger and your movement does not provoke attacks of opportunity"
    },
    "Improved Two-Weapon Feint": {
        "prerequisites": {
        "Feat": [
            "Combat Expertise",
            "Improved Two-Weapon Fighting"
        ]
        },
        "benefit": "Make a Bluff check instead of your first attack"
    },
    "Improvised Weapon Mastery": {
        "prerequisites": {
        "Prerequisite Options": {
            "or": [
            "Catch Off-Guard",
            "Throw Anything"
            ]
        },
        "BAB": 8
        },
        "benefit": "Make an improvised weapon deadly"
    },
    "Improved Bravery": {
        "prerequisites": {
        "Stat": {"CHA": 13},
        "Special": "bravery class feature"
        },
        "benefit": "Bravery applies against all mind-affecting effects"
    },
    "Incite Paranoia": {
        "prerequisites": {
        "Stat": {"INT": 13},
        "Feat": [
            "Combat Expertise",
            "Deceitful",
            "Greater Feint",
            "Improved Feint"
        ],
        "BAB": 6
        },
        "benefit": "Ruin your foes’ teamwork and spread doubt among them"
    },
    "Indomitable Mount": {
        "prerequisites": {
        "Feat": "Mounted Combat",
        "Skill": {
            "Handle Animal": 5,
            "Ride": 5
        }
        },
        "benefit": "Once per round you can substitute your Ride check for your mount's saving throw."
    },
    "In Harm’s Way": {
        "prerequisites": {
        "Feat": "Bodyguard"
        },
        "benefit": "Take the damage of a successful attack upon an adjacent ally"
    },
    "Inner Flame": {
        "prerequisites": {
        "Feat": "Scorching Weapons",
        "Level": 7,
        "Special": "Ifrit"
        },
        "benefit": "Your bonus on saves against fire attacks and spells with the fire descriptor or light descriptor increases to +4. When you use Scorching Weapons, the affected weapons deal an additional 1d6 points of fire damage instead of 1, and when you are grappling, you deal this damage to your grappling opponent on your turn."
    },
    "Inspiring Bravery": {
        "prerequisites": {
        "Stat": {"CHA": 13},
        "Special": "bravery class feature"
        },
        "benefit": "Grant your bravery to allies within 30 feet"
    },
    "Intercept Charge": {
        "prerequisites": {},
        "benefit": "Move up to your speed to intercept charging foe as an immediate action"
    },
    "Intimidate Animals": {
        "prerequisites": {
        "Feat": "Greater Wild Empathy",
        "Skill": {
            "Intimidate": 5,
            "Knowledge (nature)": 5
        },
        "Special": "wild empathy class feature"
        },
        "benefit": "Add your Wisdom modifier on Intimidate checks in addition to Charisma modifier when intimidating animals"
    },
    "Intimidating Prowess": {
        "prerequisites": {},
        "benefit": "Add STR to Intimidate in addition to CHA"
    },
    "Jabbing Style": {
        "prerequisites": {
        "Feat": "Improved Unarmed Strike",
        "BAB": 6,
        "Prerequisite Options": {
            "or": [
            {
                "Class Feature": "brawler's flurry"
            },
            {
                "Class Feature": "flurry of blows"
            }
            ]
        }
        },
        "benefit": "Gain bonus damage when two or more unarmed strikes hit the same opponent during your turn"
    },
    "Jabbing Dancer": {
        "prerequisites": {
        "Feat": [
            "Dodge",
            "Jabbing Style",
            "Mobility"
        ],
        "BAB": 9,
        "Prerequisite Options": {
            "or": [
            {
                "Class": {
                "monk": 5
                }
            },
            {
                "Class": {
                "brawler": 5
                }
            }
            ]
        }
        },
        "benefit": "Move 5 feet without provoking attacks of opportunity whenever you hit with an unarmed strike."
    },
    "Jabbing Master": {
        "prerequisites": {
        "Feat": [
            "Power Attack",
            "Jabbing Dancer"
        ],
        "BAB": 12,
        "Prerequisite Options": {
            "or": [
            {
                "Class": {
                "monk": 8
                }
            },
            {
                "Class": {
                "brawler": 8
                }
            }
            ]
        }
        },
        "benefit": "Increase the damage dealt with Jabbing Style"
    },
    "Jaguar Pounce": {
        "prerequisites": {
        "BAB": 4
        },
        "benefit": "Gain benefits of Improved Critical feat when charging or Spring Attacking a flat-footed or helpless foe"
    },
    "Jawbreaker": {
        "prerequisites": {
        "Skill": {
            "Heal": 6
        },
        "Feat": [
            "Improved Unarmed Strike",
            "Stunning Fist"
        ]
        },
        "benefit": "With successful Stunning Fist, you may cripple opponent’s mouth"
    },
    "Bonebreaker": {
        "prerequisites": {
        "Feat": [
            "Improved Grapple",
            "Jawbreaker"
        ],
        "Skill": {
            "Heal": 9
        }
        },
        "benefit": "Deal Str or Dex damage when using Stunning Fist"
    },
    "Neckbreaker": {
        "prerequisites": {
        "Feat": [
            "Bonebreaker",
            "Greater Grapple",
            "Improved Grapple",
            "Improved Unarmed Strike",
            "Jawbreaker",
            "Stunning Fist"
        ],
        "Skill": {
            "Heal": 12
        }
        },
        "benefit": "May deal Str or Dex damage to pinned opponent"
    },
    "Juggle Load": {
        "prerequisites": {
        "Feat": "Ammo Drop",
        "Skill": {
            "Sleight Of Hand": 1
        },
        "Special": "proficient with sling"
        },
        "benefit": "This feat allows you to fire your sling as many times in a full-attack action as you could if you were using a bow."
    },
    "Juke": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": [
            "Dodge",
            "Mobility",
            "Sidestep"
        ]
        },
        "benefit": "When an opponent charges you, you gain a +4 dodge bonus to your AC. If the charger’s attack roll misses you and his movement ends while he is adjacent to you, you can switch places with the opponent as an immediate action, and he is considered to be flanked by you until the end of your next turn. You can’t use the benefits of Juke if you ready an action to set a weapon with the brace special quality against a charging foe."
    },
    "Just out of Reach": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": [
            "Dodge",
            "Mobility"
        ]
        },
        "benefit": "When a foe more than 5 ft. away from you makes a melee attack against you using reach, you gain a +4 dodge bonus to your AC against the attack."
    },
    "Kick Up": {
        "prerequisites": {
        "Stat": {
            "DEX": 12
        },
        "Feat": "Acrobatic",
        "Skill": {
            "Acrobatics": 1
        },
        "Prerequisite Options": {
            "or": [
            {
                "Class": {
                "slayer": 1
                }
            },
            {
                "Class": {
                "swashbuckler": 1
                }
            }
            ]
        }
        },
        "benefit": "Retrieve an unattended item as a swift action"
    },
    "Ki Diversity": {
        "prerequisites": {
        "Class Feature": "Ki pool",
        "Stat": {
            "WIS": 13
        }
        },
        "benefit": "You learn how to channel your ki in a new ability."
    },
    "Killing Flourish": {
        "prerequisites": {
        "Feat": "Intimidating Prowess",
        "Skill": {
            "Intimidate": 4
        },
        "Class": {
            "slayer": 4
        }
        },
        "benefit": "When melee attacks reduce a foe to below 0 hit points, demoralize those around you"
    },
    "Ki Throw": {
        "prerequisites": {
        "Feat": [
            "Improved Trip",
            "Improved Unarmed Strike"
        ]
        },
        "benefit": "Throw opponent into adjacent square with a trip attack"
    },
    "Ki Throw, Enhanced": {
        "prerequisites": {
        "Class Feature": "Ki pool",
        "Feat": "Ki Throw"
        },
        "benefit": "Expend 1 ki point when using Ki Throw to cause target to take damage as if you had hit it with an unarmed strike when it falls."
    },
    "Ki Throw, Improved": {
        "prerequisites": {
        "Feat": [
            "Improved Bull Rush",
            "Ki Throw"
        ]
        },
        "benefit": "Throw opponent into occupied square as a bull rush"
    },
    "Kobold Ambusher": {
        "prerequisites": {
        "Skill": {
            "Stealth": 4
        },
        "Race": "Kobold"
        },
        "benefit": "You take no penalty on Stealth checks when you move up to your full speed. You can use the run or charge action and remain hidden, taking a –10 penalty on the check to do so."
    },
    "Kobold Sniper": {
        "prerequisites": {
        "Skill": {
            "Stealth": 1
        },
        "Race": "Kobold"
        },
        "benefit": "When you are sniping, you only take a –10 penalty on your Stealth checks to stay hidden."
    },
    "Kraken Style": {
        "prerequisites": {
        "Stat": {
            "WIS": 13
        },
        "Feat": [
            "Improved Grapple",
            "Improved Unarmed Strike"
        ],
        "Prerequisite Options": {
            "or": [
            {
                "BAB": 3
            },
            {
                "Class": {
                "monk": 3
                }
            }
            ]
        }
        },
        "benefit": "When you succeed at a grapple check while using this style, your opponent takes an amount of bludgeoning damage equal to your Wisdom modifier in addition to any damage your grapple deals. In addition, you gain a +2 bonus on combat maneuver checks to maintain a grapple."
    },
    "Kraken Throttle": {
        "prerequisites": {
        "Stat": {
            "WIS": 13
        },
        "Feat": [
            "Improved Grapple",
            "Improved Unarmed Strike",
            "Kraken Style"
        ],
        "Prerequisite Options": {
            "or": [
            {
                "BAB": 5
            },
            {
                "Class": {
                "monk": 5
                }
            }
            ]
        }
        },
        "benefit": "The damage that you deal with the Kraken Style feat on a successful grapple combat maneuver check increases to an amount equal to your Wisdom bonus + 2."
    },
    "Kraken Wrack": {
        "prerequisites": {
        "Stat": {
            "WIS": 13
        },
        "Feat": [
            "Improved Grapple",
            "Improved Unarmed Strike",
            "Kraken Style"
        ],
        "Prerequisite Options": {
            "or": [
            {
                "BAB": 7
            },
            {
                "Class": {
                "monk": 7
                }
            }
            ]
        }
        },
        "benefit": "The damage you deal with the Kraken Style feat on a successful grapple combat maneuver check increases to an amount equal to your Wisdom modifier + 4. While using this style, you can crush your opponent when you successfully maintain a grapple instead of choking, damaging, moving, pinning, or tying up your opponent."
    },
    "Kyton Style": {
        "prerequisites": {
        "Stat": {
            "WIS": 13
        },
        "Feat": "Exotic Weapon Proficiency (spiked chain)",
        "Skill": {
            "Knowledge (Planes)": 3
        },
        "Class Feature": "Ki pool"
        },
        "benefit": "Use a spiked chain as a monk weapon and deliver Stunning Fist through it"
    },
    "Kyton Shield": {
        "prerequisites": {
        "Stat": {
            "WIS": 15
        },
        "Feat": "Kyton Style",
        "BAB": 5,
        "Skill": {
            "Knowledge (Planes)": 3
        }
        },
        "benefit": "Spiked chain acts as both weapon and shield"
    },
    "Kyton Cut": {
        "prerequisites": {
        "Stat": {
            "WIS": 17
        },
        "Feat": [
            "Kyton Shield",
            "Kyton Style"
        ],
        "Prerequisite Options": {
            "or": [
            {
                "BAB": 8
            },
            {
                "Class": {
                "monk": 6
                }
            }
            ]
        }
        },
        "benefit": "Spiked chain attacks can hurt both you and the target, and hinder concentration"
    },
    "Landing Roll": {
        "prerequisites": {
        "Feat": "Mobility"
        },
        "benefit": "If tripped, move 5 feet as an immediate action"
    },
    "Large Target": {
        "prerequisites": {
        "Special": "Proficient with sling"
        },
        "benefit": "Attacks with slings add +1 bonus to damage for every size category opponent is larger than you."
    },
    "Latching Horror": {
        "prerequisites": {
        "Special": "Attach universal monster ability"
        },
        "benefit": "A foe is shaken when you attach to it"
    },
    "Lead from the Back": {
        "prerequisites": {
        "Skill": {
            "Intimidate": 1
        }
        },
        "benefit": "If you have cover or concealment and are not threatened, you may bark orders and grant your allies a bonus to damage rolls."
    },
    "Leapfrog": {
        "prerequisites": {
        "Skill": {
            "Acrobatics": 3
        }
        },
        "benefit": "When you spend a swift action to attempt a performance combat check after a successful charge attack or combat maneuver, you gain a +2 bonus on your performance combat check and gain a +4 bonus on your next Acrobatics, Climb, Fly, Ride, or Swim check attempted before the end of your next turn."
    },
    "Leaping Evasion": {
        "prerequisites": {
        "Feat": "Lightning Reflexes",
        "Class Feature": "evasion"
        },
        "benefit": "When you succeed at a Reflex save against a spell or effect that affects an area, as an immediate action you can attempt an Acrobatics check to jump out of the effect’s area."
    },
    "Let Them Come": {
        "prerequisites": {
        "Race": "Dwarf",
        "Special": "Ninth Battalion TPA 25"
        },
        "benefit": "You treat all one- or two-handed melee weapons as if they had the brace special feature."
    },
    "Lightning Draw": {
        "prerequisites": {
        "Feat": "Quick Draw",
        "Special": "swashbuckler initiative deed",
        "Class": {
            "swashbuckler": 7
        }
        },
        "benefit": "Draw weapons reflexively"
    },
    "Lightning Stance": {
        "prerequisites": {
        "Stat": {
            "DEX": 17
        },
        "Feat": "Wind Stance",
        "BAB": 11
        },
        "benefit": "Gain 50% concealment if you move"
    },
    "Lob Shot": {
        "prerequisites": {
        "Feat": [
            "Far Shot",
            "Point-Blank Shot"
        ]
        },
        "benefit": "While making a ranged attack, you can ignore any cover bonuses to AC, including total cover, unless the target also has cover from above, such as a roof or forest canopy. When using this feat, treat your target as if it were one range increment farther away. You can’t use this feat unless you have headroom equal to at least half the attack’s range."
    },
    "Lookout": {
        "prerequisites": {},
        "benefit": "Act in surprise round if ally can act"
    },
    "Low Profile": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Size": "Small or smaller"
        },
        "benefit": "+1 dodge bonus to AC against ranged attacks"
    },
    "Lucky Strike": {
        "prerequisites": {
        "BAB": 5,
        "Special": "adaptive luck racial trait",
        "Race": "Halfling"
        },
        "benefit": "Spend a use of your adaptive luck racial trait to reroll the damage from a single weapon attack. You deal damage equal to the new damage roll, or the original roll, whichever is greater."
    },
    "Lunge": {
        "prerequisites": {
        "BAB": 6
        },
        "benefit": "Take a –2 penalty to your AC to attack with reach"
    },
    "Mad Magic": {
        "prerequisites": {
        "Prerequisite Options": {
            "or": [
            { "Class Feature": "Bloodrage" },
            { "Rage Power": "Perfect Clarity" }
            ]
        }
        },
        "benefit": "Magic is in your blood, allowing you to cast spells no matter how furious you become."
    },
    "Maddening Style": {
        "prerequisites": {
        "Stat": {
            "WIS": 15,
            "CHA": 11
        },
        "Feat": [
            "Improved Unarmed Strike",
            "Stunning Fist"
        ],
        "Skill": {
            "Knowledge (arcana)": 4
        },
        "Class Feature": "ki pool",
        "Special": "nongood alignment"
        },
        "benefit": "Gain additional use of Stunning Fist, increase DC of madness effects, and deal Wisdom/sanity damage with Stunning Fist"
    },
    "Maddening Strike": {
        "prerequisites": {
        "Stat": {
            "WIS": 17,
            "CHA": 13
        },
        "Feat": "Maddening Style",
        "Skill": {
            "Knowledge (arcana)": "required"
        }
        },
        "benefit": "Use ki to deal substantial Wisdom/sanity damage"
    },
    "Maddening Obliteration": {
        "prerequisites": {
        "Stat": {
            "WIS": 19,
            "CHA": 15
        },
        "Feat": [
            "Maddening Strike",
            "Maddening Style"
        ],
        "Skill": {
            "Knowledge (arcana)": 10
        }
        },
        "benefit": "Your unarmed strikes weaken foes against madness and can disintegrate the fallen"
    },
    "Manifold Stare": {
        "prerequisites": {
        "Class": {
            "Mesmerist": 3
        },
        "Class Feature": "painful stare"
        },
        "benefit": "You can trigger your painful stare one additional time per round"
    },
    "Mantis Style": {
        "prerequisites": {
        "Feat": [
            "Improved Unarmed Strike",
            "Stunning Fist"
        ],
        "Skill": {
            "Heal": 3
        }
        },
        "benefit": "You gain one additional Stunning Fist attempt per day. While using this style, you gain a +2 bonus to the DC of effects you deliver with your Stunning Fist."
    },
    "Manyshot": {
        "prerequisites": {
        "Stat": {
            "DEX": 17
        },
        "Feat": "Rapid Shot",
        "BAB": 6
        },
        "benefit": "Shoot two arrows simultaneously"
    },
    "Martial Dominance": {
        "prerequisites": {
        "BAB": 5,
        "Skill": {
            "Intimidate": 1
        }
        },
        "benefit": "Intimidate with martial training and on critical hits"
    },
    "Martial Focus": {
        "prerequisites": {
        "BAB": 5
        },
        "benefit": "+1 damage with weapons from chosen weapon group"
    },
    "Martial Mastery": {
        "prerequisites": {
        "Feat": "Martial Versatility",
        "Class": {
            "fighter": 16
        },
        "Race": "Human"
        },
        "benefit": "Each combat feat you have that applies to a specific weapon (e.g., Weapon Focus) can be used with all weapons in the same weapon group."
    },
    "Martial Versatility": {
        "prerequisites": {
        "Class": {
            "fighter": 4
        },
        "Race": "Human"
        },
        "benefit": "Choose one combat feat you know that applies to a specific weapon (e.g., Weapon Focus). You can use that feat with any weapon within the same weapon group."
    },
    "Martial Weapon Proficiency": {
        "prerequisites": {},
        "benefit": "No penalty on attacks made with one martial weapon."
    },
    "Massed Charge": {
        "prerequisites": {
        "Feat": "Mounted Combat",
        "Skill": {
            "Handle Animal": 1,
            "Ride": 6
        }
        },
        "benefit": "You and your mount suffer no penalties for squeezing when close to others with this same feat. You and your mount gain a +2 bonus on CMD versus bull rush, overrun, and trip attempts."
    },
    "Master Combat Performer": {
        "prerequisites": {
        "Prerequisite Options": {
            "or": [
            { "Feat": "Performing Combatant" },
            { "Performance Feats": 3 }
            ]
        },
        "BAB": 6
        },
        "benefit": "Make a performance combat check as a free action"
    },
    "Measure Foe": {
        "prerequisites": {
        "Skill": {
            "Street Smarts": "required"
        },
        "BAB": 1
        },
        "benefit": "Use Sense Motive to gain additional information about a foe’s martial training."
    },
    "Measured Response": {
        "prerequisites": {
        "BAB": 1
        },
        "benefit": "You may choose to automatically deal average damage if you hit with an attack."
    },
    "Medusa’s Wrath": {
        "prerequisites": {
        "Feat": "Gorgon’s Fist",
        "BAB": 11
        },
        "benefit": "Make 2 extra attacks against a hindered foe"
    },
    "Merciless Beating": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": [
            "Combat Expertise",
            "Gang Up"
        ]
        },
        "benefit": "Whenever you and two or more allies threaten an opponent, you can choose to forgo your flanking bonus to grant each of your allies a +1 flanking bonus on their attack rolls against the threatened creature. This bonus stacks with any flanking bonuses your allies might already have."
    },
    "Merciless Butchery": {
        "prerequisites": {
        "Feat": "Dastardly Finish",
        "Special": "sneak attack +5d6",
        "Class Feature": "studied target"
        },
        "benefit": "Attempt a coup de grace against a cowering, helpless, or stunned studied target as a standard action"
    },
    "Mirror Move": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": "Combat Expertise",
        "BAB": 4
        },
        "benefit": "If you are the only character threatening an opponent and that opponent uses a combat feat, you can take an immediate action to gain the benefit of that feat until the end of your next turn. You must meet all the feat’s prerequisites. If a feat has a daily use limitation, any uses of that feat while you’re using Mirror Move count toward that feat’s daily limit. You can use Mirror Move 1/day for every 4 levels you have attained."
    },
    "Misdirection Tactics": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": "Combat Expertise",
        "Skill": {
            "Bluff": 4
        },
        "Special": "Deceitful"
        },
        "benefit": "While using total defense, use Bluff to negate a hit"
    },
    "Misdirection Attack": {
        "prerequisites": {
        "Feat": [
            "Misdirection Redirection",
            "Misdirection Tactics"
        ]
        },
        "benefit": "When using Misdirection Tactics, attacker provokes an attack of opportunity"
    },
    "Missile Shield": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": "Shield Focus"
        },
        "benefit": "Deflect one ranged attack per round with shield"
    },
    "Mobility": {
        "prerequisites": {
        "Feat": "Dodge"
        },
        "benefit": "+4 AC against attacks of opportunity from movement"
    },
    "Mobile Bulwark Style": {
        "prerequisites": {
        "Stat": {
            "STR": 13
        },
        "Feat": [
            "Shield Focus",
            "Tower Shield Proficiency"
        ],
        "BAB": 1
        },
        "benefit": "While using a tower shield, add the shield’s bonus to AC (including its enhancement bonus) to your CMD against bull rush and overrun combat maneuvers. You can use a tower shield to grant you total cover along one edge of your space as a move action."
    },
    "Mobile Fortress": {
        "prerequisites": {
        "Stat": {
            "STR": 15
        },
        "Feat": [
            "Mobile Bulwark Style",
            "Shield Focus",
            "Tower Shield Proficiency"
        ],
        "BAB": 4
        },
        "benefit": "While using a tower shield, add half of the shield’s bonus to AC (including its enhancement bonus) to your touch AC and take only a –1 penalty on attack rolls because of the shield’s encumbrance. Also, when you use a tower shield to gain total cover, any adjacent ally gains total cover against attacks passing through the selected edge of your space."
    },
    "Mobile Stronghold": {
        "prerequisites": {
        "Stat": {
            "STR": 17
        },
        "Feat": [
            "Mobile Bulwark Style",
            "Mobile Fortress",
            "Shield Focus",
            "Tower Shield Proficiency"
        ],
        "BAB": 7
        },
        "benefit": "While using a tower shield, you do not suffer a penalty on attack rolls because of its encumbrance. Also, when you use a tower shield to gain total cover, you gain partial cover (and grant partial cover to adjacent allies) against spells passing through the selected edge of your space. In addition, you can gain total cover against a single attack as an immediate or swift action."
    },
    "Monastic Legacy": {
        "prerequisites": {
        "Feat": "Improved Unarmed Strike",
        "Special": "still mind class feature"
        },
        "benefit": "Count half your non-monk levels as monk levels for unarmed strike damage"
    },
    "Monkey Lunge": {
        "prerequisites": {
        "Feat": "Lunge",
        "Skill": {
            "Acrobatics": 1
        }
        },
        "benefit": "Use Lunge without suffering a penalty to AC."
    },
    "Moonlight Stalker": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": [
            "Blind-Fight",
            "Combat Expertise"
        ],
        "Skill": {
            "Bluff": 3
        },
        "Special": "darkvision or low-light vision racial trait"
        },
        "benefit": "Gain +2 attack and damage against an opponent you have concealment from."
    },
    "Moonlight Stalker Feint": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": [
            "Blind-Fight",
            "Combat Expertise",
            "Moonlight Stalker"
        ],
        "Skill": {
            "Bluff": 6
        },
        "Special": "darkvision or low-light vision racial trait"
        },
        "benefit": "Make a Bluff check to feint with concealment versus a foe."
    },
    "Moonlight Stalker Master": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": [
            "Blind-Fight",
            "Combat Expertise",
            "Improved Feint",
            "Moonlight Stalker",
            "Moonlight Stalker Feint"
        ],
        "Skill": {
            "Bluff": 9
        },
        "Special": "darkvision or low-light vision racial trait"
        },
        "benefit": "While concealed, your miss chance increases by 10%."
    },
    "Mounted Archery": {
        "prerequisites": {
        "Feat": "Mounted Combat"
        },
        "benefit": "Halve the penalty for ranged attacks while mounted."
    },
    "Mounted Combat": {
        "prerequisites": {
        "Skill": {
            "Ride": 1
        }
        },
        "benefit": "Avoid attacks on mount with a Ride check."
    },
    "Mounted Onslaught": {
        "prerequisites": {
        "Feat": [
            "Mounted Combat",
            "Trample"
        ],
        "Skill": {
            "Ride": 5
        }
        },
        "benefit": "You may overrun more than one creature."
    },
    "Natural Jouster": {
        "prerequisites": {
        "Race": "Centaur or other tauric creature"
        },
        "benefit": "You are treated as mounted for use of the lance"
    },
    "Nature’s Weapons": {
        "prerequisites": {
        "Feat": "Catch Off-Guard",
        "BAB": 2,
        "Prerequisite Options": {
            "or": [
            {
                "Skill": {
                "Knowledge (nature)": 2
                }
            },
            {
                "Skill": {
                "Survival": 2
                }
            }
            ]
        }
        },
        "benefit": "Wield improvised weapons you find in the wild so that they do more damage than normal"
    },
    "Net Adept": {
        "prerequisites": {
        "Feat": "Exotic Weapon Proficiency (net)",
        "BAB": 1
        },
        "benefit": "May treat a net as a one-handed weapon"
    },
    "Net and Trident": {
        "prerequisites": {
        "Stat": {
            "DEX": 15
        },
        "Feat": [
            "Net Adept",
            "Two-Weapon Fighting"
        ]
        },
        "benefit": "May wield a one-handed or light weapon with a net"
    },
    "Net Maneuvering": {
        "prerequisites": {
        "Feat": "Net Adept",
        "BAB": 3
        },
        "benefit": "May use a net to trip or disarm"
    },
    "Net Trickery": {
        "prerequisites": {
        "Feat": [
            "Net Adept",
            "Net Maneuvering"
        ],
        "BAB": 6
        },
        "benefit": "May use a net to blind your opponent"
    },
    "Nightmare Fist": {
        "prerequisites": {
        "Feat": "Improved Unarmed Strike",
        "Skill": {
            "Intimidate": 1
        },
        "Special": "ability to create magical darkness"
        },
        "benefit": "While fighting in magical darkness, you deal +2 damage"
    },
    "Nightmare Weaver": {
        "prerequisites": {
        "Feat": "Nightmare Fist",
        "Skill": {
            "Intimidate": 2
        }
        },
        "benefit": "Can demoralize foes while casting darkness."
    },
    "Nightmare Striker": {
        "prerequisites": {
        "Feat": [
            "Nightmare Weaver",
            "Stunning Fist"
        ],
        "Skill": {
            "Heal": 5
        },
        "Special": "ability to cast faerie fire"
        },
        "benefit": "While opponent is under the effects of faerie fire, your DC for Stunning Fist increases by 2"
    },
    "Nimble Striker": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "BAB": 1,
        "Race": "Catfolk",
        "Special": "sprinter racial trait"
        },
        "benefit": "You do not take a –2 penalty to AC when you use the Cleave feat, Lunge feat, or when you charge."
    },
    "Notorious Vigilante": {
        "prerequisites": {
        "Feat": [
            "Dazzling Display",
            "Weapon Focus"
        ],
        "Alignment": "nongood",
        "Special": "great renown social talent; proficiency with chosen weapon"
        },
        "benefit": "Use Dazzling Display as a standard action based on your reputation alone"
    },
    "Open Up": {
        "prerequisites": {
        "Stat": { "INT": 13 },
        "Feat": "Combat Expertise"
        },
        "benefit": "When you successfully use the aid another action to improve the next attack roll against an opponent by an ally who also has this feat, that attack also ignores any Armor Class bonus granted by the opponent’s shield. This benefit affects only physical shields, not shield bonuses from spells or other sources."
    },
    "Opening Volley": {
        "prerequisites": {},
        "benefit": "Successful ranged attack grants +4 on next melee attack roll"
    },
    "Orc Fury Style": {
        "prerequisites": {
        "Feat": [ "Bullying Blow", "Intimidating Prowess" ],
        "Skill": { "Intimidate": 3 },
        "Special": "weapon familiarity racial trait"
        },
        "benefit": "May use Bullying Blow as part of a full attack"
    },
    "Orc Hewer": {
        "prerequisites": {
        "Stat": { "STR": 13 },
        "Feat": [ "Cleave", "Goblin Cleaver", "Power Attack" ],
        "Race": "Dwarf"
        },
        "benefit": "As Goblin Cleaver, but your additional attacks can be made against creatures your size or smaller. In addition, any such attacks that you make against humanoids (orc) gain a +2 circumstance bonus on attack rolls."
    },
    "Orc Weapon Expertise": {
        "prerequisites": {
        "BAB": 1,
        "Race": "Orc"
        },
        "benefit": "Whenever you wield a weapon that has “orc” in its name, you gain special benefits."
    },
    "Ostentatious Rager": {
        "prerequisites": {
        "Skill": { "Bluff": 1 },
        "Special": "rage class feature",
        "Race": "Gnome"
        },
        "benefit": "Use the Bluff skill to feint while raging."
    },
    "Osyluth Guile": {
        "prerequisites": {
        "Skill": { "Bluff": 8 },
        "Feat": "Dodge"
        },
        "benefit": "Get a bonus to your AC equal to Charisma modifier against one opponent."
    },
    "Outflank": {
        "prerequisites": {
        "BAB": 4
        },
        "benefit": "Double flanking bonuses with an ally"
    },
    "Outslug Style": {
        "prerequisites": {
        "Stat": { "DEX": 13 },
        "Prerequisite Options": {
            "or": [
            { "Feat": "Fencing Grace" },
            { "Feat": "Slashing Grace" },
            { "Feat": "Starry Grace" }
            ]
        },
        "Feat": [ "Two-Weapon Fighting", "Weapon Finesse" ]
        },
        "benefit": "You can gain the benefit of the Fencing Grace, Slashing Grace, or Starry Grace feats while fighting with two weapons. Your penalties from two-weapon fighting increase by 2 on all attack rolls you make when doing so, and you can’t decrease the penalties to less than –2 even if other abilities would reduce the penalties further. Add 1/2 your Dexterity bonus to damage with your off-hand weapon instead of 1/2 your Strength modifier. If you attack without using your off-hand weapon, you can use the aforementioned feats despite your other hand being occupied. In addition, Two-Weapon Grace counts as Double Slice for the purposes of qualifying for the Two-Weapon Rend feat."
    },
    "Outslug Weave": {
        "prerequisites": {
        "Stat": { "DEX": 13 },
        "Prerequisite Options": {
            "or": [
            { "Feat": "Fencing Grace" },
            { "Feat": "Slashing Grace" },
            { "Feat": "Starry Grace" }
            ]
        },
        "Feat": [ "Two-Weapon Fighting", "Outslug Style", "Weapon Focus (with chosen weapon)" ]
        },
        "benefit": "While using Outslug Style, you don’t take a –2 penalty to your AC when using the Lunge feat. The bonuses to AC and on weapon damage rolls that you gain from Outslug Style increase to +2."
    },
    "Outslug Sprint": {
        "prerequisites": {
        "Stat": { "DEX": 13 },
        "Prerequisite Options": {
            "or": [
            { "Feat": "Fencing Grace" },
            { "Feat": "Slashing Grace" },
            { "Feat": "Starry Grace" }
            ]
        },
        "Feat": [ "Two-Weapon Fighting", "Outslug Style", "Outslug Weave", "Weapon Focus (with chosen weapon)" ]
        },
        "benefit": "While using Outslug Style, you can move an additional 5 feet when making a 5-foot step."
    },
    "Overwatch Style": {
        "prerequisites": {
        "Feat": [ "Precise Shot", "Rapid Shot", "Weapon Focus (with chosen weapon)" ]
        },
        "benefit": "Ready two attacks with the chosen weapon as a full-round action."
    },
    "Overwatch Tactician": {
        "prerequisites": {
        "Feat": [ "Overwatch Style", "Precise Shot", "Rapid Shot", "Weapon Focus (with chosen weapon)" ]
        },
        "benefit": "Ready two attacks as a standard action instead of a full-round action."
    },
    "Overwatch Vortex": {
        "prerequisites": {
        "Feat": [ "Overwatch Style", "Overwatch Tactician", "Precise Shot", "Rapid Shot", "Weapon Focus (with chosen weapon)" ],
        "BAB": 11
        },
        "benefit": "Ready up to four attacks as a full-round action."
    },
    "Overrun, Improved": {
        "prerequisites": {
        "Feat": "Power Attack"
        },
        "benefit": "+2 bonus on overrun attempts, no AOO"
    },
    "Overrun, Greater": {
        "prerequisites": {
        "Feat": "Improved Overrun",
        "BAB": 6
        },
        "benefit": "Enemies you overrun provoke attacks of opportunity"
    },
    "Owl Style": {
        "prerequisites": {
        "Stat": { "DEX": 13 },
        "Feat": "Skill Focus (Stealth)",
        "Skill": { "Stealth": 1 }
        },
        "benefit": "Use Stealth with martial training and charge with Stealth"
    },
    "Owl Swoop": {
        "prerequisites": {
        "Stat": { "DEX": 15 },
        "Feat": "Owl Style",
        "Skill": { "Acrobatics": 1 }
        },
        "benefit": "Use Acrobatics with martial training and while charging"
    },
    "Owl Dive": {
        "prerequisites": {
        "Stat": { "DEX": 17 },
        "Feat": [ "Owl Style", "Owl Swoop" ],
        "Prerequisite Options": {
            "or": [
            { "BAB": 7 },
            { "Class": { "monk": 5 } }
            ]
        },
        "Skill": { "Fly": 1 }
        },
        "benefit": "Use Fly with martial training and charge through any creature"
    },
    "Pack Intimidation": {
        "prerequisites": {
        "Race": "Half-orc",
        "Special": "intimidating racial trait"
        },
        "benefit": "When you use Intimidate to demoralize, gain a +2 circumstance bonus for every ally with this feat within 30 feet"
    },
    "Paired Opportunists": {
        "prerequisites": {},
        "benefit": "Whenever you are adjacent to an ally who also has this feat, you receive a +4 circumstance bonus on attacks of opportunity against creatures that you both threaten. Enemies that provoke attacks of opportunity from your ally also provoke attacks of opportunity from you so long as you threaten them (even if the situation or an ability would normally deny you the AOO). This does not allow you to take more than one AOO against a creature for a given action."
    },
    "Paralyzing Strike": {
        "prerequisites": {
        "Stat": {
            "DEX": 13,
            "WIS": 13
        },
        "Feat": "Improved Unarmed Strike",
        "BAB": 14
        },
        "benefit": "Paralyze with unarmed strikes"
    },
    "Parting Shot": {
        "prerequisites": {
        "Feat": "Shot on the Run",
        "BAB": 6
        },
        "benefit": "Make a ranged attack when withdrawing"
    },
    "Passing Trick": {
        "prerequisites": {
        "Feat": [
            "Improved Feint",
            "Mobility"
        ],
        "Size": "Small or smaller"
        },
        "benefit": "Successful Acrobatics check allows you to feint"
    },
    "Penetrating Strike": {
        "prerequisites": {
        "Feat": "Weapon Focus",
        "Class": {
            "fighter": 12
        }
        },
        "benefit": "Your attacks ignore 5 points of damage reduction"
    },
    "Penetrating Strike, Greater": {
        "prerequisites": {
        "Feat": "Penetrating Strike",
        "Class": {
            "fighter": 16
        }
        },
        "benefit": "Your attacks ignore 10 points of damage reduction"
    },
    "Perfect Strike": {
        "prerequisites": {
        "Stat": {
            "DEX": 13,
            "WIS": 13
        },
        "Feat": "Improved Unarmed Strike",
        "BAB": 8
        },
        "benefit": "Roll twice for unarmed strikes and take the better roll"
    },
    "Performance Weapon Mastery": {
        "prerequisites": {},
        "benefit": "All weapons you are proficient with act as if they had the performance quality"
    },
    "Performing Combatant": {
        "prerequisites": {
        "Feat": [
            "Dazzling Display",
            "Performance feat"
        ]
        },
        "benefit": "Can make combat performance checks in any combat"
    },
    "Phalanx Formation": {
        "prerequisites": {
        "BAB": 1
        },
        "benefit": "When you wield a reach weapon with which you are proficient, allies don’t provide soft cover to opponents you attack with reach."
    },
    "Piercing Grapple": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": [
            "Improved Grapple",
            "Improved Unarmed Strike",
            "Quick Draw"
        ],
        "Skill": {
            "Intimidate": 7
        }
        },
        "benefit": "Impale a foe while grappling"
    },
    "Pinpoint Targeting": {
        "prerequisites": {
        "Feat": "Improved Precise Shot",
        "BAB": 16
        },
        "benefit": "No armor or shield bonus on one ranged attack"
    },
    "Pin Down": {
        "prerequisites": {
        "Feat": "Combat Reflexes",
        "Class": {
            "fighter": 11
        }
        },
        "benefit": "Opponents that take a 5-foot step or withdraw provoke attacks of opportunity from you"
    },
    "Pinning Knockout": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": "Greater Grapple",
        "Prerequisite Options": {
            "or": [
            { "BAB": 9 },
            { "Class": { "monk": 9 } }
            ]
        }
        },
        "benefit": "Against a pinned opponent, you may double nonlethal damage with grapple check"
    },
    "Pinning Rend": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": [
            "Greater Grapple",
            "Improved Grapple",
            "Improved Unarmed Strike"
        ],
        "Prerequisite Options": {
            "or": [
            { "BAB": 9 },
            { "Class": { "monk": 9 } }
            ]
        }
        },
        "benefit": "Against a pinned opponent, you may deal bleed damage with Grapple check"
    },
    "Piranha Strike": {
        "prerequisites": {
        "Feat": "Weapon Finesse",
        "BAB": 1
        },
        "benefit": "Gain Power Attack with light weapons."
    },
    "Point-Blank Master": {
        "prerequisites": {
        "Feat": "Weapon Specialization",
        "Weapon Type": "ranged"
        },
        "benefit": "Do not provoke attacks of opportunity while firing one ranged weapon."
    },
    "Point-Blank Master (Alternate)": {
        "prerequisites": {
        "Feat": "Weapon Specialization",
        "Special": "selected ranged weapon"
        },
        "benefit": "You do not provoke attacks of opportunity when firing a pre-chosen ranged weapon while threatened."
    },
    "Point-Blank Shot": {
        "prerequisites": {},
        "benefit": "+1 attack and damage on targets within 30 feet."
    },
    "Power Attack": {
        "prerequisites": {
        "Stat": {
            "STR": 13
        },
        "BAB": 1
        },
        "benefit": "Trade melee attack bonus for damage."
    },
    "Precise Shot": {
        "prerequisites": {
        "Feat": "Point-Blank Shot"
        },
        "benefit": "No penalty for shooting into melee."
    },
    "Precise Shot, Improved": {
        "prerequisites": {
        "Stat": {
            "DEX": 19
        },
        "Feat": "Precise Shot",
        "BAB": 11
        },
        "benefit": "No cover or concealment chance on ranged attacks."
    },
    "Precise Strike": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "BAB": 1
        },
        "benefit": "Deal +1d6 points of precision damage with melee attacks."
    },
    "Primal Strike": {
        "prerequisites": {
        "Stat": {
            "WIS": 17
        },
        "Feat": "Improved Unarmed Strike",
        "BAB": 8
        },
        "benefit": "You have learned to draw primal magic through your body to befuddle your enemies."
    },
    "Press to the Wall": {
        "prerequisites": {
        "Feat": [
            "Combat Reflexes",
            "Stand Still"
        ]
        },
        "benefit": "If you prevent an opponent from moving via Stand Still, you may disarm or trip the target as an immediate action."
    },
    "Prone Shooter": {
        "prerequisites": {
        "Feat": "Weapon Focus",
        "Weapon": "crossbow or firearm",
        "BAB": 1
        },
        "benefit": "Take a reduced penalty to your AC against melee attacks while prone."
    },
    "Prone Slinger": {
        "prerequisites": {},
        "benefit": "May use a sling while prone."
    },
    "Pummeling Style": {
        "prerequisites": {
        "Feat": "Improved Unarmed Strike",
        "BAB": 6,
        "Prerequisite Options": {
            "or": [
            { "Class Feature": "brawler's flurry" },
            { "Class Feature": "flurry of blows" }
            ]
        }
        },
        "benefit": "Combine your unarmed strikes together."
    },
    "Pummeling Bully": {
        "prerequisites": {
        "Feat": [
            "Improved Reposition",
            "Improved Trip",
            "Pummeling Style"
        ],
        "BAB": 9,
        "Prerequisite Options": {
            "or": [
            { "Class": { "brawler": 5 } },
            { "Class": { "monk": 5 } }
            ]
        }
        },
        "benefit": "When using Pummeling Style, attempt a reposition or trip combat maneuver as a free action."
    },
    "Pummeling Charge": {
        "prerequisites": {
        "Feat": "Pummeling Style",
        "BAB": 12,
        "Prerequisite Options": {
            "or": [
            { "Class": { "brawler": 8 } },
            { "Class": { "monk": 8 } }
            ]
        }
        },
        "benefit": "Pummel after a charge."
    },
    "Punch Through": {
        "prerequisites": {
        "BAB": 6
        },
        "benefit": "As a full-round action, you may make a single attack against a target. If the attack hits and deals damage to the target, all of your allies with this feat ignore up to 5 points of damage reduction against the same target for 1 round. This feat does not apply to damage reduction without a type (such as DR 10/—)."
    },
    "Punishing Kick": {
        "prerequisites": {
        "Stat": {
            "CON": 13,
            "WIS": 13
        },
        "Feat": "Improved Unarmed Strike",
        "BAB": 8
        },
        "benefit": "Knock down or push back foes with unarmed strikes."
    },
    "Pursuit of Glory": {
        "prerequisites": {
        "Race": "Human"
        },
        "benefit": "Gain a +2 morale bonus on one attack roll made as part of a charge if you start or end the charge adjacent to an ally."
    },
    "Pushing Assault": {
        "prerequisites": {
        "Stat": { "STR": 15 },
        "Feat": "Power Attack",
        "BAB": 1
        },
        "benefit": "Push a foe back with a two-handed weapon."
    },
    "Quah Bond": {
        "prerequisites": {
        "Feat": "Totem Spirit",
        "Race": "Human"
        },
        "benefit": "Double benefits granted by your Totem Spirit feat when an ally from the same quah with this feat is within 30 feet"
    },
    "Quarterstaff Master": {
        "prerequisites": {
        "Feat": "Weapon Focus (quarterstaff)",
        "BAB": 5
        },
        "benefit": "Use a quarterstaff one-handed."
    },
    "Quick Bull Rush": {
        "prerequisites": {
        "Feat": "Improved Bull Rush",
        "BAB": 6
        },
        "benefit": "May bull rush in place of one of your melee attacks."
    },
    "Quick Dirty Trick": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Feat": [
            "Combat Expertise",
            "Improved Dirty Trick"
        ],
        "BAB": 6
        },
        "benefit": "May perform a dirty trick in place of one of your melee attacks."
    },
    "Quick Drag": {
        "prerequisites": {
        "Feat": "Improved Drag",
        "BAB": 6
        },
        "benefit": "May perform a drag maneuver in place of one of your melee attacks."
    },
    "Quick Draw": {
        "prerequisites": {
        "BAB": 1
        },
        "benefit": "Draw weapon as a free action."
    },
    "Quick Reposition": {
        "prerequisites": {
        "Feat": "Improved Reposition",
        "BAB": 6
        },
        "benefit": "May reposition in place of one of your melee attacks."
    },
    "Quick Steal": {
        "prerequisites": {
        "Feat": "Improved Steal",
        "BAB": 6
        },
        "benefit": "May steal in place of one of your melee attacks."
    },
    "Quick Stow": {
        "prerequisites": {
        "Feat": "Quick Draw",
        "BAB": 1
        },
        "benefit": "You do not provoke an attack of opportunity when sheathing a weapon, and you can combine a move action to sheathe a weapon with a regular move action. (You can both stow and draw a weapon as part of the same move action in this way.) If you have the Two-Weapon Fighting feat, you can sheathe two light or one-handed weapons in the time it would normally take to sheathe one."
    },
    "Quick Study": {
        "prerequisites": {
        "Stat": {
            "INT": 13
        },
        "Special": "bravery +3",
        "Class": {
            "fighter": 10
        }
        },
        "benefit": "Study with an ally to learn a combat feat"
    },
    "Quiet Death": {
        "prerequisites": {
        "Stat": {
            "DEX": 19
        },
        "Skill": {
            "Stealth": 10
        },
        "Class": {
            "rogue": 10
        }
        },
        "benefit": "Drop your foes before they make a sound"
    },
    "Quivering Palm Adept": {
        "prerequisites": {
        "Class Feature": "Quivering palm"
        },
        "benefit": "Add +2 to the saving throw DC against your quivering palm attacks."
    },
    "Quivering Palm Versatility": {
        "prerequisites": {
        "Class Feature": "Quivering palm",
        "BAB": 13
        },
        "benefit": "You can cause either coma, memory loss, or great pain (chosen before the quivering palm’s attack roll is made) to an opponent instead of killing it when you affect it with your quivering palm, as long as you do so within a number of days equal to your monk level."
    },
    "Ranged Disarm": {
        "prerequisites": {
        "Stat": { "DEX": 13 },
        "Feat": "Deadly Aim",
        "BAB": 1
        },
        "benefit": "As a full-round action, you can attempt a disarm combat maneuver with any ranged weapon at a –2 penalty."
    },
    "Ranged Feint": {
        "prerequisites": {
        "BAB": 2,
        "Skill": { "Bluff": 3 }
        },
        "benefit": "Feint with a ranged weapon"
    },
    "Ranged Trip": {
        "prerequisites": {
        "Stat": { "DEX": 13 },
        "Feat": "Deadly Aim",
        "BAB": 1
        },
        "benefit": "As a full-round action, you can attempt a trip combat maneuver with any ranged weapon at a –2 penalty."
    },
    "Rapid Grappler": {
        "prerequisites": {
        "Stat": { "DEX": 13 },
        "Feat": [
            "Greater Grapple",
            "Improved Grapple",
            "Improved Unarmed Strike"
        ],
        "Prerequisite Options": {
            "or": [
            { "BAB": 9 },
            { "Class": { "monk": 9 } }
            ]
        }
        },
        "benefit": "Spend a swift action to make a combat maneuver check to grapple while using Greater Grapple."
    },
    "Rapid Reload": {
        "prerequisites": {
        "Special": "Weapon Proficiency (crossbow) or Exotic Weapon Proficiency (firearms)"
        },
        "benefit": "Reload your weapon quickly."
    },
    "Rapid Shot": {
        "prerequisites": {
        "Stat": { "DEX": 13 },
        "Feat": "Point-Blank Shot"
        },
        "benefit": "Make one extra ranged attack."
    },
    "Rat Catcher": {
        "prerequisites": {
        "Skill": { "Knowledge (dungeoneering)": 1 },
        "BAB": 1
        },
        "benefit": "You gain a +1 dodge bonus against attacks made by creatures at least two size categories smaller than you, and gain a +1 bonus to attack and damage rolls against such creatures. Additionally, you take only half damage from swarm attacks, and as a full-round action can make a single attack with a natural or bludgeoning weapon against an adjacent swarm. If the attack hits, you deal half damage to the target, even if the swarm is small enough to normally be immune to such attacks."
    },
    "Ray Shield": {
        "prerequisites": {
        "Stat": { "DEX": 15 },
        "Feat": "Shield Focus",
        "Feat2": "Spellbreaker"
        },
        "benefit": "Deflect one ranged touch attack per round with shield."
    },
    "Ready for Anything": {
        "prerequisites": {
        "Feat": [
            "Alertness",
            "Improved Initiative",
            "Lightning Reflexes",
            "Quick Draw"
        ],
        "Prerequisite Options": {
            "or": [
            { "BAB": 6 },
            { "Class Feature": "uncanny dodge" }
            ]
        }
        },
        "benefit": "Always act on the surprise round"
    },
    "Rebounding Leap": {
        "prerequisites": {
        "Skill": { "Acrobatics": 5 },
        "Skill2": { "Ride": 11 },
        "Class Feature": "leaping lance"
        },
        "benefit": "Remount your steed as a swift action with a successful Acrobatics check."
    },
    "Rebuffing Reduction": {
        "prerequisites": {
        "Special": "Damage reduction",
        "Feat": "Improved Bull Rush"
        },
        "benefit": "Bull Rush an opponent who fails to pierce your DR."
    },
    "Reckless Aim": {
        "prerequisites": {
        "Feat": [
            "Point-Blank Shot",
            "Precise Shot"
        ]
        },
        "benefit": "Take a –1 penalty to AC and gain a +2 competence bonus on attack roll with a ranged attack against an opponent engaged in melee. If you roll a natural 1 on the attack, you hit a random adjacent creature instead."
    },
    "Redirect Attack": {
        "prerequisites": {
        "Stat": { "DEX": 15, "INT": 15 },
        "Feat": "Dodge"
        },
        "benefit": "Once per turn, when an opponent only you threaten fails an attack against you, you can redirect the attack to target another foe. The new target must be adjacent to you and within reach of the opponent that missed you. Attempt a combat maneuver check; if the result exceeds both the Combat Maneuver Defense of the opponent who missed you and the Armor Class of the new target, the attack strikes and deals its normal damage."
    },
    "Relentless Shot": {
        "prerequisites": {
        "Feat": "Point-Blank Shot",
        "BAB": 6
        },
        "benefit": "When you trip an opponent within 30 feet with a ranged attack, you also threaten that opponent until your next turn and you can make attacks of opportunity against that opponent with ranged weapons."
    },
    "Relic Breaker": {
        "prerequisites": {
        "Stat": { "STR": 13 },
        "Feat": [
            "Gate Breaker",
            "Improved Sunder",
            "Power Attack"
        ],
        "BAB": 1
        },
        "benefit": "Whenever you sunder a held object, its bearer must succeed at a Reflex save or the bearer catches on fire (taking 1d6 points of fire damage immediately, and additional 1d6 points each subsequent round until a successful Reflex save is made). Damage increases with your total Hit Dice."
    },
    "Rending Claws": {
        "prerequisites": {
        "Stat": { "STR": 13 },
        "Special": "two claw attacks",
        "BAB": 6
        },
        "benefit": "Deal 1d6 extra damage if both claws hit."
    },
    "Rending Fury": {
        "prerequisites": {
        "Special": "Rend special attack",
        "BAB": 6
        },
        "benefit": "Require only half the normal number of attacks to deal rend damage."
    },
    "Improved Rending Fury": {
        "prerequisites": {
        "Feat": "Rending Fury",
        "BAB": 9
        },
        "benefit": "Deal extra damage on a successful rend."
    },
    "Greater Rending Fury": {
        "prerequisites": {
        "Feat": "Improved Rending Fury",
        "BAB": 12
        },
        "benefit": "When you rend an opponent, you deal bleed damage."
    },
    "Reposition, Improved": {
        "prerequisites": {
        "Feat": "Combat Expertise"
        },
        "benefit": "+2 bonus on reposition attempts, and no attacks of opportunity are provoked."
    },
    "Reposition, Greater": {
        "prerequisites": {
        "Feat": "Improved Reposition",
        "BAB": 6
        },
        "benefit": "Enemies you reposition provoke attacks of opportunity."
    },
    "Repositioning Strike": {
        "prerequisites": {
        "Feat": "Improved Reposition",
        "BAB": 9
        },
        "benefit": "Attempt a reposition attack on a successful critical hit."
    },
    "Reposition, Tactical": {
        "prerequisites": {
        "Stat": { "INT": 13 },
        "Feat": "Improved Reposition"
        },
        "benefit": "You can reposition a foe into a dangerous space such as a pit or blade barrier."
    },
    "Returning Throw": {
        "prerequisites": {
        "Feat": "Point-Blank Shot",
        "Skill": { "Sleight Of Hand": 3 },
        "Special": "goblinoid subtype"
        },
        "benefit": "When an ally misses with a thrown weapon attack, you can catch the weapon and use it to attack the original target."
    },
    "Revelation Strike": {
        "prerequisites": {
        "Feat": "Improved Unarmed Strike",
        "Class Feature": "Revelation"
        },
        "benefit": "Affect an opponent with revelation as part of a melee attack."
    },
    "Reverse-Feint": {
        "prerequisites": {
        "Feat": "Toughness",
        "BAB": 1,
        "Race": "Orc"
        },
        "benefit": "As a move action, you can leave a gap in your defenses for one adjacent opponent to use. If that opponent attacks you on its next turn, it gains a +4 bonus on its attack roll. Regardless of whether the opponent hits, you may then make an immediate melee attack against it with a +2 bonus."
    },
    "Rhino Charge": {
        "prerequisites": {
        "Feat": [
            "Power Attack",
            "Improved Bull Rush"
        ],
        "BAB": 5
        },
        "benefit": "Learn to ready a charge attack."
    },
    "Ride-By Attack": {
        "prerequisites": {
        "Feat": "Mounted Combat"
        },
        "benefit": "Move before and after a charge attack while mounted."
    },
    "Riptide Attack": {
        "prerequisites": {
        "Feat": [
            "Improved Drag",
            "Improved Trip"
        ]
        },
        "benefit": "You may automatically drag a tripped target as a swift action."
    },
    "Risky Striker": {
        "prerequisites": {
        "BAB": 1,
        "Race": "Halfling"
        },
        "benefit": "You can choose to take a –1 penalty to AC to gain a +2 bonus on melee damage rolls against creatures two or more size categories larger than you. The bonus increases by 2 at BAB +4 and every four levels thereafter. The bonus damage is multiplied on a critical hit. This effect lasts until your next turn."
    },
    "River Raider": {
        "prerequisites": {},
        "benefit": "+2 bonus on Swim and Stealth checks in non-stormy water, and you can take more actions than normal in surprise rounds when in water."
    },
    "Riving Strike": {
        "prerequisites": {
        "Feat": "Arcane Strike"
        },
        "benefit": "Those damaged by your Arcane Strike take a penalty on saves against spells and spell-like abilities."
    },
    "Roll with It": {
        "prerequisites": {},
        "benefit": "When you are hit by an attack, you may roll a Reflex save to reduce the damage by 1d6."
    },
    "Rubble Skirmisher": {
        "prerequisites": {
        "Stat": { "DEX": 13 },
        "Feat": "Nimble Moves",
        "BAB": 2
        },
        "benefit": "Gain a +2 bonus on combat maneuver checks and CMD when in naturally occurring difficult terrain."
    },
    "Runic Charge": {
        "prerequisites": {
        "CL": 5
        },
        "benefit": "You can deliver touch spells with frightful ferocity."
    },
    "Ruthless Opportunist": {
        "prerequisites": {
        "Race": "Human"
        },
        "benefit": "When an ally with this feat hits a foe using an attack of opportunity, you gain +2 on attacks against that foe for 1 round."
    },
    "Sabotaging Sunder": {
        "prerequisites": {
        "Stat": {"STR": 13},
        "Feat": ["Improved Sunder", "Power Attack"],
        "Skill": {"Disable Device": 7}
        },
        "benefit": "Break objects through sabotage rather than force"
    },
    "Saddle Shrieker": {
        "prerequisites": {
        "Race": "Goblin",
        "Skill": {"Ride": 1}
        },
        "benefit": "Take a -1 penalty to attacks and CMB checks to give your mount a +1 bonus to attack and damage rolls with its natural weapons."
    },
    "Sap Adept": {
        "prerequisites": {
        "Special": "Sneak attack +1d6"
        },
        "benefit": "Gain bonus damage on nonlethal attacks."
    },
    "Sap Master": {
        "prerequisites": {
        "Feat": "Sap Adept",
        "Special": "sneak attack +3d6"
        },
        "benefit": "Deal twice your sneak attack damage when dealing nonlethal damage."
    },
    "Saving Shield": {
        "prerequisites": {
        "Feat": "Shield Proficiency"
        },
        "benefit": "Grant shield bonus to an adjacent ally."
    },
    "School Strike": {
        "prerequisites": {
        "Feat": "Improved Unarmed Strike",
        "Special": "wizard school class feature"
        },
        "benefit": "May deliver magic school effect as swift action after melee attack."
    },
    "Scorching Weapons": {
        "prerequisites": {
        "Race": "Ifrit"
        },
        "benefit": "You gain a +2 bonus on saving throws against fire attacks and spells with the fire descriptor or light descriptor. As a swift action, you can make up to two held manufactured metallic weapons become red-hot for 1 round, dealing 1 additional point of fire damage with a successful hit. This does not stack with other effects that add fire damage to weapons, such as the flaming weapon special ability."
    },
    "Scorpion Style": {
        "prerequisites": {
        "Feat": "Improved Unarmed Strike"
        },
        "benefit": "Reduce target’s speed to 5ft."
    },
    "Gorgon’s Fist": {
        "prerequisites": {
        "Feat": "Scorpion Style",
        "BAB": 6
        },
        "benefit": "Stagger a foe whose speed is reduced"
    },
    "Sea Hunter": {
        "prerequisites": {
        "Feat": "Combat Expertise",
        "Race": "merfolk"
        },
        "benefit": "When you make a successful melee attack against a swimming target, as a free action you can attempt to knock the target off balance. Treat this as a trip combat maneuver. If you succeed, the target is considered off balance (see Table: Combat Adjustments Underwater) until it recovers its balance, usually by making a Swim check on its turn. This feat has no effect on creatures with a swim speed, those using magic such as freedom of movement, and creatures that can’t be tripped."
    },
    "Second Chance": {
        "prerequisites": {
        "Feat": "Combat Expertise",
        "BAB": 6
        },
        "benefit": "Exchange later attacks to reroll missed first attack."
    },
    "Second Chance, Improved": {
        "prerequisites": {
        "Feat": "Second Chance",
        "BAB": 11
        },
        "benefit": "Take a –5 penalty on later attacks to reroll missed attack."
    },
    "Second Wind": {
        "prerequisites": {
        "Feat": "Endurance"
        },
        "benefit": "When you spend a swift action to attempt a performance combat check, you gain a +2 bonus on your performance combat check, and if you are shaken, sickened, or fatigued, these conditions are suppressed until the end of your next turn."
    },
    "Seething Hatred": {
        "prerequisites": {
        "Special": "Studied target class feature"
        },
        "benefit": "Select a favored enemy and gain greater benefits when such a creature is your studied target."
    },
    "Seize Advantage": {
        "prerequisites": {
        "Feat": "Opportune parry and riposte deed"
        },
        "benefit": "Add foe’s Power Attack damage to your riposte."
    },
    "Serpent Lash": {
        "prerequisites": {
        "Feat": "Weapon Finesse",
        "Proficiency": "whip"
        },
        "benefit": "Learn new combat techniques for the whip."
    },
    "Shadow Strike": {
        "prerequisites": {
        "BAB": 1
        },
        "benefit": "Deal precision damage against targets with concealment."
    },
    "Shadows of Fear": {
        "prerequisites": {
        "Special": "Hidden strike +2d8 or sneak attack +2d6"
        },
        "benefit": "Flank a scared creature once per round"
    },
    "Sharpclaw": {
        "prerequisites": {
        "Race": "Ratfolk"
        },
        "benefit": "You gain two claw attacks. These are primary natural attacks that deal 1d4 points of damage."
    },
    "Shatter Defenses": {
        "prerequisites": {
        "Feat": "Dazzling Display",
        "BAB": 6
        },
        "benefit": "Hindered foes are flat-footed."
    },
    "Shatterspell": {
        "prerequisites": {
        "Feat": ["Disruptive", "Spellbreaker"],
        "Race": "dwarf",
        "Class": {"Fighter": 10}
        },
        "benefit": "As a standard action, you can attempt to sunder an ongoing spell effect as if you had the spell sunder rage power. You may use this feat once per day, plus one additional time per day for every 5 points by which your BAB exceeds +10."
    },
    "Shield Bash, Improved": {
        "prerequisites": {
        "Feat": "Shield Proficiency"
        },
        "benefit": "Keep your shield bonus when shield bashing."
    },
    "Shield Focus": {
        "prerequisites": {
        "Feat": "Shield Proficiency",
        "BAB": 1
        },
        "benefit": "Gain a +1 bonus to your AC when using a shield."
    },
    "Improved Shield Focus": {
        "prerequisites": {
        "Feat": "Shield Focus",
        "BAB": 6
        },
        "benefit": "You reduce the armor check penalty of any shield you are using by 1. You also use your character level in place of your BAB for the purpose of shield mastery feat prerequisites."
    },
    "Shield Focus, Greater": {
        "prerequisites": {
        "Feat": "Shield Focus",
        "Class": {"Fighter": 8}
        },
        "benefit": "Gain a +1 bonus to your AC when using a shield."
    },
    "Shield Master": {
        "prerequisites": {
        "Feat": "Shield Slam",
        "BAB": 11
        },
        "benefit": "No two-weapon penalties when attacking with a shield."
    },
    "Shield Proficiency": {
        "prerequisites": {},
        "benefit": "No penalties on attack rolls when using a shield."
    },
    "Shield of Swings": {
        "prerequisites": {
        "Stat": {"STR": 13},
        "Feat": "Power Attack",
        "BAB": 1
        },
        "benefit": "Reduce damage with a two handed weapon to gain a +4 shield bonus."
    },
    "Shield Specialization": {
        "prerequisites": {
        "Feat": "Shield Focus",
        "Class": {"Fighter": 4}
        },
        "benefit": "+2 bonus to AC against criticals with one type of shield."
    },
    "Shield Specialization, Greater": {
        "prerequisites": {
        "Feat": ["Shield Focus", "Shield Specialization"],
        "Class": {"Fighter": 12}
        },
        "benefit": "+2 bonus to AC against criticals, and negate critical hit once per day."
    },
    "Shield Slam": {
        "prerequisites": {
        "Feat": ["Improved Shield Bash", "Two-Weapon Fighting"],
        "BAB": 6
        },
        "benefit": "Free bull rush with a bash attack"
    },
    "Shield Wall": {
        "prerequisites": {
        "Feat": "Shield Proficiency"
        },
        "benefit": "Whenever you are wielding a shield and are adjacent to an ally wielding a shield who also has this feat, the AC bonus from your shield increases, depending on the shield wielded by your ally."
    },
    "Shield Gauntlet Style": {
        "prerequisites": {
        "Feat": "Weapon Focus (gauntlet or spiked gauntlet)",
        "Proficiency": ["bucklers", "light shields"]
        },
        "benefit": "When using this style, if you begin your turn wearing a gauntlet or spiked gauntlet on your off hand, and you are not using that hand to hold or make attacks with any other weapons or shield, you gain a +1 shield bonus to AC. You lose this shield bonus whenever you attack with your gauntlet or hold a weapon or shield in that hand. While receiving this shield bonus to AC, your gauntlet or spiked gauntlet is treated as a buckler for the purpose of using other feats and abilities (though you are also considered to have a free hand). This feat acts as the Improved Unarmed Strike feat for the purpose of satisfying the prerequisites of the Deflect Arrows and Snatch Arrows feats."
    },
    "Shielded Gauntlet Attack": {
        "prerequisites": {
        "Feat": ["Shield Gauntlet Style", "Weapon Focus (gauntlet or spiked gauntlet)"],
        "Proficiency": ["bucklers", "light shields"]
        },
        "benefit": "While using Shield Gauntlet Style, you can calculate the damage of your gauntlet or spiked gauntlet using the sacred weapon damage value of a warpriest with a level 4 less than your BAB. The style also allows you to take one AOO each round that does not count toward your maximum number of attacks of opportunity. This must be used to make an attack with your gauntlet (or spiked gauntlet), or a disarm or steal combat maneuver. You do not provoke an AOO for performing either combat maneuver, and you are able to attempt a steal combat maneuver with this AOO despite the maneuver normally requiring a standard action."
    },
    "Shielded Gauntlet Master": {
        "prerequisites": {
        "Feat": ["Shielded Gauntlet Attack", "Shield Gauntlet Style", "Weapon Focus (gauntlet or spiked gauntlet)"],
        "Proficiency": ["bucklers", "light shields"]
        },
        "benefit": "While using Shield Gauntlet Style, you no longer lose your shield bonus to AC when you attack with your gauntlet (or spiked gauntlet) or use it to hold a weapon. In addition, you add your gauntlet’s enhancement bonus to the shield bonus to AC granted by this feat as if it were a shield enhancement bonus."
    },
    "Cushioning Shield": {
        "prerequisites": {
        "Feat": "Shield Focus",
        "OR": [
            {"BAB": 6},
            {"Class": {"Fighter": 4}}
        ]
        },
        "benefit": "When you fall 10 or more feet, you can direct half of the falling damage you would take to your shield."
    },
    "Defended Movement": {
        "prerequisites": {
        "Feat": "Shield Focus",
        "OR": [
            {"BAB": 6},
            {"Class": {"Fighter": 4}}
        ]
        },
        "benefit": "You gain a +2 bonus to your AC against attacks of opportunity."
    },
    "Feint Defender": {
        "prerequisites": {
        "Feat": "Shield Focus",
        "OR": [
            {"BAB": 6},
            {"Class": {"Fighter": 4}}
        ],
        "Skill": {"Sense Motive": 1}
        },
        "benefit": "You add your shield’s bonus to AC to the DC of feint attempts against you."
    },
    "Greater Ray Shield": {
        "prerequisites": {
        "Stat": {"DEX": 17},
        "Feat": ["Missile Shield", "Ray Shield", "Spellbreaker"]
        },
        "benefit": "When you use the Ray Shield feat, your shield is not affected by the deflected ranged touch attack."
    },
    "Guarded Charge": {
        "prerequisites": {
        "Feat": "Shield Focus",
        "OR": [
            {"BAB": 6},
            {"Class": {"Fighter": 4}}
        ]
        },
        "benefit": "When performing a bull rush or overrun combat maneuver as part of a charge, you don’t provoke an attack of opportunity for that maneuver. If you already have the Improved Bull Rush or Improved Overrun feats, you gain an additional +2 bonus on your combat maneuver check when attempting the respective maneuver."
    },
    "Improved Shield Focus (Shield Mastery)": {
        "prerequisites": {
        "Feat": "Shield Focus",
        "BAB": 6
        },
        "benefit": "You reduce the armor check penalty of any shield you are using by 1. You also use your character level in place of your base attack bonus for the purpose of shield mastery feat prerequisites."
    },
    "Shield Brace": {
        "prerequisites": {
        "Feat": "Shield Focus",
        "OR": [
            {"BAB": 3},
            {"Class": {"Fighter": 1}}
        ],
        "Proficiency": ["light shields", "heavy shields", "tower shields"]
        },
        "benefit": "You can use a two-handed weapon sized appropriately for you from the polearm or spears weapon group while also using a light, heavy, or tower shield with which you are proficient. The shield’s armor check penalty (if any) applies to attacks made with the weapon."
    },
    "Shielded Mage": {
        "prerequisites": {
        "Feat": "Shield Focus",
        "OR": [
            {"BAB": 3},
            {"Class": {"Fighter": 1}}
        ]
        },
        "benefit": "You reduce the arcane spell failure of any shield you use by 15% (to a minimum of 0%). Using a shield does not prevent you from completing somatic spell components with the hand wielding the shield."
    },
    "Shielded Stand": {
        "prerequisites": {
        "Feat": "Shield Focus",
        "OR": [
            {"BAB": 3},
            {"Class": {"Fighter": 1}}
        ]
        },
        "benefit": "As a swift action, you can prevent yourself or an adjacent ally from provoking an attack of opportunity when standing from prone or when picking up an object from the ground."
    },
    "Shield Material Expertise": {
        "prerequisites": {
        "Feat": "Shield Focus",
        "OR": [
            {"BAB": 6},
            {"Class": {"Fighter": 4}}
        ]
        },
        "benefit": "When wielding a shield made of a special material, you can use the listed ability twice per day."
    },
    "Shield Material Mastery": {
        "prerequisites": {
        "Feat": ["Shield Focus", "Shield Material Expertise"],
        "OR": [
            {"BAB": 11},
            {"Class": {"Fighter": 8}}
        ]
        },
        "benefit": "You can use the ability granted by Shield Material Expertise two additional times per day."
    },
    "Shikigami Style": {
        "prerequisites": {
        "Feat": {
            "OR": ["Catch Off-Guard", "Throw Anything"]
        }
        },
        "benefit": "Your skill with improvised weapons makes them more dangerous than they would otherwise be."
    },
    "Shikigami Mimicry": {
        "prerequisites": {
        "Feat": {
            "OR": ["Catch Off-Guard", "Throw Anything"]
        },
        "Additional": "Shikigami Style"
        },
        "benefit": "Your unique understanding of improvised tools enables you to turn the intrinsic form of all manner of objects to your advantage in combat."
    },
    "Shikigami Manipulation": {
        "prerequisites": {
        "Feat": {
            "OR": ["Catch Off-Guard", "Throw Anything"]
        },
        "Additional": ["Shikigami Mimicry", "Shikigami Style"],
        "Skill": {"Use Magic Device": 5}
        },
        "benefit": "You channel a magic item’s power to enhance its improvised attacks, even though it was never meant to be used as a weapon."
    },
    "Sprightly Armor": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "OR": [
            {"BAB": 11},
            {"Class": {"Fighter": 8}}
        ],
        "Special": "armor training class feature",
        "Proficiency": "light armor"
        },
        "benefit": "You add your armor’s enhancement bonus as a bonus on your initiative checks."
    },
    "Stumbling Bash": {
        "prerequisites": {
        "Feat": ["Improved Shield Bash", "Shield Focus"],
        "OR": [
            {"BAB": 6},
            {"Class": {"Fighter": 4}}
        ]
        },
        "benefit": "Creatures struck by your shield bash take a –2 penalty to their AC until the end of your next turn."
    },
    "Toppling Bash": {
        "prerequisites": {
        "Feat": ["Improved Shield Bash", "Shield Focus", "Stumbling Bash"],
        "OR": [
            {"BAB": 11},
            {"Class": {"Fighter": 8}}
        ]
        },
        "benefit": "As a swift action when you hit a creature with a shield bash, you can attempt a trip combat maneuver against that creature at a –5 penalty. This does not provoke an attack of opportunity, and if your attempt fails by 10 or more, you are not knocked prone."
    },
    "Tower Shield Specialist": {
        "prerequisites": {
        "Feat": ["Shield Focus", "Tower Shield Proficiency"],
        "OR": [
            {"BAB": 11},
            {"Class": {"Fighter": 8}}
        ]
        },
        "benefit": "You reduce the armor check penalty for tower shields by 3, and if you have the armor training class feature, you modify the armor check penalty and maximum Dexterity bonus of tower shields as if they were armor."
    },
    "Unhindering Shield": {
        "prerequisites": {
        "Feat": "Shield Focus",
        "OR": [
            {"BAB": 6},
            {"Class": {"Fighter": 4}}
        ],
        "Proficiency": "bucklers"
        },
        "benefit": "You still gain a buckler’s bonus to AC even if you use your shield hand for some other purpose. When you wield a buckler, your shield hand is considered free for the purposes of casting spells, wielding weapons, and using any other abilities that require you to have a free hand or interact with your shield, such as the swashbuckler’s precise strike deed or the Weapon Finesse feat."
    },
    "Shot on the Run": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "Feat": ["Mobility", "Point-Blank Shot"],
        "BAB": 4
        },
        "benefit": "Make ranged attack at any point during movement"
    },
    "Shrapnel Strike": {
        "prerequisites": {
        "Stat": {"STR": 15},
        "Feat": ["Improved Sunder", "Power Attack"]
        },
        "benefit": "You can bash things to damage nearby opponents."
    },
    "Shrewd Tactician": {
        "prerequisites": {
        "Feat": ["Alertness", "Combat Reflexes"]
        },
        "benefit": "Opponents do not gain a +2 bonus on attack rolls for flanking you."
    },
    "Shrug On": {
        "prerequisites": {
        "BAB": 1,
        "Proficiency": "medium armor"
        },
        "benefit": "As a full-round action, you can shrug yourself into the largest and most protective section of a suit of armor with which you are proficient. The armor does not grant any magical benefits in this state, and its armor check penalty and maximum Dexterity bonus to AC are both 2 worse than normal. When donned using this feat, medium armor grants a +3 armor bonus, and heavy armor grants a +5 armor bonus. Light armor grants no armor bonus when donned using this feat."
    },
    "Sidestep": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "Feat": ["Dodge", "Mobility"]
        },
        "benefit": "Make 5-foot step immediately after an opponent misses"
    },
    "Sidestep, Improved": {
        "prerequisites": {
        "Stat": {"DEX": 15},
        "Feat": "Sidestep"
        },
        "benefit": "Sidestep without using your 5-foot step on your next turn"
    },
    "Siege Commander": {
        "prerequisites": {
        "Skill": {"Craft (siege weapon)": 5, "Knowledge (engineering)": 5},
        "OR": {"Profession (Siege Engineer)": 1}
        },
        "benefit": "Grant weapon crew +4 on assemble or move checks"
    },
    "Siege Engineer": {
        "prerequisites": {
        "OR": [
            {"Skill": {"Knowledge (engineering)": 5}},
            {"Profession (siege engineer)": 5}
        ],
        "Proficiency": "1 siege weapon"
        },
        "benefit": "You are considered proficient with all siege weapons"
    },
    "Master Siege Engineer": {
        "prerequisites": {
        "Feat": "Siege Engineer",
        "Skill": {"Knowledge (engineering)": 10}
        },
        "benefit": "Crew can load siege engine as a move action"
    },
    "Siege Gunner": {
        "prerequisites": {
        "Feat": "Siege Engineer"
        },
        "benefit": "Take no size penalties for aiming a direct fire siege weapon"
    },
    "Signature Strike Style": {
        "prerequisites": {
        "Feat": ["Precise Shot", "Weapon Focus (chosen weapon)"],
        "BAB": 7,
        "Skill": {"Intimidate": 7},
        "OR": ["Improved Called Shot", "targeted strike swashbuckler deed", "targeting gunslinger deed"]
        },
        "benefit": "Your accuracy when attacking is both delightfully artistic and chillingly deadly."
    },
    "Signature Strike Taunt": {
        "prerequisites": {
        "Feat": ["Precise Shot", "Signature Strike Style", "Weapon Focus"],
        "BAB": 9,
        "Skill": {"Intimidate": 9}
        },
        "benefit": "Your mocking strikes leave your foe deeply embarrassed and infuriated."
    },
    "Signature Strike Triumph": {
        "prerequisites": {
        "Feat": ["Precise Shot", "Signature Strike Style", "Signature Strike Taunt", "Weapon Focus"],
        "BAB": 11,
        "Skill": {"Intimidate": 11}
        },
        "benefit": "With an effortless flourish, you strike terror into your foes and inspire your allies."
    },
    "Silent Kill": {
        "prerequisites": {
        "Skill": {"Stealth": 12},
        "OR": ["assassinate advanced slayer talent", "ninja master trick"]
        },
        "benefit": "Kill during the surprise round and slip back into shadows"
    },
    "Simple Weapon Proficiency": {
        "prerequisites": {},
        "benefit": "No penalty on attacks made with simple weapons."
    },
    "Slashing Grace": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "Feat": ["Weapon Finesse", "Weapon Focus (selected weapon)"]
        },
        "benefit": "Treat a slashing weapon as a piercing melee weapon"
    },
    "Slayer’s Feint": {
        "prerequisites": {
        "Stat": {"DEX": 15},
        "Feat": ["Acrobatic or slayer 1", "Combat Expertise"],
        "Skill": {"Acrobatics": 1}
        },
        "benefit": "Use Acrobatics instead of Bluff to feint"
    },
    "Sleeper Hold": {
        "prerequisites": {
        "Feat": "Greater Grapple",
        "BAB": 8
        },
        "benefit": "You might knock out an opponent if you maintain a grapple for a number of rounds equal to its Constitution bonus. See text for details."
    },
    "Sliding Axe Throw": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "BAB": 1
        },
        "benefit": "Use throwing axes to trip your opponent."
    },
    "Sliding Dash": {
        "prerequisites": {
        "Stat": {"DEX": 15},
        "OR": [
            {"Skill": {"Acrobatics": 10}},
            "acrobatic charge class feature"
        ],
        "Skill": {"Bluff": 3}
        },
        "benefit": "Charge through a foe for a flank attack"
    },
    "Sling Flail": {
        "prerequisites": {
        "Feat": "Weapon Focus (sling)",
        "BAB": 1
        },
        "benefit": "Make melee attacks with a sling"
    },
    "Smashing Style": {
        "prerequisites": {
        "Stat": {"STR": 13},
        "Feat": ["Improved Sunder", "Power Attack", "Weapon Focus (chosen weapon)"]
        },
        "benefit": "Immediately bull rush or trip combat maneuver an opponent when you succeed at a sunder check against a suit of armor worn by that opponent with an axe, hammer, or flail."
    },
    "Smashing Crush": {
        "prerequisites": {
        "Stat": {"STR": 13},
        "Feat": ["Improved Sunder", "Smashing Style", "Weapon Focus (chosen weapon)"]
        },
        "benefit": "While using Smashing Style, reduce an object’s hardness by 1 when you successfully damage it with a sunder combat maneuver."
    },
    "Smashing Dent": {
        "prerequisites": {
        "Stat": {"STR": 13},
        "Feat": ["Improved Sunder", "Smashing Crush", "Smashing Style", "Weapon Focus (chosen weapon)"],
        "BAB": 6
        },
        "benefit": "While using Smashing Style, reduce a suit of armor’s armor bonus to Armor Class by 1 and increase its armor check penalty by 1 when you damage it with a sunder combat maneuver."
    },
    "Smiting Reversal": {
        "prerequisites": {
        "Feat": ["Power Attack", "Toughness"]
        },
        "benefit": "3/day after being targeted by a smite attack, immediately make an AOO against the attacker with a bonus on this attack roll equal to your Cha bonus and a bonus to damage equal to your character level. This AOO ignores all damage reduction the creature possesses."
    },
    "Snap Shot": {
        "prerequisites": {
        "Feat": ["Rapid Shot", "Weapon Focus"],
        "BAB": 6
        },
        "benefit": "Threaten squares within 5 feet of you when wielding a ranged weapon"
    },
    "Improved Snap Shot": {
        "prerequisites": {
        "Stat": {"DEX": 15},
        "Feat": "Snap Shot",
        "BAB": 9
        },
        "benefit": "You threaten an additional 10errata 5 feet with Snap Shot"
    },
    "Greater Snap Shot": {
        "prerequisites": {
        "Stat": {"DEX": 17},
        "Feat": "Improved Snap Shot",
        "BAB": 12
        },
        "benefit": "Gain bonus on damage and critical confirmation when using ranged weapons"
    },
    "Snatch Arrows": {
        "prerequisites": {
        "Stat": {"DEX": 15},
        "Feat": "Deflect Arrows"
        },
        "benefit": "Catch one ranged attack per round."
    },
    "Social Bravery": {
        "prerequisites": {
        "Stat": {"CHA": 13},
        "Feat": "bravery class feature"
        },
        "benefit": "Apply bravery against various social attacks"
    },
    "Solo Maneuvers": {
        "prerequisites": {},
        "benefit": "Whenever you are the only one threatening an opponent, you gain a +1 bonus on combat maneuvers against that creature and a +1 bonus to CMD against combat maneuvers made by that creature."
    },
    "Sorcerous Strike": {
        "prerequisites": {
        "Special": "Sorcerer bloodline class feature",
        "Feat": "Improved Unarmed Strike"
        },
        "benefit": "Apply a bloodline ability as part of a melee attack"
    },
    "Soulblade": {
        "prerequisites": {
        "Skill": {"Knowledge (religion)": 1, "Perception": 1}
        },
        "benefit": "As a standard action, you can make a weapon attack against a haunt. If successful, your attack deals damage equal to your weapon dice plus any enhancement bonus (but not other bonuses, such as those granted by Strength, Weapon Specialization, or class features like sneak attack). You can use any Vital Strike feat in order to enhance this attack."
    },
    "Soulwrecking Strike": {
        "prerequisites": {
        "Feat": "Vital Strike",
        "BAB": 6
        },
        "benefit": "Whenever you use the attack action against a creature that is possessed, both the creature and any creature possessing it are damaged by your attack (the amount of damage includes your weapon’s damage dice, your Strength modifier, weapon special abilities, and so on). The possessing creature can attempt a Will save (DC = 10 + 1/2 your base attack bonus + your Charisma modifier) to halve the damage. Damage Reduction applies normally against this attack, but incorporeal creatures take full damage from this attack as if they were corporeal."
    },
    "Spear Dancing Style": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "Feat": ["Two-Weapon Fighting", "Weapon Focus (chosen weapon)"]
        },
        "benefit": "Fight with a chosen polearm or spear as if it were a double weapon instead of a brace or reach weapon."
    },
    "Spear Dancing Spiral": {
        "prerequisites": {
        "Stat": {"DEX": 15},
        "Feat": ["Spear Dancing Style", "Two-Weapon Fighting", "Weapon Finesse", "Weapon Focus (chosen weapon)"]
        },
        "benefit": "While using Spear Dancing Style, you gain the benefit of Weapon Finesse with the chosen weapon if it is appropriately sized for a creature of your size category. In addition, you can use any feat or ability that functions with a quarterstaff with your chosen weapon."
    },
    "Spear Dancing Reach": {
        "prerequisites": {
        "Stat": {"DEX": 17},
        "Feat": ["Spear Dancing Spiral", "Spear Dancing Style", "Two-Weapon Fighting", "Weapon Finesse", "Weapon Focus (chosen weapon)"]
        },
        "benefit": "While using Spear Dancing Style and making a full attack using the chosen weapon as a double weapon, you can grant the reach special weapon feature to one or both of the weapon’s ends until the end of your turn as a swift action."
    },
    "Spellbreaker": {
        "prerequisites": {
        "Feat": "Disruptive",
        "Class": {"Fighter": 10}
        },
        "benefit": "Enemies provoke attacks if their spells fail"
    },
    "Spiked Destroyer": {
        "prerequisites": {
        "Proficiency": "spiked armor"
        },
        "benefit": "When you succeed a bull rush or overrun you may automatically attack with armor spikes against the same target."
    },
    "Spinning Throw": {
        "prerequisites": {
        "Feat": ["Improved Bull Rush", "Improved Trip", "Improved Unarmed Strike", "Ki Throw"]
        },
        "benefit": "Spend a swift action to bull rush opponent, move it, then knock it prone"
    },
    "Spirited Charge": {
        "prerequisites": {
        "Feat": "Ride-By Attack"
        },
        "benefit": "Double damage on a mounted charge"
    },
    "Spit Venom": {
        "prerequisites": {
        "Race": "Nagaji"
        },
        "benefit": "As a full-round action, you can spit poison up to 10 feet as a ranged touch attack. If you hit, the target must make a successful Fortitude save or be blinded for 1d6 rounds. The DC of this save is equal to 10 + 1/2 your total Hit Dice + your Constitution modifier. You can use this ability once per day plus one additional time per day for every three Hit Dice you have."
    },
    "Spring Attack": {
        "prerequisites": {
        "Feat": "Mobility",
        "BAB": 4
        },
        "benefit": "Move before and after melee attack"
    },
    "Spring-Heeled Style": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "Feat": ["Dodge", "Mobility"],
        "OR": ["Shot on the Run", "Spring Attack"],
        "BAB": 4,
        "Proficiency": "light armor"
        },
        "benefit": "If using this style during any round in which you take a move action to move 10 or more feet, you gain a +2 bonus on weapon attack rolls until the start of your next turn. While using this style, you gain the AC bonus feats from Mobility against attacks of opportunity provoked by making a ranged attack or loading a ranged weapon."
    },
    "Spring-Heeled Reaping": {
        "prerequisites": {
        "Stat": {"DEX": 17},
        "Feat": ["Dodge", "Mobility", "Spring-Heeled Style", "Spring-Heeled Sprint"],
        "OR": ["Shot on the Run", "Spring Attack"],
        "BAB": 11,
        "Proficiency": "light armor"
        },
        "benefit": "While using Spring-Heeled Style, whenever you use Shot on the Run or Spring Attack, you can attack two different creatures at any point in your movement. Each attack is made at your full attack bonus. Any creature that you attack in melee with this feat cannot make attacks of opportunity against you for that movement, as normal for Spring Attack."
    },
    "Spring-Heeled Sprint": {
        "prerequisites": {
        "Stat": {"DEX": 15},
        "Feat": ["Dodge", "Mobility", "Spring-Heeled Style"],
        "OR": ["Shot on the Run", "Spring Attack"],
        "BAB": 7,
        "Proficiency": "light armor"
        },
        "benefit": "While using Spring-Heeled Style, you can move up to twice your speed when using the Shot on the Run or Spring Attack feats."
    },
    "Stabbing Shot": {
        "prerequisites": {
        "Feat": "Rapid Shot",
        "Race": "elf"
        },
        "benefit": "Use arrow as a melee attack to push enemies back"
    },
    "Stage Combatant": {
        "prerequisites": {
        "Feat": "Weapon Focus",
        "BAB": 5
        },
        "benefit": "Take no penalty to deal nonlethal damage"
    },
    "Staggering Fist": {
        "prerequisites": {
        "Stat": {"DEX": 13, "WIS": 13},
        "Feat": "Improved Unarmed Strike",
        "BAB": 2
        },
        "benefit": "Stagger foes with unarmed strikes"
    },
    "Stance of the Xorn": {
        "prerequisites": {
        "Stat": {"WIS": 15},
        "BAB": 3
        },
        "benefit": "Flanking creatures do not gain a bonus to hit you."
    },
    "Stand Still": {
        "prerequisites": {
        "Feat": "Combat Reflexes"
        },
        "benefit": "Stop enemies from moving past you"
    },
    "Starry Grace": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "Feat": ["Weapon Finesse", "Weapon Focus (starknife)"]
        },
        "benefit": "Use Dexterity on starknife damage rolls"
    },
    "Startling Getaway": {
        "prerequisites": {
        "Special": "Startling appearance class feature"
        },
        "benefit": "Move away after a startling appearance"
    },
    "Startoss Style": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "Feat": ["Point-Blank Shot", "Weapon Focus (chosen weapon)"]
        },
        "benefit": "Deal extra damage with a thrown weapon when not wielding a weapon or shield (other than a buckler) in your off hand."
    },
    "Startoss Comet": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "Feat": ["Point-Blank Shot", "Startoss Style", "Weapon Focus (chosen weapon)"]
        },
        "benefit": "Make an attack with a thrown weapon against two opponents as a standard action."
    },
    "Startoss Shower": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "Feat": ["Point-Blank Shot", "Startoss Comet", "Startoss Style", "Weapon Focus (chosen weapon)"],
        "BAB": 4
        },
        "benefit": "Make additional attacks against nearby enemies when using Startoss Comet."
    },
    "Steadfast Slayer": {
        "prerequisites": {},
        "benefit": "If you are the only character threatening an opponent and you successfully attack the opponent with a two-handed melee weapon, for each size category larger than you that opponent is, you gain a +2 bonus on your melee damage roll."
    },
    "Steady Engagement": {
        "prerequisites": {
        "Feat": ["Combat Reflexes", "Stand Still"]
        },
        "benefit": "If you prevent an opponent from moving via Stand Still, may disarm or trip the target as an immediate action."
    },
    "Steal, Improved": {
        "prerequisites": {
        "Feat": "Combat Expertise"
        },
        "benefit": "+2 bonus on steal attempts, no AOO"
    },
    "Steal, Greater": {
        "prerequisites": {
        "Feat": "Steal, Improved",
        "BAB": 6
        },
        "benefit": "Enemies do not notice theft until later"
    },
    "Step Up": {
        "prerequisites": {
        "BAB": 1
        },
        "benefit": "Take a 5-foot step as an immediate action"
    },
    "Step Up and Strike": {
        "prerequisites": {
        "Feat": "Following Step",
        "BAB": 6
        },
        "benefit": "Follow adjacent creature and attack as an immediate action"
    },
    "Stick Together": {
        "prerequisites": {},
        "benefit": "When an adjacent ally with this feat moves, you can move up to your speed as an immediate action, as long as your movement ends adjacent to that ally. If you do so, you are staggered on your next turn. This movement provokes attacks of opportunity as normal."
    },
    "Stock-Striker Style": {
        "prerequisites": {
        "Special": "Pistol-whip gunslinger deed"
        },
        "benefit": "Your fighting technique makes you equally deadly with your firearm’s stock as with its bullets."
    },
    "Stock-Striker Sweep": {
        "prerequisites": {
        "Feat": "Stock-Striker Style",
        "BAB": 7,
        "Special": "pistol-whip gunslinger deed"
        },
        "benefit": "The force of your firearm strikes can drive back your foe or damage a second target."
    },
    "Stock-Striker Takedown": {
        "prerequisites": {
        "Feat": ["Point-Blank Shot", "Stock-Striker Style", "Stock-Striker Sweep"],
        "BAB": 9,
        "Special": "pistol-whip gunslinger deed"
        },
        "benefit": "Your melee strike leaves your target vulnerable to a merciless finishing shot."
    },
    "Strangler": {
        "prerequisites": {
        "Feat": "Improved Grapple",
        "Special": "sneak attack +1d6"
        },
        "benefit": "Deal sneak damage to grappled opponent"
    },
    "Street Style": {
        "prerequisites": {
        "Stat": {"STR": 15},
        "Feat": ["Improved Bull Rush", "Improved Unarmed Strike", "Power Attack"],
        "OR": {
            "BAB": 4,
            "Class": {"Monk": 3}
        }
        },
        "benefit": "Deal extra damage and bull rush in urban areas"
    },
    "Street Sweep": {
        "prerequisites": {
        "Feat": "Street Style",
        "OR": {
            "BAB": 6,
            "Class": {"Monk": 5}
        }
        },
        "benefit": "Follow up attack to knock bull-rushed foes prone"
    },
    "Street Carnage": {
        "prerequisites": {
        "Feat": ["Street Style", "Street Sweep"],
        "OR": {
            "BAB": 8,
            "Class": {"Monk": 7}
        }
        },
        "benefit": "Gain ×3 critical multiplier with unarmed strikes"
    },
    "Strike Back": {
        "prerequisites": {
        "BAB": 11
        },
        "benefit": "Attack foes that strike you while using reach"
    },
    "Structural Strike": {
        "prerequisites": {
        "Skill": {"Knowledge (engineering)": 5},
        "OR": "precise strike class feature or precise strike deed"
        },
        "benefit": "Use precise strike against creatures normally immune"
    },
    "Stunning Assault": {
        "prerequisites": {
        "Feat": "Power Attack",
        "BAB": 16
        },
        "benefit": "Trade melee attack bonus to stun opponents"
    },
    "Stunning Fist": {
        "prerequisites": {
        "Stat": {"DEX": 13, "WIS": 13},
        "Feat": "Improved Unarmed Strike",
        "BAB": 8
        },
        "benefit": "Stun opponent with an unarmed strike"
    },
    "Stunning Fist Adept": {
        "prerequisites": {
        "Feat": "Stunning Fist",
        "BAB": 3
        },
        "benefit": "Add +1 to the saving throw DC against your Stunning Fist attacks. This bonus does not stack with feats that grant you bonuses to the DC for saving throws against your Stunning Fist attacks, such as Mantis Style."
    },
    "Stunning Pin": {
        "prerequisites": {
        "Feat": ["Improved Grapple", "Stunning Fist"]
        },
        "benefit": "Use Stunning Fist against pinned opponents"
    },
    "Stunning Irruption": {
        "prerequisites": {
        "Stat": {"STR": 15},
        "Feat": "Power Attack",
        "BAB": 5
        },
        "benefit": "When you smash your way into a room, you gain more than just the element of surprise."
    },
    "Sunder, Improved": {
        "prerequisites": {
        "Feat": "Power Attack"
        },
        "benefit": "+2 bonus on sunder attempts, no AOO"
    },
    "Sunder, Greater": {
        "prerequisites": {
        "Feat": "Improved Sunder",
        "BAB": 6
        },
        "benefit": "Damage from sunder attempts transfers to your enemy"
    },
    "Sunder Blessing": {
        "prerequisites": {
        "Feat": "Disruptive",
        "Class": {"Fighter": 8}
        },
        "benefit": "You can attempt to sunder an ongoing divine spell effect or divine spell-like ability by succeeding at a combat maneuver check."
    },
    "Sundering Strike": {
        "prerequisites": {
        "Feat": "Sunder, Improved",
        "BAB": 9
        },
        "benefit": "Attempt a sunder attack on a successful critical hit"
    },
    "Suppressive Fire": {
        "prerequisites": {
        "Feat": ["Far Shot", "Point-Blank Shot", "Precise Shot"],
        "Special": "keen senses racial trait"
        },
        "benefit": "When you damage a target with a ranged attack, it can’t make attacks of opportunity against allies who have this feat"
    },
    "Surprise Follow-Through": {
        "prerequisites": {
        "Stat": {"STR": 13},
        "Feat": ["Cleave", "Power Attack"],
        "BAB": 1
        },
        "benefit": "When using Cleave or Great Cleave, the second foe you attack on your turn is denied its Dexterity bonus against you."
    },
    "Surprise Strike": {
        "prerequisites": {
        "Feat": ["Cautious Fighter", "Desperate Swing"],
        "BAB": 6,
        "Race": "halfling"
        },
        "benefit": "Once per day, when fighting defensively or making an AOO while taking the total defense action with the Desperate Swing feat, you take no penalty on the attack roll."
    },
    "Swap Places": {
        "prerequisites": {},
        "benefit": "Whenever you are adjacent to an ally who also has this feat, you can move into your ally’s square as part of normal movement. At the same time, your ally moves into your previous space as an immediate action. Both you and your ally must be willing and able to move to take advantage of this feat. Your ally must be the same size as you to utilize this feat. Your ally does not provoke an AOO from this movement, but you provoke as normal. This movement does not count against your ally’s movement on his next turn."
    },
    "Sweeping Dodge": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "Feat": "Dodge"
        },
        "benefit": "When you make a dueling dodge while wearing a cloak, you gain evasion (as the rogue ability). If a critical hit or sneak attack is scored on you, there is a 25% chance that the critical hit or sneak attack is negated and damage is instead rolled normally. This feat only applies until the attack that triggered the immediate action is resolved. This feat does not stack with the fortification armor special ability or similar effects."
    },
    "Swift Iron Style": {
        "prerequisites": {
        "Stat": {"STR": 13, "DEX": 13},
        "Proficiency": "medium armor"
        },
        "benefit": "While using this style, you treat the armor check penalty of your armor as if it were 1 less, and the maximum Dexterity bonus to AC as if it were 1 higher."
    },
    "Swift Refuge": {
        "prerequisites": {
        "Stat": {"STR": 13, "DEX": 13},
        "Feat": "Swift Iron Style",
        "Proficiency": "medium armor"
        },
        "benefit": "Once per day when using Swift Iron Style, when you’re hit by a weapon, unarmed attack, or natural weapon, you can treat all dice other than the weapon’s base damage dice (including extra dice from sneak attack, critical hit, magic special weapon abilities, and Vital Strike) as having rolled 1s. You can use this ability a second time per day when your BAB reaches +8, and a third time at +16."
    },
    "Swift Sprint": {
        "prerequisites": {
        "Stat": {"STR": 13, "DEX": 13},
        "Feat": ["Swift Iron Style", "Swift Refuge"],
        "Proficiency": "medium armor"
        },
        "benefit": "When you’re charging, running, or taking no action in your turn other than movement, your armor does not reduce your movement."
    },
    "Sword And Pistol": {
        "prerequisites": {
        "Feat": ["Snap Shot", "Two-Weapon Fighting"],
        "BAB": 6
        },
        "benefit": "Ranged attacks do not provoke attacks of opportunity"
    },
    "Swordplay Style": {
        "prerequisites": {
        "Feat": ["Combat Expertise", "Weapon Focus (chosen weapon)"],
        "BAB": 3
        },
        "benefit": "Gain a +1 shield bonus to your Armor Class when wielding a heavy blade or light blade and fighting defensively or using either the total defense action or the Combat Expertise feat. You do not take the penalty on melee attacks from Combat Expertise on the first attack roll you make each turn."
    },
    "Swordplay Upset": {
        "prerequisites": {
        "Feat": ["Combat Expertise", "Improved Feint", "Swordplay Style", "Weapon Focus (chosen weapon)"],
        "BAB": 5
        },
        "benefit": "While using Swordplay Style, as an immediate action, you can attempt a feint against an opponent that makes a melee attack against you and misses."
    },
    "Swordplay Deflection": {
        "prerequisites": {
        "Feat": ["Combat Expertise", "Improved Feint", "Swordplay Style", "Swordplay Upset", "Weapon Focus (chosen weapon)"],
        "BAB": 7
        },
        "benefit": "While using Swordplay Style, when you make one or more melee attacks, you can forgo a single melee attack to prepare an action to attempt to disrupt an opponent’s attack. If you succeed, you gain a +4 shield bonus to your Armor Class against attacks made by your opponent until the start of your next turn."
    },
    "Sympathetic Rage": {
        "prerequisites": {
        "Race": ["Half-orc", "orc"],
        "Special": "non-lawful"
        },
        "benefit": "Enter a rage-like state when near an ally who is raging."
    },
    "Tactical Reposition": {
        "prerequisites": {
        "Stat": {"INT": 13},
        "Feat": ["Combat Expertise", "Improved Reposition"]
        },
        "benefit": "You can reposition a foe into a dangerous space such as a pit or blade barrier."
    },
    "Tail Terror": {
        "prerequisites": {
        "BAB": 1,
        "Race": "Kobold"
        },
        "benefit": "You can make a tail slap attack with your tail. This is a secondary natural attack that deals 1d4 points of bludgeoning damage. Furthermore, you can augment your tail slap attack with a kobold tail attachment. For the purpose of weapon feats, you are considered proficient with all kobold tail attachments."
    },
    "Duelist": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "Feat": ["Exotic Weapon Proficiency (falcata)", "Weapon Focus (falcata)"],
        "Proficiency": "Buckler"
        },
        "benefit": "When fighting with the falcata and buckler, your shield bonus to AC increases by +1 and you gain a +2 circumstance bonus on Acrobatics checks."
    },
    "Tangle Feet": {
        "prerequisites": {
        "Feat": ["Dodge", "Mobility", "Underfoot"],
        "Race": "Goblin",
        "Size": "Small or smaller"
        },
        "benefit": "When you successfully make an Acrobatics check to avoid provoking an AOO from a larger opponent when you move through its threatened area or its space, you can make that opponent lose its balance until the end of its next turn as a free action. While that creature’s balance is lost, if it attempts to move, it must make a successful DC 15 Acrobatics check or fall prone, wasting the move action. You can only affect one creature with this effect each round."
    },
    "Tantrum": {
        "prerequisites": {
        "Skill": {"Bluff": 1},
        "Special": "rage class feature",
        "Race": "Gnome"
        },
        "benefit": "Use the Bluff skill to feint while raging."
    },
    "Taskmaster": {
        "prerequisites": {
        "Feat": "Demoralizing Lash",
        "Skill": {"Intimidate": 5},
        "Race": "Hobgoblin"
        },
        "benefit": "As a standard action, you spur an ally, who must have fewer Hit Dice than yourself, to reckless effort. For 1 minute, the ally gains a +1 morale bonus on attack rolls, weapon damage rolls, and Will saves against mind-affecting effects. However, the ally also takes a –2 penalty to AC and on skill checks. To affect an unwilling ally, you must succeed at an Intimidate check with the same DC used to demoralize your ally."
    },
    "Team Up": {
        "prerequisites": {
        "Feat": "Gang-Up",
        "BAB": 6
        },
        "benefit": "Aid another as a move action with two adjacent allies."
    },
    "Technology Adept": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "Feat": ["Exotic Weapon Proficiency (firearms)", "Point-Blank Shot"]
        },
        "benefit": "Gain a bonus on save DCs to resist the effects of technological firearms."
    },
    "Teleport Tactician": {
        "prerequisites": {
        "Feat": ["Combat Reflexes", "Disruptive", "Spellbreaker"]
        },
        "benefit": "Teleporting creatures provoke attacks of opportunity."
    },
    "Terrorizing Display": {
        "prerequisites": {
        "Feat": ["Dazzling Display", "Demoralizing Lash", "Taskmaster", "Weapon Focus"],
        "Skill": {"Intimidate": 10},
        "Race": "Hobgoblin",
        "Proficiency": "selected weapon"
        },
        "benefit": "When you use Dazzling Display, in addition to its normal effects, you can use it to spur allies within 30 feet as if you had used the Taskmaster feat. Use the same Intimidate check to determine the effects of Dazzling Display and this feat."
    },
    "Thrill of the Hunt": {
        "prerequisites": {
        "Skill": {"Survival": 1},
        "OR": [
            {"BAB": 4},
            {"Special": "track class feature"}
        ]
        },
        "benefit": "Designate a creature you are tracking as your prize to gain bonuses against it."
    },
    "Throat Slicer": {
        "prerequisites": {
        "BAB": 1
        },
        "benefit": "When using a 1-handed, light, or natural weapon, you can deliver a coup de grace to an unconscious, bound, or pinned target (though not other kinds of helpless targets) as a standard action."
    },
    "Throw Anything": {
        "prerequisites": {},
        "benefit": "No penalties for improvised ranged weapons."
    },
    "Throw Back Arrows": {
        "prerequisites": {
        "Stat": {"DEX": 17},
        "Feat": ["Deflect Arrows", "Improved Unarmed Strike", "Snatch Arrows"]
        },
        "benefit": "When using the Snatch Arrows feat, you can throw a caught piece of ranged ammunition (such as an arrow, bolt, or sling bullet, but not a firearm bullet) as though it were a thrown weapon."
    },
    "Thunder and Fang": {
        "prerequisites": {
        "Stat": {"STR": 15},
        "Feat": ["Two-Weapon Fighting", "Weapon Focus (earth breaker)", "Weapon Focus (klar)"]
        },
        "benefit": "Learn the Thunder and Fang fighting style."
    },
    "Touch of Serenity": {
        "prerequisites": {
        "Stat": {"WIS": 18},
        "Feat": "Improved Unarmed Strike",
        "BAB": 8
        },
        "benefit": "Foes hit by unarmed strikes cannot attack or cast spells."
    },
    "Tower Shield Proficiency": {
        "prerequisites": {
        "Feat": "Shield Proficiency"
        },
        "benefit": "No penalties on attack rolls when using a tower shield."
    },
    "Traditional Weapons": {
        "prerequisites": {
        "Stat": {"INT": 13}
        },
        "benefit": "You receive a +2 bonus on combat maneuver checks against creatures wielding exotic weapons, firearms, or technological weapons. You also receive a +2 bonus to your CMD whenever an opponent attempts any combat maneuver against you while wielding such a weapon. You gain these bonuses only if you are not wielding an exotic weapon, firearm, or technological weapon."
    },
    "Trample": {
        "prerequisites": {
        "Feat": "Mounted Combat"
        },
        "benefit": "Overrun targets while mounted."
    },
    "Tree Hanger": {
        "prerequisites": {
        "Skill": {"Acrobatics": 1},
        "Race": "Vanara"
        },
        "benefit": "You gain a +2 bonus to your CMD against all trip attacks. If your square has a branch or other sturdy large object that you could hang from, as a swift action you may make a DC 15 Acrobatics check to jump upward and use your tail to hang from that object. While hanging, you can’t be tripped, you ignore the effects of difficult terrain in your square, and you gain a +2 bonus to your CMD against bull rush, drag, and reposition attacks. If you leave that square (including if you are moved against your will), you lose your grip on the object and are no longer hanging. While hanging, you cannot use your tail for anything else."
    },
    "Trick Riding": {
        "prerequisites": {
        "Skill": {"Ride": 9},
        "Feat": "Mounted Combat"
        },
        "benefit": "Automatically pass simple Ride skill checks."
    },
    "Trick Shooter": {
        "prerequisites": {
        "Stat": {"DEX": 13},
        "Feat": "Deadly Aim",
        "BAB": 1
        },
        "benefit": "You gain a +2 bonus on ranged combat maneuvers. When you attempt to perform a ranged combat maneuver, you can refrain from damaging the target at no penalty."
    },
    "Trip, Improved": {
        "prerequisites": {
        "Feat": "Combat Expertise"
        },
        "benefit": "+2 bonus on trip attempts, no AOO."
    },
    "Trip, Greater": {
        "prerequisites": {
        "Feat": ["Combat Expertise", "Improved Trip"],
        "BAB": 6,
        "Stat": {"INT": 13}
        },
        "benefit": "Enemies you trip provoke attacks of opportunity."
    },
    "Tripping Staff": {
        "prerequisites": {
        "Stat": {"INT": 13},
        "Feat": ["Combat Expertise", "Improved Trip", "Weapon Focus (quarterstaff)"],
        "BAB": 6
        },
        "benefit": "Treat a quarterstaff as if it had the trip weapon special feature."
    },
    "Tripping Strike": {
        "prerequisites": {
        "Feat": "Trip, Improved",
        "BAB": 9
        },
        "benefit": "Attempt a trip attack on a successful critical hit."
    },
    "Tripping Twirl": {
        "prerequisites": {
        "Stat": {"INT": 13},
        "Feat": ["Combat Expertise", "Improved Trip", "Tripping Staff", "Weapon Focus (quarterstaff)", "Weapon Specialization (quarterstaff)"],
        "BAB": 12
        },
        "benefit": "Use a quarterstaff to make a trip attempt against all adjacent enemies."
    },
    "Twin Thunders": {
        "prerequisites": {
        "Alternate": [
            {"Special": "Flurry of blows class feature"},
            {"Feat": "Two-Weapon Fighting"}
        ],
        "Feat": "Weapon Focus (wielded bludgeoning weapons)",
        "Special": "defensive training race trait",
        "Race": ["Dwarf", "Gnome"]
        },
        "benefit": "Substitute disarm, sunder, and trip for any of your attacks vs. giants."
    },
    "Twin Thunders Flurry": {
        "prerequisites": {
        "Feat": "Twin Thunders",
        "BAB": 6
        },
        "benefit": "Trip a giant of up to Huge size, and deal +2 damage against giants."
    },
    "Twin Thunders Master": {
        "prerequisites": {
        "Feat": "Twin Thunders Flurry",
        "BAB": 9
        },
        "benefit": "Opponent struck by Twin Thunders is shaken."
    },
    "Twinned Feint": {
        "prerequisites": {
        "Stat": {"CHA": 13}
        },
        "benefit": "After succeeding at a feint, you can attempt a feint against a second target."
    },
    "Two-Handed Thrower": {
        "prerequisites": {
        "Stat": {"STR": 15}
        },
        "benefit": "Gain Str bonus when using two hands to throw a one or two-handed weapon."
    },
    "Two-Weapon Defense": {
        "prerequisites": {
        "Feat": "Two-Weapon Fighting"
        },
        "benefit": "Gain +1 shield bonus when fighting with two weapons."
    },
    "Two-Weapon Feint": {
        "prerequisites": {
        "Feat": ["Combat Expertise", "Two-Weapon Fighting"]
        },
        "benefit": "Forgo first melee attack to feint."
    },
    "Two-Weapon Fighting": {
        "prerequisites": {
        "Stat": {"DEX": 15}
        },
        "benefit": "Reduce two-weapon fighting penalties."
    },
    "Two-Weapon Fighting, Improved": {
        "prerequisites": {
        "Stat": {"DEX": 17},
        "Feat": "Two-Weapon Fighting",
        "BAB": 6
        },
        "benefit": "Gain additional off-hand attack."
    },
    "Two-Weapon Fighting, Greater": {
        "prerequisites": {
        "Stat": {"DEX": 19},
        "Feat": "Improved Two-Weapon Fighting",
        "BAB": 11
        },
        "benefit": "Gain a third off-hand attack."
    },
    "Two-Weapon Grace": {
        "prerequisites": {
        "Stat": {"DEX": 15},
        "Feat": ["Two-Weapon Fighting", "Weapon Finesse"],
        "OR": [
            {"Feat": "Fencing Grace"},
            {"Feat": "Slashing Grace"},
            {"Feat": "Starry Grace"}
        ]
        },
        "benefit": "You can gain the benefit of the Fencing Grace, Slashing Grace, or Starry Grace feats while fighting with two weapons. Your penalties from two-weapon fighting increase by 2 on all attack rolls you make when doing so, and you can’t decrease the penalties to less than –2 even if other abilities would reduce the penalties further. Add 1/2 your Dexterity bonus to damage with your off-hand weapon instead of 1/2 your Strength modifier. If you attack without using your off-hand weapon, you can use the aforementioned feats despite your other hand being occupied. In addition, Two-Weapon Grace counts as Double Slice for the purposes of qualifying for the Two-Weapon Rend feat."
    },
    "Two-Weapon Rend": {
        "prerequisites": {
        "Feat": ["Double Slice", "Improved Two-Weapon Fighting"],
        "BAB": 11
        },
        "benefit": "Rend a foe hit by both your weapons."
    },
    "Unarmed Strike, Improved": {
        "prerequisites": {},
        "benefit": "Always considered armed"
    },
    "Uncanny Defense": {
        "prerequisites": {
        "Feat": "Cautious Fighter",
        "BAB": 3,
        "Race": "halfling"
        },
        "benefit": "While fighting defensively or taking the total defense action, you gain a bonus on your Reflex saving throws and to your CMD equal to 1/2 of the dodge bonus to AC you gained from taking that action."
    },
    "Under and Over": {
        "prerequisites": {
        "Feat": "Agile Maneuvers",
        "Size": "Small or smaller"
        },
        "benefit": "Failed grapples against you cause attacker to fall prone"
    },
    "Undersized Mount": {
        "prerequisites": {
        "Skill": {
            "Ride": 1
        }
        },
        "benefit": "Ride creatures of your size"
    },
    "Unseat": {
        "prerequisites": {
        "Feat": [
            "Improved Bull Rush",
            "Mounted Combat"
        ]
        },
        "benefit": "Knock opponents from their mounts"
    },
    "Unyielding Ferocity": {
        "prerequisites": {
        "Stat": {
            "CON": 19
        },
        "Special": "ferocity"
        },
        "benefit": "Make a full attack when reduced to 0 or fewer hit points, with restrictions"
    },
    "Upsetting Shield Style": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Special": "proficiency with bucklers"
        },
        "benefit": "You can shield bash with a buckler as if it were a light shield, and you can use the buckler in conjunction with any feats or abilities that normally apply to light shields. While using this style, whenever you successfully deal damage to an opponent with a shield bash using your buckler, that opponent takes a –2 penalty on all attack rolls made against you until the start of your next turn."
    },
    "Upsetting Strike": {
        "prerequisites": {
        "Stat": {
            "DEX": 15
        },
        "Feat": [
            "Combat Reflexes",
            "Improved Shield Bash",
            "Upsetting Shield Style"
        ],
        "Special": "proficiency with bucklers"
        },
        "benefit": "While using Upsetting Shield Style, if a foe is taking a penalty on attack rolls against you as a result of Upsetting Shield Style, and that foe makes a melee attack roll against you that misses your AC by 5 or more, that foe provokes an AOO from you. You can only make one AOO against an opponent in this manner each round."
    },
    "Upsetting Vengeance": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": [
            "Combat Reflexes",
            "Improved Shield Bash",
            "Upsetting Shield Style",
            "Upsetting Strike"
        ],
        "Special": "proficiency with bucklers"
        },
        "benefit": "While using Upsetting Shield Style, the penalty on attack rolls foes take for being hit by your shield bash attack applies to their attacks against any target. If an adjacent foe taking this penalty makes an attack roll against any target and misses the target’s AC by 5 or more, that foe provokes an AOO from you. You can only make one AOO against an opponent as a result of this feat or Upsetting Strike each round."
    },
    "Vanguard Style": {
        "prerequisites": {
        "Feat": [
            "Bodyguard",
            "Combat Reflexes"
        ],
        "Special": "proficiency with light or heavy shields"
        },
        "benefit": "While using this style, when an adjacent ally is required to make a Reflex saving throw, you can expend a use of an AOO to attempt the aid another action to improve your ally’s Reflex save. Your ally gains a +2 bonus to all Reflex saves while adjacent to you until the beginning of your next turn."
    },
    "Vanguard Hustle": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": [
            "Bodyguard",
            "Combat Patrol",
            "Combat Reflexes",
            "Mobility",
            "Saving Shield",
            "Vanguard Style",
            "Vanguard Ward"
        ],
        "Special": "proficiency with light or heavy shields"
        },
        "benefit": "Add half of your shield’s enhancement bonus to the shield bonus to AC that you grant to an ally using the Saving Shield feat. While using Vanguard Style, whenever you increase your threatened area with Combat Patrol, your ward retains the bonuses of Vanguard Style as long as he remains within your threatened area, and you can use Bodyguard, Saving Shield, and Vanguard Style whenever an ally that is within this threatened area is the target of an attack."
    },
    "Vanguard Ward": {
        "prerequisites": {
        "Feat": [
            "Bodyguard",
            "Combat Reflexes",
            "Vanguard Style"
        ],
        "Special": "proficiency with light or heavy shields"
        },
        "benefit": "While using Vanguard Style, when an adjacent ally is attacked or required to make a Reflex saving throw, you can expend a use of an AOO to use both Bodyguard and Vanguard Style to protect that ally. You can also lose your shield bonus to AC to grant your ally a shield bonus to AC of the same value for as long as that ally gains a bonus to Reflex saves from Vanguard Style."
    },
    "Vast Hatred": {
        "prerequisites": {
        "Race": "Gnome",
        "Special": "hatred racial trait"
        },
        "benefit": "Select two creature types (and subtypes where appropriate) from the list of potential favored enemies from the ranger class ability. Your +1 attack bonus from the hatred racial trait applies to creatures of the selected types (and subtypes)."
    },
    "Vicious Stomp": {
        "prerequisites": {
        "Feat": [
            "Combat Reflexes",
            "Improved Unarmed Strike"
        ]
        },
        "benefit": "When an opponent falls prone, it provokes an attack of opportunity from you."
    },
    "Vigilant Charger": {
        "prerequisites": {
        "Stat": {
            "STR": 13,
            "DEX": 13
        },
        "Feat": "Combat Reflexes"
        },
        "benefit": "Ready an action to charge an enemy."
    },
    "Violent Display": {
        "prerequisites": {
        "Feat": [
            "Dazzling Display",
            "Weapon Focus"
        ],
        "BAB": 6
        },
        "benefit": "When you land a successful sneak attack or confirm a critical hit against a creature with a weapon with which you have Weapon Focus, you can use Dazzling Display as an immediate action."
    },
    "Vital Strike": {
        "prerequisites": {
        "BAB": 6
        },
        "benefit": "Deal twice the normal damage on a single attack."
    },
    "Vital Strike, Improved": {
        "prerequisites": {
        "Feat": "Vital Strike",
        "BAB": 11
        },
        "benefit": "Deal three times the normal damage on a single attack."
    },
    "Vital Strike, Greater": {
        "prerequisites": {
        "Feat": "Improved Vital Strike",
        "BAB": 16
        },
        "benefit": "Deal four times the normal damage on a single attack."
    },
    "Volley Fire": {
        "prerequisites": {
        "Feat": [
            "Point-Blank Shot",
            "Precise Shot"
        ]
        },
        "benefit": "You gain a +1 bonus on ranged attack rolls for each ally with this feat who has made a ranged attack against a target within 15 feet of your target, up to a maximum bonus of +4. These allies do not provide cover against your attacks."
    },
    "Vulpine Pounce": {
        "prerequisites": {
        "Race": "Kitsune",
        "Feat": "Swift Kitsune Shapechanger"
        },
        "benefit": "When you change shape into your kitsune form and charge an enemy in the same round, you can make a full attack at the end of your charge."
    },
    "Warning Shot": {
        "prerequisites": {
        "Feat": [
            "Point-Blank Shot",
            "Precise Shot",
            "Weapon Focus"
        ],
        "Special": "proficient with the selected weapon"
        },
        "benefit": "As a standard action, you can make a ranged touch attack using a ranged weapon with which you have Weapon Focus. If successful, instead of dealing damage or applying any other effects of the attack, you may attempt an Intimidate check to demoralize the target as a free action. The target doesn’t need to be within 30 feet, nor does it need to be able to see or hear you."
    },
    "Wave Strike": {
        "prerequisites": {
        "OR": [
            {
            "Feat": "Weapon expertise class feature"
            },
            {
            "Feat": "Quick Draw",
            "Skill": {
                "Bluff": 1
            }
            }
        ]
        },
        "benefit": "Spend a swift action to make a Bluff check to feint"
    },
    "Weapon Finesse": {
        "prerequisites": {},
        "benefit": "Use Dex instead of Str on attack rolls with light weapons"
    },
    "Weapon Focus": {
        "prerequisites": {
        "Special": "proficient with weapon",
        "BAB": 1
        },
        "benefit": "+1 bonus on attack rolls with one weapon"
    },
    "Weapon Focus, Greater": {
        "prerequisites": {
        "Feat": "Weapon Focus",
        "Class": {
            "Fighter": 8
        }
        },
        "benefit": "+1 bonus on attack rolls with one weapon"
    },
    "Weapon of the Chosen": {
        "prerequisites": {
        "Feat": "Weapon Focus with deity’s favored weapon",
        "Special": "worship and receive spells from a deity"
        },
        "benefit": "As a swift action, your first attack with the weapon counts as magical"
    },
    "Improved Weapon of the Chosen": {
        "prerequisites": {
        "Feat": "Weapon of the Chosen"
        },
        "benefit": "Gain the benefits of Weapon of the Chosen until the start of your next turn"
    },
    "Greater Weapon of the Chosen": {
        "prerequisites": {
        "Feat": "Improved Weapon of the Chosen"
        },
        "benefit": "Roll twice with your favored weapon and take the better roll"
    },
    "Weapon Specialization": {
        "prerequisites": {
        "Feat": "Weapon Focus",
        "Class": {
            "Fighter": 4
        }
        },
        "benefit": "+2 bonus on damage rolls with one weapon"
    },
    "Weapon Specialization, Greater": {
        "prerequisites": {
        "Feat": "Weapon Specialization",
        "Class": {
            "Fighter": 12
        }
        },
        "benefit": "+2 bonus on damage rolls with one weapon"
    },
    "Weapon Versatility": {
        "prerequisites": {
        "Feat": "Weapon Focus",
        "BAB": 1
        },
        "benefit": "When wielding a weapon with which you have Weapon Focus, you can shift your grip as a swift action so that your weapon deals bludgeoning, piercing, or slashing damage instead of the damage type normally dealt by that weapon. You may switch back to the weapon’s normal damage type or another damage type as a swift action."
    },
    "Weathered Warrior": {
        "prerequisites": {
        "Skill": "Endurance"
        },
        "benefit": "In areas of strong or severe wind or when affected by wind effects or spells that penalize ranged attacks, you take only half the ranged attack penalty. You can make ranged attacks in windstorm-level winds at a –4 penalty."
    },
    "Wheeling Charge": {
        "prerequisites": {
        "Feat": [
            "Mounted Combat",
            "Ride-By Attack"
        ],
        "Skill": {
            "Ride": 5
        }
        },
        "benefit": "You and your mount suffer no penalties for squeezing when close to others with this feat. You and your mount gain a +2 bonus on CMD versus bull rush, overrun, and trip attempts."
    },
    "Whip Mastery": {
        "prerequisites": {
        "Feat": "Weapon Focus (whip)",
        "BAB": 2
        },
        "benefit": "Using a whip does not provoke attacks of opportunity"
    },
    "Improved Whip Mastery": {
        "prerequisites": {
        "Feat": "Whip Mastery",
        "BAB": 5
        },
        "benefit": "Threaten with your whip and grasp Tiny objects"
    },
    "Greater Whip Mastery": {
        "prerequisites": {
        "Feat": "Improved Whip Mastery",
        "BAB": 8
        },
        "benefit": "Grapple using a whip"
    },
    "Whip Slinger": {
        "prerequisites": {
        "Special": "proficient with sling"
        },
        "benefit": "You threaten normally even when wielding a sling, double sling, or halfling sling staff."
    },
    "Whirlwind Attack": {
        "prerequisites": {
        "Stat": {
            "DEX": 13
        },
        "Feat": [
            "Combat Expertise",
            "Spring Attack"
        ],
        "BAB": 4
        },
        "benefit": "Make one melee attack against all foes within reach"
    },
    "Wilding Strike": {
        "prerequisites": {
        "Stat": {
            "STR": 13
        },
        "Feat": [
            "Improved Unarmed Strike",
            "Wilding"
        ]
        },
        "benefit": "Your unarmed strike damage increases to 1d6 (or 1d4 if you are Small)"
    },
    "Improved Wilding Strike": {
        "prerequisites": {
        "Stat": {
            "STR": 16
        },
        "Feat": [
            "Improved Unarmed Strike",
            "Wilding",
            "Wilding Strike"
        ],
        "BAB": 11
        },
        "benefit": "Your unarmed strike damage increases to 1d8 (or 1d6 if you are Small)"
    },
    "Greater Wilding Strike": {
        "prerequisites": {
        "Stat": {
            "STR": 18
        },
        "Feat": [
            "Improved Unarmed Strike",
            "Improved Wilding Strike",
            "Wilding",
            "Wilding Strike"
        ],
        "BAB": 16
        },
        "benefit": "Your unarmed strike damage increases to 1d10 (or 1d8 if you are Small)"
    },
    "Wind Stance": {
        "prerequisites": {
        "Stat": {
            "DEX": 15
        },
        "Feat": "Dodge",
        "BAB": 6
        },
        "benefit": "Gain 20% concealment if you move"
    },
    "Winter’s Strike": {
        "prerequisites": {
        "OR": [
            {
            "Special": "Nature Magic"
            },
            {
            "Special": "ability to cast druid or ranger spells"
            }
        ],
        "Feat": "Vital Strike",
        "Skill": {
            "Knowledge (nature)": 5
        }
        },
        "benefit": "Target of your Vital Strike must successfully save or become fatigued"
    },
    "Witchbreaker": {
        "prerequisites": {
        "Feat": "Iron Will"
        },
        "benefit": "Gain a +2 bonus on saves against effects from hags and witches; can potentially break their mind-affecting effects on allies with successful critical hits"
    },
    "Witty Feint": {
        "prerequisites": {
        "Skill": {
            "Bluff": 1
        },
        "Special": "weapon training class feature",
        "Race": "gnome"
        },
        "benefit": "When using feint, gain a dodge bonus to AC instead of denying an opponent their Dex bonus."
    },
    "Woodland Wraith": {
        "prerequisites": {
        "Stat": {
            "DEX": 15
        },
        "Feat": "Dodge",
        "BAB": 6
        },
        "benefit": "Gain concealment when withdrawing or taking multiple actions and ending movement in naturally occurring difficult terrain"
    },
    "Wounded Paw Gambit": {
        "prerequisites": {
        "Feat": "Broken Wing Gambit",
        "Skill": {
            "Bluff": 5
        }
        },
        "benefit": "When you use Broken Wing Gambit, nearby allies can attempt a ranged attack against the attacker"
    }
}
    